[
    {
        "moduleCode": "AAA08B FASHION & DESIGN: WEARABLE ART AS A SECOND SKIN",
        "description": "Develop process skills in expression and visual articulation through the creation of wearable art works as a second skin. It is an initiation into fashion design and illustration world and will focus on the fundamentals of creating form, controlling volume and surface treatments for the body. Students of this hands-on class will experience illustrating their creations as well constructing their works to achieve a wearable art work.\n\nAttendance is a requirement as there are continual and formative assessments."
    },
    {
        "moduleCode": "AAC18A CHINESE CALLIGRAPHY",
        "description": "Origin and development of Chinese calligraphy; various styles; lives and styles of prominent calligraphers; the use of the Chinese brush; techniques in writing the basic strokes; demonstrations and practices."
    },
    {
        "moduleCode": "AAD08A MALAY IN CONTEXT",
        "description": "This course examines how Malay works in a wide range of contexts, including the media, fiction, academic writing and everyday conversation. It provides a beginner's framework and meta-language for talking about how written and oral communications can be adapted in ways, which present our message and us in different lights. The aim is to enable you to make systematic and critical observations of language as they use and encounter it in different contexts."
    },
    {
        "moduleCode": "AAE18B LANGUAGE IN CONTEXT",
        "description": "This course aims to help students to develop into systematic and critical observers of language as they use and encounter it in different contexts. As we examine spoken and written texts from across a variety of settings, students will be introduced to a beginner's framework and metalanguage for talking about texts, interactions, and social context. These will enable students not only to appreciate how language works to enable purposeful communication in context, but also to understand how it often works to mask underlying purposes and values. The course also explores how language interacts with the visual mode in texts, encouraging students to consider what is needed for us to understand the increasingly multimodal texts in today's society and what this might mean for them as future teachers of English."
    },
    {
        "moduleCode": "AAB20D ECOLOGY",
        "description": "This course builds upon basic biological knowledge covered in foundational undergraduate courses, and focuses on the dynamics of species populations, and the interactions between organisms and their environment.  Besides covering the theory and mechanisms in the respective concepts, the course explicitly links the former to real-world phenomena and applications.  Topics are taught with linkages to the current school curricula."
    },
    {
        "moduleCode": "ES3307 EXPERIMENTAL DESIGN & ANALYSIS FOR ECOLOGY",
        "description": "This course introduces you to the basic principles of experimental design and analysis of ecological experiments. It introduces you to methods and key concepts for designing and implementing experiments in both the field and laboratory. You will learn how to plan and execute an experiment, key concepts in designing experiments, and how to analyse and present your results. This course builds on the statistical and R skills you should have learned in BS1008 and MH3511, and you will learn how to apply these statistical methods to real-life ecological field and lab experiments. This course uses R, and assumes some introductory knowledge of statistics and the R language. \n\nThis course is a pre-requisite for ES4002 Final Year Project Ecology specialization students."
    },
    {
        "moduleCode": "AAF08B APPRECIATING MULTICULTURALISM THROUGH STORY",
        "description": "This course introduces `story' as a medium to appreciate multiculturalism. By using selected modern and classical literary texts and close reading of texts as well as ICT-based media, you will be given the opportunity to appreciate values, tradition and culture of various communities, namely Chinese, Malay and Indian, with contextual understanding. Current multiculturalism-related issues such as cultural representation, transnationalism, cultural parochialism will also be discussed. This course will be delivered in English. All readings and teaching resources are available in English."
    },
    {
        "moduleCode": "AAI16B BAROQUE & CLASSICAL MUSICAL PRACTICES",
        "description": "This course seeks to introduce to student teachers Western musical practices by situating them in a social and historical context. Musical practices, via creating performing and responding, form the basis of learning about any specific musical practice and the activity of experiencing and reflecting on the musical practice. Each musical practice would have to be viewed from its own culturally situated and practice specific context. This course acknowledges a constructivist paradigm in the teaching and learning of and about music asserting knowledge as being uniquely constructed by individuals. Learning is facilitated in an environment, which is created and/or constructed by both student teachers and facilitators as stakeholders."
    },
    {
        "moduleCode": "AAG28C UNDERSTANDING TOURISM",
        "description": "Tourism is arguably the world's largest industries and has been considered as an economic development option by many developing countries. However, it is debatable whether income generated through tourism can bring marginalized communities increased economic independence and life standards. This course aims to use tourism as a lens to explore key issues of globalization and socio-economic development and how tourism, a global phenomenon, influences local people's lives. Course objectives are to 1) introduce the concepts relevant to tourism and globalization; 2) apply theoretical frameworks to the analysis of contemporary issues of the globalization of tourism, and the complex relationships that link local, regional, national and international processes and patterns of tourism development; 3) explore the dynamic relationship between the forces of globalization, transnational tourism corporations, and the state and civil society in the context of tourism; and 4) assess critically the economic, political and social ramifications of the systemic sources of power and inequality which are reflected in and sustained by international tourism."
    },
    {
        "moduleCode": "AAR08A LITERATURES OF SOUTHEAST ASIA",
        "description": "This course aims to examine selected literary works from Southeast Asian countries, from the point of view of their literary techniques and themes, as well as within the contexts of their literary traditions and geopolitical, social and cultural negotiations. In order to develop a collaborative and comparative frame of interpretation and understanding, common themes that will be explored across the literatures from various countries include colonization and independence, nationalism, the continuing influence of traditional and ethnic cultures, and the evolution of literary style and genre. Careful attention will be paid to considering the meanings and possible impact of each of these works within their own society as well as to elucidating how each work can be seen to manifest culturally specific values, ideologies and philosophies. In order to achieve this, selected theoretical, cultural and multimedia texts will be introduced alongside the core literary texts."
    },
    {
        "moduleCode": "AB1403 INTERMEDIATE EXCEL",
        "description": "This course focuses on teaching introductory through intermediate techniques in Excel. No prior knowledge in programming or advanced math skills are necessary. Upon completion of the course, students will gain skills in Excel, data management and real-world problem solving."
    },
    {
        "moduleCode": "AAU08A THEATRE GAMES: ENGAGEMENT THROUGH PLAY",
        "description": "This module examines a range of theatre games conventionally used in a participatory classroom to build specific skills and capabilities.  Students will be introduced to theatre practitioners such as Augusto Boal, Viola Spolin, Clive Barker and Chris Johnstone, who have developed theatre games for actor training as well as team-building. These theories, methods and practices will be used to engage participants in a range of reflective processes, critical dialogue and physical activities that promote stronger social-emotional learning opportunities, inter-personal and intrapersonal skills, as well as civic and social awareness through activities that enhance team-building, trust, confidence, collaboration and the extension of imagination. The principles of practice that underpin the use of theatre games will be explored and explicated in relation to non-traditional theatre contexts. The course will equip students with the necessary facilitation and planning skills crucial for the incorporation of theatre games in the development of programmes to engage an intended audience. Students will learn how to design a short programme using theatre games, in order to work creatively within a range of community settings and expectations. They will also be required to facilitate theatre games for this purpose as part of their assessment. \n\nTopics taught:\n\n1.\tTheatre games for building inter- and intra-personal skills and awareness\n2.\tTheories and principles underpinning theatre games \n3.\tPlanning structures for programmes incorporating theatre games\n4.\tFacilitation approaches to using theatre games"
    },
    {
        "moduleCode": "AAL18A GLOBALISATION: AN INTRODUCTION",
        "description": "The term 'globalisation', having been subject to much use and abuse in both academic and lay discourses, has nowadays become something of a cliche that perhaps obfuscates more than it reveals. This course seeks to provide students with a basic, clear, and relatively comprehensive introduction to the concept. It unpacks globalisation by interrogating its definitions, general theories, and historical/social foundations, before examining in detail a number of key facets to a globalised world, including the global economy, civil society, governance, culture, everyday life, inequality, migration/mobility, and security. In addition, the course also contextualises students' learning by making them think about what globalisation means for Singapore and Singaporeans."
    },
    {
        "moduleCode": "AAM18A MATHEMATICS AROUND US",
        "description": "This course aims to introduce students to the Mathematics that we see in different areas of human life not normally associated with science and technology.  Most students view mathematics as a pragmatic and powerful tool applied in various fields of science and technology.  This course seeks to lead students to an appreciation of the human aspects of Mathematics through an understanding of its presence in the arts and other common human activities. The course will explore the presence and use of mathematics in the diverse areas where mathematics is less expected, such as art, music, sports, games of chance, coding, persuasion and decision making, magic tricks and puzzles.  Selected anecdotes of mathematical discoveries will also be included."
    },
    {
        "moduleCode": "AAQ10A PRINCIPLES OF NUTRITION",
        "description": "The course covers the fundamentals of Nutrition and Food, which encompass: the study of nutrients, energy balance, nutrition/diet tools such as the Healthy Diet Pyramid, Recommended Daily Allowances (RDA) and Food Composition Table.\n\nExtended areas of discussion/ exploration include:\n-\tFactors related to food labelling and choices,\n-\tMeeting an individual?s nutritional requirement\n-\tDecision making regarding current nutrition-related issues\n-\tComparing the use of different RDA from different countries"
    },
    {
        "moduleCode": "AC2401 ACCOUNTING INFORMATION SYSTEMS",
        "description": "This course aims to provide you with a strong conceptual and technical foundation in key business processes and enterprise information systems, a necessary pre-requisite for effective performance of business professionals in the current digital era.  \n\nAfter the completion of this course, you should be able to apply your knowledge and skills to effectively evaluate business processes, and to use enterprise information systems in your future roles as business managers, professionals, and consultants."
    },
    {
        "moduleCode": "ADP26B THEATRE FOR YOUNG PEOPLE: METHODS & PRACTICES",
        "description": "This course will investigate current philosophies, practices and approaches of involving young people in the process of making theatre, for young people, particularly in Singapore. It will focus on modes of devising and presenting children's theatre, youth theatre, Theatre-in-Education and community-based performance in a practical workshop format. Students will work through a play building process to devise material suitable for the aforementioned groups of people, with them taking on the roles of performers and/or facilitators. The course will question the relevance and value of existing practices of theatre-making by and for youth and the community."
    },
    {
        "moduleCode": "AD1101 FINANCIAL ACCOUNTING",
        "description": "This course aims to provide you with the necessary introductory accounting knowledge to understand how to use financial statement information to make economic decisions from a user perspective such as investors and creditors. In the process, you will learn to prepare a basic set of financial statements in accordance with the Singapore Financial Reporting Standards. The course also examines the impact of various accounting choices on the financial statements and the incentives that contracts based on accounting numbers can create for different stakeholders. This will help you understand why managers choose certain accounting methods and avoid others. This learning forms the foundation for further studies in areas which require accounting knowledge."
    },
    {
        "moduleCode": "AED06A SPECIAL NEEDS EDUCATION & INCLUSION",
        "description": "This course provides student teachers a basic understanding of the main concepts of special needs education and inclusion. It is important that those working with individuals with disabilities or special needs gain foundational knowledge and understanding of special needs education and inclusion, particularly in the Singapore context. This course seeks to introduce students to the historical trends and contemporary issues concerning individuals with special needs/disabilities at the local as well as international contexts.  Students will have the opportunity to learn how persons with different disabilities/special needs can be supported within school, home and community environments. Contemporary issues in special education and inclusive education that affect the knowledge, understanding and service provision for various disabilities/special needs in Singapore and elsewhere will be addressed. Students will also have the opportunity to clarify and affirm their values, beliefs, roles and responsibilities in serving the needs of persons with special needs."
    },
    {
        "moduleCode": "AGE06A BRAIN LITERACY FOR EDUCATORS",
        "description": "This course aims to equip student educators with an understanding of how a learner's brain operates in learning areas such as reading, writing, computing mathematics and executive functioning. By analyzing the structural and functional organization of the brain, educators will be more informed about popular myths such as learning styles and age-appropriate learning stages. This course will also explore how such insights into the learner's brain can be used to inform choices about learning environments and practices for teaching and learning. Educators looking to understand the inner workings of a learner's brain would find this course useful."
    },
    {
        "moduleCode": "BA3205 ACTUARIAL COMPUTING",
        "description": "This course is specially designed for actuarial science students who are interested in learning the software tools frequently used by actuaries in the financial industry such as Excel, VBA, SQL and R and understanding how to communicate model and model results to target audiences. The course uses various real-life examples for demonstration in order to give the students firsthand experience of how the actuaries using the software tools in solving the problems faced by them in their day-to-day works. This course is also designed with the aims to meet the new syllabus offered by Institute and Faculty of Actuaries (IFoA), UK and to maintain the accreditation status with IFoA."
    },
    {
        "moduleCode": "BC2402 DESIGNING & DEVELOPING DATABASES",
        "description": "This course introduces participants to design, tools, techniques, and issues concerning the management of data. Data management is the foundation for organizations' business analytics; and for problem solving and decision-making. Participants will analyse a variety of business process, identify data requirements and develop an information system to support business processes and gather information for business analytics. In this course, participants will have an opportunity to apply their design and development competencies by implementing a database solution."
    },
    {
        "moduleCode": "AGQ28C FOOD & SOCIETY",
        "description": "This course focuses on the patterns, customs and management of foods in the context of diverse cultural populations. The influences of history and origins, culture and religions on foods, the impact of geographical and economic factors on food patterns, eating habits, preparation of traditional foods from around the world, and the impact of these on the Singapore food scene and marketplace. Student teachers will have a more holistic understanding of the development of food habits and commodities and, in turn, assist them in the teaching of Food and Consumer Education/Food and Nutrition."
    },
    {
        "moduleCode": "AGT08B TAMIL CULTURE THROUGH FOOD & FESTIVALS",
        "description": "This course introduces ancient and contemporary Tamil culture through Tamil food and festivals. Every community has its food heritage, and their festivals embody their cultural and religious beliefs. This course will equip you with a greater understanding and appreciation of Tamil food culture and traditional festivals."
    },
    {
        "moduleCode": "BE1401 BUSINESS OPERATIONS & PROCESS",
        "description": "This course seeks to provide business and accountancy undergraduates with a rigorous appreciation of the issues and methodologies necessary for ensuring the competitiveness of the operations function in a firm. The course takes an analytics based 'process management' viewpoint while addressing a range of strategic and tactical issues. After completing this course, you will be able to understand the key tradeoffs required for designing, managing and improving operations and processes in both manufacturing and service industries. This will give you a sound analytical background for further courses in Business Analytics Specialization, which in turn will prepare you for a future business career where you will be responsible for either managing operations or its interface with other business functions such as marketing, finance, accounting, human resources and information technology."
    },
    {
        "moduleCode": "BF2213 INTRODUCTION TO COMPLIANCE",
        "description": "This course aims to provide you with a broad understanding of the role of compliance in financial institutions and introduce you to the common issues in the space of regulatory and financial compliance. Course topics include understanding the financial services sector, the role of compliance within financial institutions, the financial regulatory environment and requirements, compliance risks, anti-money laundering risks, and the importance of well-designed and effective control mechanisms. The course will also explore the impact of financial technology (FINTech) and regulatory technology (REGTech) advancements on the compliance landscape. This course is accredited by the Institute of Banking and Finance (IBF) and students who obtain an overall score of B and above will be accredited for IBF's Level 1 Compliance Standards."
    },
    {
        "moduleCode": "ET0001 ENTERPRISE & INNOVATION",
        "description": "This online course aims to provide you with a basic appreciation of the key concepts of enterprise and innovation. The course will focus on empowering you to gain practical insights on the relevance of enterprise and innovation in your lives by introducing you to the enterprise and innovation ecosystem of the University, the Singapore society, and beyond."
    },
    {
        "moduleCode": "BG1801 BIOENGINEERING LAB 1A",
        "description": ""
    },
    {
        "moduleCode": "BH2601 STRATEGIC HR MANAGEMENT & CONSULTING",
        "description": "People are at the heart of all organizations.  The finest hardware, systems, policies etc., can only function as effectively as the people operating/implementing them. Human Capital plays a pivotal role in providing organizations with the edge to not only survive but to thrive amidst the stiff global competition that pervades the business world of today. People are a precious resource in any organization and if well nurtured and led, will form the platform upon which success can be achieved. \n\nIn this course, you will acquire the body of knowledge to understand the key elements in the field of HR as well as to be a Business Partner and an HR Consultant. This course is for all students who are pursuing the HRC Specialization and for those who are interested to learn about Strategic Human Resource Management and how to become an HR Consultant."
    },
    {
        "moduleCode": "BM2501 MARKET BEHAVIOUR",
        "description": "This course will introduce you to key consumer behavior concepts, thus equipping you - as current or future managers - with the knowledge to evaluate and design effective marketing decisions. After the completion of this course, you should be able to understand the psychology of how consumers think, feel, reason, and choose between different alternatives (e.g., brands, products), how social and cultural environments (e.g., friends, family, and culture) influence consumer behaviour, and how marketers can adapt and improve marketing campaigns/strategies to more effectively reach and influence the consumers. You will also learn to appreciate the relevance of consumer behaviour for marketers and policymakers."
    },
    {
        "moduleCode": "BL5302 LAW OF INTELLECTUAL PROPERTY & NEW MEDIA",
        "description": "The electronic communications environment and the internet challenges how businesses protect their informational assets. This course is designed to prepare the candidate to evaluate the strategies needed to face these challenges. This course also looks at the potential liability and the prevention of the misuse of information and the publication of detrimental information. The use of electronic communications and new media (such as social media, blogs, wikis, interactive web-pages and video sharing - where the users are now generating content) continues to challenge the how the law deals with brands - embodying reputation and copyright of works of art, multimedia, databases, music and authored works.\n\nThis course aims to provide students with a good grounding in Intellectual Property law and how far they can be used to protect the interest of electronic property. \n\nThe other main focus is on the regulation of electronic information and communication - or new media. The knowledge-based economy is underpinned by laws which protect information assets and private information, shapes transactions and provides security for the various interests of parties to electronic transactions. This course is designed to give an appreciation of the relationship between law and technology as well as how businesses must work within the rules affecting the knowledge-based economy. The approaches to the subject will be both practical and critical."
    },
    {
        "moduleCode": "BR3212 COMPUTING SOLUTIONS FOR RISK MANAGEMENT & INSURANCE",
        "description": "This course is specially designed for the students who are interested in learning the software tools frequently used by the practitioners in the financial industry such as Excel, VBA, SQL and R and understanding how to communicate model and model results to the target audiences. The course uses various real-life examples for demonstration in order to give the students firsthand experience of how the practitioners using the software tools in solving the problems faced by them in their day-to-day works."
    },
    {
        "moduleCode": "BS0004 INTRODUCTION TO DATA SCIENCE",
        "description": "This course aims to introduce you to the field of data science. By the end of this course, you should appreciate how data science contributes towards Singapore's Smart Nation aspirations, potential ethical issues (especially with the use of AI), and its uses in the biological sciences. It is particularly noteworthy that biology is becoming increasingly digitized thanks to advancements in -omics platforms, advanced analytics, the advent of AI and cloud-based mega-data repositories. Hence, the modern biologist needs to understand how data science could potentially make his/her research more effective. You will learn what this exciting new field is about: how it relates towards Singapore, ethical issues and its application in biological sciences. You will also learn about some of the main themes related to data science, namely algorithms, AI and machine learning, logic, databases and networks."
    },
    {
        "moduleCode": "BU5401 MANAGEMENT DECISION TOOLS",
        "description": "This course aims to develop the use of a scientific approach using mathematical methods and computer software to make managerial decisions.  Future managers, business owners, or professionals from various disciplines who have to work along with businesses would employ methods and tools from this course to formulate their business descriptions into mathematical models to facilitate solution finding."
    },
    {
        "moduleCode": "BT2403 SERVICES OPERATIONS MANAGEMENT",
        "description": "Services make up over 75% of the Singapore economy both in GDP and in employment, with similar trends across the industrialized and developing/emerging nations within the global economy. However, Distinctive characteristics of services such as their intangibility, perishability, simultaneity, and heterogeneity, present unique challenges for managers in service organizations. The main aim of this course is twofold: to introduce you to the most important aspects and general principles of service management across different industries and economies, following a service-dominant logic on business; to provide you with an understanding and essential knowledge of the analysis, modelling, decision making and implementation for managing the operational issues of a service. Emphasis will be on developing your modelling skills with the use of mathematical tools and techniques to manage service operations. Topics include the service concept and operations strategy, the design of effective service delivery networks, service quality management, managing service inventory, waiting line analysis, capacity planning, and yield management."
    },
    {
        "moduleCode": "CB1117 ENGINEERING MATHEMATICS",
        "description": "This course serves as a foundation course on engineering mathematics. It covers a broad range of fundamental topics, including Differential Equations, Linear Algebra, Vector Calculus, Probability and Mathematical Statistics. These key concepts will be important and useful to those of you who are pursuing Engineering studies, with applications in modelling and solutions of systems."
    },
    {
        "moduleCode": "CC0003 ETHICS & CIVICS IN A MULTICULTURAL WORLD",
        "description": "This course aims to equip you with the necessary philosophical foundations to understand theories of ethics and subsequently apply those theories to real-life scenarios and issues. It also aims to enable you to understand and critically assess the civic institutions that structure their local and global communities. To these ends, the course will examine the nature of ethics, its understanding across different cultures, and how it is manifested in concepts, social structures, and governance institutions. Topics to be explored include human rights, democracy, freedom of speech and inequality. The rights and duties of citizenship shall be a unifying theme. You will think through assumptions they hold on all of these matters. They will be provided with the tools to understand various and even contradictory perspectives on these important issues. There will be a substantial amount of time devoted toward understanding Singapore's own institutions and ideologies, which are of course products specific to the country's own unique historical and geo-political circumstances. We expect that you will have better appreciation of the country's institutions after reading the module."
    },
    {
        "moduleCode": "CE2003 DIGITAL SYSTEMS DESIGN",
        "description": "Review of Hardware Description Languages; Real-World Arithmetic; Control and Datapath design; Register Transfer Level (RTL) design in Verilog; Digital Design on FPGAs; Testbenches and Testing Strategies; Using design in registers, counters, shift registers, synchronous and asynchronous reset"
    },
    {
        "moduleCode": "CH2108 THERMODYNAMICS",
        "description": "In this course, you will learn the conceptual forms of energy, ideal gas, thermodynamics properties, and the laws of thermodynamics. The applications of thermodynamics are studied in terms of different phases and their coexistence via phase equilibria and mathematical formula, which will be derived from the 1st and 2nd laws of thermodynamics. In particular, the phase equilibria criteria are introduced to understand the occurrence of the phase separation."
    },
    {
        "moduleCode": "CM2011 ANALYTICAL CHEMISTRY",
        "description": "The lectures provide an introduction to modern analytical methods that are used to quantify species and instrumental methods used to monitor the progress of reactions. The course comprises a mixture of numerical problem solving and descriptive chemical analysis."
    },
    {
        "moduleCode": "CS0102 MAKING SENSE OF BIG DATA",
        "description": "The aim of this course is to introduce students to the concepts and technologies associated with data analytics. The course will firstly help students understand information technology infrastructure that is fundamental to data analytics. Thereafter, data analytics concepts will be explained including big data, machine learning and artificial intelligence. Techniques for conducting data analytics will also be taught. This course would be of interest to students who would like to understand what data analytics is and its applications."
    },
    {
        "moduleCode": "CV1711 ENGINEERING DRAWING  & 3D BUILDING INFORMATION MODELLING",
        "description": "Introduction to students the basic principles of engineering drawings, including the introduction of Computer Aided-Design (CAD) software to create 3D models and to generate 2D construction drawings, and Building Information Management (BIM)."
    },
    {
        "moduleCode": "CY1001 CELL",
        "description": "This course aims to introduce biology at a basic molecular and cellular level and brings into perspective the unifying theme of all living things. It presents the relationship between the molecular principles and the macroscopic view of biology. Basic concepts such as the central dogma or evolution theory, and common biological processes such as cell division or cellular respiration, will be covered. Current advances in biology that have implications to our society and biology's interaction with other disciplines will be highlighted. This is an online course, with support provided via online discussion and face-to-face formal tutorials.\n\nThis course aims to contribute to the education of all the diverse CNYSP students, which have very different background on biology and very distinct academic interests. To do this, the multiple and deep connections between biology and other disciplines will be emphasized in detail. Ultimately, this course aims to develop an interest in biology to all students, especially targeting those taking other specializations on the science and engineering sectors, who could be taking up cross-disciplinary jobs related to biology in the future."
    },
    {
        "moduleCode": "CZ1105 DIGITAL LOGIC",
        "description": "This course aims to develop your ability to analyse and design digital circuits. The design and behaviour of modern digital equipment (e.g. mobile phones and personal computers) are based on functions of binary variables. This course provides you the knowledge to analyse the theoretical characteristics and the skills required for practical technology driven implementations of digital circuits. \nThis course provides an introductory perspective of digital circuits design. It is relevant for anyone pursuing a career in the ICT industry - including those in digital systems, computer architecture and microprocessor based systems design."
    },
    {
        "moduleCode": "DA2002 THINKING & COMMUNICATING VISUALLY II",
        "description": "In this introductory, practice-based workshop course, you will explore the fundamental aspects of two-dimensional design and colour theory. The main emphasis will be on developing an understanding of the visual language of design through paper-based experimentation with a range of techniques. You will learn about visual elements of design, principles of visual organization and composition planning. Analytical and critical thinking skills will be developed through lectures, workshops, making and critique sessions. This course provides foundation skills for further visual communication study."
    },
    {
        "moduleCode": "DD0003 INFORMATION VISUALIZATION",
        "description": "This introductory level course will provide an overview of the practice of information visualization. You will explore fundamental visual design techniques to interpret, organize and present visual interpretations for different forms of data. The learnings achieved in this course will expand your understanding on how complex information can be communicated meaningfully and clearly through visualization to inspire greater empathy and understanding from an audience."
    },
    {
        "moduleCode": "DF2000 DIGITAL FILM PRODUCTION I",
        "description": "Audio-visual storytelling in film\nThe interaction between audio and video in storytelling will be examined focusing on composition, movement of camera and/or objects, on and off screen sound, sequence shots and edited sequences. \n\nSteps of Production\nScript writing, production planning, steps of pre-production, production and post-production, digital film roles in a film crew, their duties and responsibilities, set organisation, procedures and safety on set and the use of film protocols will be addressed. \n\nCinematography and Lighting\nAn introduction to the basic principles of cinematography and lighting will be given. This covers lighting in a studio or indoor situation as well as working with available light outdoors. The use of camera, grip and light equipment will be trained including the understanding of equipment lists and light plans.\n\nProduction design\nConcepts and skills of production design, like moodboards, location photography, designing and transforming locations, will be examined in accordance to the film script and the director?s vision.\n\nDirecting \nThe role of the director in a film production, the collaboration with the director of photography, the production designer and the producer as well as the process of guiding and directing actors will be examined. \n\nEditing and sound design\nThe organisation of a sound- and editing project as well as basic principles of editing, sound-design and scoring will be explored. \n\nDistribution \nThe procedure of test-screenings and the process of distributing a film will be explained.\n\n\nClass assignments\nEight creative, conceptual or organisational assignments cover key areas and competencies in digital filmmaking. The assignments will deepen the knowledge gained through lectures, tutorials and class exercises and will prepare the student for the final project. Peer and instructor feedback will be given."
    },
    {
        "moduleCode": "DM2000 INTERACTIVE I",
        "description": "Modes of interaction:\nIntroduction to the importance of user participation in interactive media. Overview of the modes of interaction including implicit (passive, indirect) and explicit (active, direct) interaction. Identifying the following relational nodes in an interactive media project: user - object, user - user and object - object. Differences between active and passive interaction explored in relationship with semiotics of interaction.\n\nStructure of Interactive project:\nAnalysis of three core elements of the interactive media project: input, processing and output. Introduction to the relationship between these elements and their influence on each other.\n\nSemiotics of Interactive Media:\nDiscussions on meaning of action and participation(input) in relationship with the audio-visual system responses (output) in interactive media projects. Identifying and comparison of processing as another core element with other two(input, output).\n\nDesigning interactions and role of prototyping:\nIdentifying and developing conceptual frameworks for an interactive media project. The importance of the development and design of a project prototype. You will prototype ideas in order to experience your interaction designs before they go to the production stage.\n\nDeveloping and producing interactive projects:\nIdentifying and project development through the following stages of interactive media production (in chronological order): development of a project demo, adjustment of the project goals and outcomes, production, postproduction. \n\nClass assignments:\nOne core interactive media project that enables students to identify the following parts of an interactive media project: input, processing and output. The medium of project can be, but it is not limited to: interactive object, screen, website, game, projection, performance, soundscape, etc. Developed through self-directed learning with guidance, assisted with lectures, tutorials, class exercises, and peer/instructor feedback sessions."
    },
    {
        "moduleCode": "DN1010 EXPERIMENTAL INTERACTION",
        "description": "Experimental interaction introduces students to the basic principles of interaction with media through collaboration, play and group-based projects. The overarching concept of interaction is investigated throughout the course in lectures, readings, and discussion of media art, which accompanies the hands-on projects. Students will be working with digital, networked, and social media, as well as found objects and other materials to explore viewer interaction and peer-to-peer forms of creative play. The course involves a study of DIY (Do it Yourself) and maker culture that better informs an understanding of interdisciplinary and open source thinking critical to the spirit of sharing and collaboration in the arts and design. \n\nCollaboration and Interaction \nStudy interaction design practices in the creation of media projects through group collaboration. \nEngage in the creation of group projects that explore narrative as a process of collective narrative.\n\nOpen Source / Open Culture\nA study of open source ideology and how this form of sharing and collective thinking emerges in the art and design arena.\nStudy examples of DIY and maker culture that emphasize sharing and transparency in the creative process. \n\nRole of the Viewer\nOverview of viewer engagement through human interaction and social discourse.\nUnderstand the changing nature of the interactive design object or artwork in terms of how the viewer has impact and agency on the outcome of the experience. \n\nSocial Media\nAn exploration of social media platforms and how they are used creatively and critically. \nReflect on how the individual in contemporary culture is impacted through the everyday, ubiquitous use of social media. \n\nOnline Technique \nYou will work with the Open Source Studio (OSS) Web platform to document their work and ideas, learning techniques of online writing and media documentation.  \nYou are taught to better understand how your work as artists and designers is enhanced through a better understanding of the online environment as virtual studio space."
    },
    {
        "moduleCode": "DP2008 EXPERIMENTAL PHOTOGRAPHY",
        "description": "This course will introduce you to both contemporary and historical techniques and experimental aspects of the photographic medium. You will gain a repertoire and understanding of diverse techniques that yield interesting results. Many of these techniques can be achieved without access to darkrooms and even without using cameras. The emphasis in this class will be on creativity and experimentation."
    },
    {
        "moduleCode": "DR2000 CONCEPTUAL DESIGN",
        "description": "This course focuses on connecting the worlds of objects, experiences and meanings through a conceptual framework. It introduces the student to the importance of juxtaposing new and contradictory design situations with the task of understanding and resolving them. Subjects are examined through a conceptual lens: studying different aspects of semantics, imagery, perception, behaviour, beliefs, culture as structural frameworks in the development of ideas. Output includes, but is not limited to conceptual objects, user interactions, anthropomorphic interfaces, event/service situations, environmental installations, temporal experiments etc. Teaching in this studio course is by lecture, presentations, projects and assignments.\n\nConceptual Design Framework in the Creative Process:\nThe course begins with an introduction on the importance of placing ideas into a context that is driven not just by its form and function as the design genesis but instead through a tangent that looks at the design process conceptually prior to the practice of design ? a pre-theoretical approach to design by looking at why and how the creative process operates. Content here will critically examine of the design process itself, looking at the methodology designers take for granted in their creative and production activity.\n\nDesign as Discourse/ Critical Design:\nYou will be introduced to the practice of critical design and its variants - such as speculative design and discursive design, and how they serve as powerful tools for discourse about the design of the world. These `tools of design? are critiqued and explored through the use of language, imagery, fantasy, connotations, metaphors, semantics in the conception and development of students? projects.\n\nConceptual Design projects:\nYou will apply conceptual and critical design methods to realize design projects based on various themes."
    },
    {
        "moduleCode": "DT2009 STORYBOARDING & PRODUCTION DESIGN",
        "description": "You will be introduced to the storyboard as a thinking tool, through which creative ideas are developed and given detail. You will learn to employ artistic tools like framing, camera movement, character movement and key visuals within the larger structure of the entire narrative. The role of the storyboard within the animation pipeline and its relevance to concept development, script development, animatics and production design will be covered. The course will focus partucularly focus on the aspects of animation production design that support the dramatic impact of the story. Further insight will be gained of the connection between visual development and storyboard through exercises and assignments on character design, environment and prop design."
    },
    {
        "moduleCode": "DV2001 VISUAL COMMUNICATION I",
        "description": "What is visual communication?\nThis course introduces you to an overview of key concepts and theories around the practice of Visual Communications. You will explore the creation, distribution, reception and consumption of messages and the influence of visual language. You will also be introduced to the roles that visual communication has within society.\n\nElements of Design: Form & Image -\nAn investigation of semiotics and the theoretical principles that underpin how meaning is extracted from words and images. Investigation covers the relationship between the sign and the signifier and how to choose appropriate signs for communicating visually through metaphor, metonym, synecdoche and juxtaposition. \n\nElements of Design: Colour - \nThrough analysis of a variety of examples from design outcomes, you will learn about the role of colour in communicating a message. Basic concepts of colour and meaning will be explored as elements of visual strategies.\n\nDesign Fundamentals: Layout (Single page and Multiple Folds in a single page) -\nThrough analysis of a variety of examples from design outcomes, you will learn techniques of composition and layout to present visual and textual elements in an effective manner on a single page. Basic introduction of page anatomy, visual dynamics, visual composition and visual hierarchy will be established between image and text. \n\nIdeation techniques and process documentation -\nIntroduction to mind mapping, mood boarding and precedence studies will be established to enable you to contextualize your design solutions within the larger practice of design. \n\nClass assignments -\nThree creative projects.\n1.\tGraphic Form (Within A4):\nCreate a series of graphic forms within A4 to communicate a single idea using effective techniques of representation and design fundamentals.\n\n2.\tPoster Design (Within A2):\nCreate an A2 graphic driven poster design to communicate a single idea within a single page. Explorations on creating visual interest, visual hierarchy and visual flow within the integration of image, text and colour will be developed.\n\n3.\tMultiple Folds Single Page Print (Within A3):\nCreate a multiple fold print within A3 to communicate a single idea applying visual interest, visual hierarchy and visual flow.\n\nAssigned Exercises:\n1.\tDesign and Form  - Preliminary Research & Visual Storming\n2.\tDesign and Form - Ideation Sketches\n3.\tDesign and Form - Colour Studies\n4.\tLayout Design - Poster\n5.\tLayout Design - Multiple Folds Print"
    },
    {
        "moduleCode": "E2103L SEMICONDUCTOR FUNDAMENTALS",
        "description": "Practical or hands-on module to complement EE2103."
    },
    {
        "moduleCode": "EE1071 INTRODUCTION TO EEE LABORATORIES",
        "description": "This course consists of 6 hours of Lecture/briefing and 6 lab modules, 2 modules each on Laboratory Basics, Working with AC waveforms and Soldering and circuit-building. \n1. Introduction to common measuring instruments. Electrical components and concepts of simple circuit analysis. Data recording and analysis. General safety aspects. \n2. Laboratory Basics (Modules 1 & 2) Safety in EEE Laboratory Sessions \n3. Working with AC Waveforms (Modules 3 & 4)\n4. Soldering and circuit-building (Modules 5 & 6)"
    },
    {
        "moduleCode": "EM5103 WATER RESOURCES MANAGEMENT",
        "description": "To introduce the basic principles of the hydrological principles, water quality and quantity, and water treatment which are essential fundamentals for the design of water resources related projects."
    },
    {
        "moduleCode": "EN1001 ENVIRONMENTAL CHEMISTRY",
        "description": "Basic chemistry concepts. Thermodynamics and reaction kinetics. Equilibrium relationships. Acids and bases. Alkalinity and acidity. Hardness. Metal complexation. Reactions of organic compounds. Electrochemistry and redox reactions. Oxygen and electron equivalents. Basic biochemistry. Radioactivity."
    },
    {
        "moduleCode": "EG1001 ENGINEERS IN SOCIETY",
        "description": "This course aims to provide a general understanding of the society we live in and the engineers' roles and responsibilities towards society's well-being. The course is part of broadening education objective in the engineering curriculum.  The course covers a wide range of topics including the history of engineering, engineering ethics and practices, sustainability, and contributions by engineers towards society in the future. The students will have a holistic understanding of the role played by engineers and on their impact in society."
    },
    {
        "moduleCode": "HA2028 ETHICS IN PUBLIC POLICY MAKING & IMPLEMENTATION",
        "description": "This course aims to acquaint you with the study of ethical considerations and issues in public policy making and implementation. The study of ethical considerations and issues as such is a critical area of public policy analysis as it addresses one core question that confronts particularly scholars and practitioners of public policy, but also any professional and/or organizational entity with stakes in public policy globally: how (best) to design and implement ethical public policy within a certain societal context? In addressing this core question, you will navigate the different ethical perspectives, issues as well as tensions/dilemmas that arise during the public policy making and implementation phases in key policy sectors primarily, but not exclusively, within the Asia-Pacifi c region. These policy sectors are prominent sectors that are seen in many Asia-pacifi c societies, including the education, economic, housing, social and environmental sectors. Therefore, lectures are focused on delivery of relevant concepts and perspectives relating to ethics in public policy making and implementation. Lectures in the fi rst part of the course will centre around concepts and perspectives on ethics in public policy making and implementation. Lectures in the second part of the course will situate the concepts and perspectives covered in the fi rst part of the course in specifi c case studies that refl ect the abovementioned key policy sectors. Extending from these lectures, the tutorials will provide you with the opportunity to apply what you have learnt in lectures to analyse and evaluate the ethical considerations, dilemmas and tensions that arise within the respective public policy sectors under study."
    },
    {
        "moduleCode": "FE1073 AN INTRODUCTION TO ENGINEERING & PRACTICES",
        "description": "Lab C1: Resultants and equilibrium of forces\nLab C2: Deformation of elastic body\nLab M1: Work and energy\nLab M2: Conservation of momentum\nLab E1: Electric field\nLab E2: Magnetic field\nSeminar C1: Introduction to Civil and Environmental Engineering \nSeminar M1: Introduction to Mechanical and Aerospace Engineering \nSeminar E1: Introduction to Electrical and Electronic Engineering"
    },
    {
        "moduleCode": "FL5001 INTRODUCTION TO FILM STUDIES",
        "description": "The course provides an introduction to the discipline of cinema studies, structured as a survey of important films in the history of the development of cinema, from the age of the silent movies to the present digital age. Students will, therefore, enlarge their knowledge of cinema through an exposure of the great classic films and be taught basic film terminology, as well as formal and critical analyses. In the process, they will gain a general awareness of film history and movements; and be taught the basic skills necessary to read or analyse a film critically. They will learn about film theory and the various genres of narrative cinema to better understand how cinematic movements and theoretical ideas were born, and how film cultures and criticisms have developed globally. To that end, students will study feature films from the major film production centres around the world."
    },
    {
        "moduleCode": "GC0001 SUSTAINABILITY: SEEING THROUGH THE HAZE",
        "description": "The course wi ll discuss sustainability from perspectives of various disciplines, including humanities, business, policy, economics, and science. Students will learn about sustainability through a case study of oil palm plantation. The course will be composed of the following 6 modules. The course is supplemented by Module SI , which helps broadening students' perspectives on sustainability.\n\nModule I : General Introduction\nModule 2: The Global Seeding of Oil Palm\nModule 3: Recent Expansion of Oil Palm in South East Asia: How and Why did this happen?\nModule 4: How is Oil Palm Production Affecting Environment, Climate and Human Society?\nModule 5: Making Oil Palm More Sustainable\nModule 6: General Conclusions                                                                                                                         \nModule SI: National Geographic (Nat. Geo) talk"
    },
    {
        "moduleCode": "SP0002 ETHICS SEMINAR",
        "description": "This course aims to introduce normative ethics and metaethics to students. In addition, it encourages students to respond critically to articles and videos that make use of the concepts of normative ethics and metaethics and to become ethically reflective and responsible global citizens. As we are living in a digital age, replete with electronic computers, digital networks, big data, and artificial intelligence. This course will encourage students to think critically about the ethical implications of our technological implementations. Last but not least, this course encourages students to consider the benefits of a civic education, the welfare of the community or commonweal, and the ethical implications of being civic-minded."
    },
    {
        "moduleCode": "HC2006 INTRODUCTION TO CHINESE HISTORY",
        "description": "This course is a general survey of historical changes and continuities in China from the ancient times to the present, focusing on social, political, cultural, and intellectual developments of different periods. This course aims to nurture interest in Chinese culture through enhancing knowledge of various aspects of Chinese history.  This is the core subject for the first-year students of the Chinese Programme."
    },
    {
        "moduleCode": "HE1001 MICROECONOMICS I",
        "description": "The Singaporean Government is increasingly engaging the public, and as economists we are responsible for contributing towards better public decisions. This is especially important as good public policy processes place value on social impact, seeks to understand the behavior of Singapore's diverse society, and makes sense and use of increasingly abundant behavioral data. As the Singaporean economy gets more advanced and complex, and citizens get better educated and informed, we rely on decisions strengthened by sound economic thinking. The economist must move towards more rigorous reasoning across the levels of household, corporate, and public choice. In this course we apply fundamental microeconomic principles complemented by behavioral economics to various current everyday concerns in Singapore.\n\nThe course aims to deliver a progressive and rigorous introduction to basic concepts and models of microeconomics, applied to current trends local and global. Microeconomics is one of the three core pillars of an Economics major. This is an important module that will serve as a prerequisite for almost all major PE modules. The first part of the course covers the theory of individual decision-making in consumption, risk and labor. The second part of the course covers the theory of firms making production decisions when operating under various market structures, in particular price discrimination with market power and strategic interactions between firms. This course will also expose students to new developments in the field of microeconomics which have now come to assume a central role, in particular behavioral economics.\n\nStudents will learn basic theories that can be abstract and simple but yet so relevant and powerful in explaining decision problems in our everyday lives. On the one hand, it will give students with either no previous economics training a chance to close the gap with those with a stronger background. On the other hand, it will give everyone a chance to appreciate microeconomics in action right from the start of their education at NTU - a feature that is surprisingly amiss in many Economics undergraduate programs worldwide."
    },
    {
        "moduleCode": "SS5101 BADMINTON",
        "description": ""
    },
    {
        "moduleCode": "HF5101 INTRODUCTION TO CHINESE CREATIVE WRITING",
        "description": ""
    },
    {
        "moduleCode": "HG1001 MIND & MEANING",
        "description": "In this course, you will be introduced to the uniqueness of human language as a communication system. You will examine how language is learnt and the way our mind stores meaning and organizes information. The topics you will cover include animal communication, biological foundation of human language, language acquisition, sign language and deaf studies, language impairment, word formation and the study of meaning.  Your understanding of these concepts will be reinforced with examples taken from a wide range of languages and both cross linguistic and interdisciplinary perspectives from psychology, sociology, computer science and communication studies."
    },
    {
        "moduleCode": "HH1006 THE WEST IN GLOBAL HISTORY",
        "description": "To encourage students to think about larger themes which pertain to the post-1500 history of the world, comparative themes such as tradition versus modernization, confrontations of Oriental versus Occident, East versus West, urban versus rural, etc. will be discussed in conjunction with the transformations of historical processes over the past five centuries. The year 1500 is considered the turning point in which the modern global economy is said to have begun to form. Challenges to this choice of turning point, and alternative views of human and world history will be discussed in the lectures. Students who are interested in understanding how the West came to dominate this period and the present will benefit from this course. Upon completion of this course students will have a deeper appreciation of the historical basis of the present time and the links between other history topics and the modern West."
    },
    {
        "moduleCode": "HJ5001 INTRODUCTION TO HEALTH & SOCIETY",
        "description": "This course provides foundational knowledge for students interested in health and society. Specifically, we will examine how demographic and epidemiological transitions have shaped population health, in turn affecting the development of health policies and healthcare systems around the world. We will also examine how digital technologies and `big data' facilitates health monitoring, informs health policy, and improves health outcomes. Moreover, we will examine the major social determinates of health and mental health, and how their interactions and relevant mechanisms affect health outcomes and behaviors. \n\nOverall, this course is for students who want a broad overview of the healthcare sector and wish to hone their analytical skills in this area. It could be of interest to students who foresee careers in the public sector or who wish to pursue further education and training in the field of healthcare."
    },
    {
        "moduleCode": "HL2005 VICTORIAN LITERATURE",
        "description": "Victorian Literature introduces a selection of literary works from the nineteenth century, while drawing attention to neglected aspects of this extremely versatile, fast changing, and intriguingly self-conscious age. The course aims to foster excitement about the indeterminacies, doubts, and fissures that shaped the Victorian period's greatest cultural achievements. At the same time, we shall critically reconsider the many legacies of the shifts it saw in epistemological, cultural, and specifically literary conceptualisations.\n\nThis module provides an overview of the most important works, themes, and concerns of the Victorian age, one of the most prolific periods of English literature. You will learn how to analyze, discuss, and write criticism about canonical texts and the popular culture of the time. You will also be encouraged to evaluate critically your attitudes and responses to \"the Victorians\"."
    },
    {
        "moduleCode": "HN5010 SINGAPORE: IMAGINING THE NEXT 50 YEARS",
        "description": "This course aims to encourage undergraduates, who are the future leaders and citizens, to reflect on Singapore's post-independence history, imagine the kind of Singapore you would like to create. As a student, you will gain an understanding of the strengths, weaknesses, opportunities and threats that can help or hinder Singapore to achieve its vision. This course also you to deliberate the kinds of socioeconomic strategies and policies that benefi ts Singaporeans. Singapore is both a city and a country contained in a small geographical space located in Southeast Asia. It houses a diverse population in terms of race, language, religion, class and nationality. It possesses no natural resources, but has a highly educated labour force. Its economy has experienced signifi cant growth rates, particularly in the late 70s and early 80s, coupled with low unemployment. Like most other more developed economies, it now confronts a range of socioeconomic issues (rapidly ageing population, declining fertility rates, widening income inequality, rising costs of living) amidst increasing global competition, technological advancements, and security threats. At the same time, Singaporeans have become more of a people with a stronger national identity, a greater propensity to participate in the decisions that affect the destiny of the country, and a wider range of views and voices on the future direction of Singapore, the challenges it confronts, and the strategies and means by which to achieve their preferred goal(s) for themselves, their children, and the country. This course invites you to: 1. Reflect on Singapore's post-independence history. 2. Contemplate the kind of Singapore they envision for the future. 3. Understand the strengths, weaknesses, opportunities and threats that can help or hinder Singapore achieving their vision(s) for the country. 4. Deliberate the kind of strategies and policies that would enable Singapore to achieve their vision(s) for the country."
    },
    {
        "moduleCode": "HP2700 ABNORMAL PSYCHOLOGY",
        "description": "This is an introductory module to provide an overview of the field of abnormal psychology.  The course discusses a variety of psychological conditions and human behaviors that are traditionally considered outside of what we see as 'normal.'  We will explore the major approaches to understanding these psychological disorders described in the Diagnostic and Statistical Manual of Mental disorders (DSM; the most recent version is the fifth edition [DSM-5]), their manifestations, causes, risk factors, assessments, and treatments.  The course emphasizes the scientific and research aspects of abnormal psychology.  That is, it focuses on the knowledge obtained by rigorous scientific research methods.  At the end of this module, students should have an overall understanding of the various psychological disorders and be able to provide an account of abnormal behaviors and psychological disorders observed in daily life.  It is also the goal of this course that students achieve greater understanding and appreciation for the range of human behaviors.  In addition, this course provides a foundation for other more advanced courses that cover the understanding and treatment strategies for psychological disorders.  The knowledge learned in this course will serve as the foundation for related fields in health sciences, including clinical psychology, psychological counseling, social work, and rehabilitation."
    },
    {
        "moduleCode": "SU2001 URBAN PLANNING & DESIGN",
        "description": ""
    },
    {
        "moduleCode": "HR2001 INTRODUCTION TO THE HISTORIES OF SOUTHEAST ASIAN ART",
        "description": "This is a foundational survey course covering works of art, artefacts and sites from Southeast Asia. It begins with the early cultures of prehistory and ends by investigating persisting traditions found in 20th-21st century artworks from Southeast Asia. You will study and question the dynamics, themes, and complexities that distinguishes the region geographically and artistically. You will develop literacy over a range of visual representations by considering their aesthetics, symbolic attributes, and cultural/historical significances. You will cultivate and apply these knowledge through independent research, critical thinking, oral presentations, written tests and assignments. This will provide a foundation for further research and study of art in Southeast Asia."
    },
    {
        "moduleCode": "HQ5010 INTRODUCTION TO GENDER & DIVERSITY",
        "description": "Given that Introduction to Gender and Diversity is proposed as a module for a Minor programme,\nit would take a broad, introductory approach to the critical  theory and its socio-political  and\nhistorical contexts. The module will explore the intersectional constructions of gendered identity\naccording to a range of discourses that concern femininity, masculinity, transgendered identity, disability, ethnicity, class, nationality and virtual identities. It will consider the ways in which these discourses  underpin contemporary debates about diversity.   The  module encourages you to develop a broad  knowledge of the subjects studied and to hone your analytical  skills, with an appreciation of the conflicts and nuances inherent in discussions about diversity and gendered identities.  Furthermore, over the course of the module, you should develop articulacy and self-assurance in academic debate, both in class discussion and in written work."
    },
    {
        "moduleCode": "HS0101 DIGITAL LITERACY, CULTURE & SOCIETY",
        "description": "This course will explore the interrelationships among digital media, culture, and society. It takes both an analytical and an issue-based approach to basic questions about what digital media and technologies are, how and why they work as they do, and their significance within contemporary culture and society. In the first half of the course, you will learn about digital media and technologies as part of contemporary society and culture, including social-science theories and concepts to help frame your learning. Here, the course covers a range of digital media and technologies in relation to social institutions, users, culture and meaning. In the second half of the course, you will apply what you have learned through engagement with a series of contemporary digital-media issues. Here, topical issues include big data and AI, fake news, memes, social-media influence, and playbour. Through engagement with these various topics, you will develop critical and creative media literacy skills that are highly relevant to subsequent studies in the arts, humanities and social sciences, as well as future work and leisure practices in knowledge-based digital economies."
    },
    {
        "moduleCode": "HT5401 TRANSLATION: APPRECIATION, CRITICISM & EVALUATION",
        "description": "This course introduces students to the methods and principles of appreciating and evaluating translated texts in both Chinese and English, and inculcates in them the ability to tackle the theoretical issues involved and to adopt appropriate strategies in translation. Translation criticism is an essential link between translation theory and its practice. Original and translated texts of classical, modern and contemporary literary works in both English and Chinese, dealing with a set of themes selected from genres like poetry, prose, fiction and drama will be examined. Students will be given extensive practice in analysing translations already published, and encouraged to apply translation-critical methods to their own work."
    },
    {
        "moduleCode": "HW0218 COMMUNICATION ACROSS THE SCIENCES",
        "description": "The aim of the course is to enhance the abilities of science students to recognize and employ effective skills and strategies for written and oral communication in both academic and public settings. On the one hand, the emphasis of this course is on basic micro skills in scientific communication such as searching academic databases, critically reading scientific texts, citing from sources, composing scientific arguments, and making effective presentations. On the other hand, it introduces you to the conventions of scientific texts such as annotated bibliographies and proposals that require a combination of informative, evaluative, and persuasive writing skills. In addition, you will have an opportunity to share your ideas with your peers through group discussions, in-class presentations on current scientific topics and poster presentations of your proposals. Using a pre-determined set of evaluation criteria, you will give feedback to your peers on the course assignments, under the supervision of your tutors. The course will culminate with a poster presentation session where you will present your proposals to the wider scientific community in your schools for an authentic communication experience. Through this course, it is hoped that you will become better communicators when conveying your scientific ideas in writing and speech to your peers and an educated audience."
    },
    {
        "moduleCode": "HU2003 THE GEOGRAPHIES OF UNEVEN DEVELOPMENT",
        "description": "This course examines themes, concepts, theories, and trends which define the study of international development from a critical geographical perspective. Students will gain an understanding of the historical and contemporary challenges of global inequality with reference to specific case studies. We shall be discussing what Development means by examining different development pathways and strategies throughout the global economy. While the course's main premise is economic development, we shall be reading more widely across the literature which strategically ties development to different scales -bodies, villages, cities, nations, across borders - to show that development is really not limited to the Global South but is vitally about (dis)connections and (im)mobilities in the global economy. This will also show that development is not disembodied but made up of and affects different people in very different ways. Case studies from around the world are used to provide empirical contexts to the theories we learn about international development practices, processes and problems."
    },
    {
        "moduleCode": "HY0001 ETHICS & MORAL REASONING",
        "description": "HY0001 will introduce students to three major ethical theories' utilitarianism, Kant's deontology, and virtue ethics. Then, four weeks will be devoted to teaching the ethical principles underlying academic integrity, research ethics, and intellectual property. Finally, students will discuss issues related to the ethics of environmental sustainability and conservation. All the while, students will be challenged apply the ethical theories learned to concrete moral problems, including world poverty, corporate accountability and whistleblowing, and workplace discrimination."
    },
    {
        "moduleCode": "HV5001 INTRODUCTION TO ENVIRONMENTAL HUMANITIES",
        "description": "This introductory course to the Minor programme in Environmental Humanities (EH) will offer a broad foundation to the emerging area of study. It will bring together a range of conceptual and theoretical approaches that define the field of EH since the 21st century, in order to reflect upon our changing relationships and dynamics with animals, plants, and the natural and urban environments, particularly in this epoch we call the Anthropocene. The range of disciplines we will focus on include literary and film studies; history; media and communication studies; sociology; linguistics; philosophy; art and aesthetics; as well as environmental science and geology. \nMajor focuses of the course will include new theoretical concepts of nature and the environment; social and environmental justice; climate change and environmental degradations; pollutions ad toxicity in everyday life; debates in the naming of the Anthropocene; critical studies of human and animal relationships; as well as the relationship between environmental humanities and our daily lives as concerned, thoughtful citizens."
    },
    {
        "moduleCode": "HZ5202 CREATIVE WRITING:FICTION",
        "description": "In this course we will study examples of published fiction with a view to recognizing and utilizing prose fiction techniques, and generate new fiction via exercises and assignments designed to enable you to view the world as the potentiality of fiction. Along with acquiring a practitioner's understanding of the creative process, you will learn to evaluate your own writing and its impact on readers and audiences."
    },
    {
        "moduleCode": "IE2108 DATA STRUCTURES & ALGORITHMS IN PYTHON",
        "description": "This course aims to give a systematic introduction to data structures and algorithms for constructing efficient computer programs based on Python. Principles of algorithmic analysis will be studied.  \nEmphasis is on data structures and efficient algorithms in the program development process, covering abstract data types, trees, graphs, sorting, and searching. The greedy technique such as Kruskal's algorithm and Dijkstra's algorithm will be introduced. AI algorithms such as classification will also be discussed. Theories will be practiced during tutorial sessions and students will gain substantial Python programming experience."
    },
    {
        "moduleCode": "LA5004 ARABIC LANGUAGE LEVEL 4",
        "description": "This unrestricted elective (UE) / Broadening Deepening Elective (BDE) is open to all undergraduate students who possess a proficiency in Arabic equivalent to LA5003. LA5004 aims to elevate your Arabic language skills to the A2.2 level (CEFR) through engaging and interactive classroom activities, including audio-visual materials and dynamic discussions. Utilizing a facilitation and learner-centric teaching approach, this course will further develop your Arabic language abilities at a lower-intermediate level, focusing on the four essential language skills: reading, writing, listening, and speaking. By enhancing your understanding of both the Arabic language and culture through diverse classroom discussions and presentations, this course will prepare you for traveling, studying, and working in Arab countries. Additionally, learning Arabic will boost your employability in an increasingly globalized economy."
    },
    {
        "moduleCode": "LC5001 CHINESE LANGUAGE LEVEL 1",
        "description": "This is an elementary Chinese course for beginners with no previous knowledge of the language. It aims to introduce Chinese language and culture through practical use of the language to students. The learning activities are designed to develop students? listening, speaking, reading and writing skills and gradually build up students' confidence in using Putonghua for daily communication. In order to establish a solid foundation for long-term study, the learning of Chinese characters is an essential part of this course."
    },
    {
        "moduleCode": "IM1002 ANALOG ELECTRONICS",
        "description": "This course aims to provide you with the fundamentals of electronic circuit analysis. You will be exposed to circuit analysis theories, circuit devices such as diodes, op-amps, and bi-polar junction transistor. \nCourse content: Basic circuit theory. Network transformation. Node voltage method. Mesh analysis. Norton and Thevenin. Inductor and capacitor. Natural response. Laplace transform. Op-amps. Diodes. DC analysis of BJTs. Introduction to MOSFETs. Small-Signal Amplifiers."
    },
    {
        "moduleCode": "LF5001 FRENCH LANGUAGE LEVEL 1",
        "description": "This course introduces the French language, culture and civilization to complete beginners. Students will learn the basics of the French language through a textbook and a work book developed specifically for the needs of NTU students. Audio and video resources are also integrated into the course to expose students to authentic language use. They will learn the most common verbs, words and sentence constructions in French. During class, they will role-play, answer simple questions orally, watch videos, read texts and dialogues, and write simple essays."
    },
    {
        "moduleCode": "LH5001 HINDI LANGUAGE LEVEL 1",
        "description": "The course, designed for complete beginners, introduces the students to the basic structures of Hindi language and the key aspects of Hindi culture such as arts, gastronomy, fashion, music, festivals and traditions. The course develops listening, reading, speaking and writing skills for an effective interaction in Hindi. Through the use of a textbook and various audio-visual materials specifically tailored for NTU, students will work with activities designed to train them to deal with simple everyday situations and to master basic Hindi grammar. They will read texts, answer simple questions orally, role-play, watch videos and write simple essays. Students will be also engaged in information-based tasks, working collaboratively to achieve individual and collective goals."
    },
    {
        "moduleCode": "LJ5005 JAPANESE LANGUAGE LEVEL 5",
        "description": "This course aims to provide for students valuable opportunities to better engage in Japanese language learning through conversational use, greater insights into the Japanese culture and way of life, and access to a broader spectrum of language skills. For instance, a measurable advancement would be the expectation for students at this stage of learning to be able to comfortably compose an essay of 500 words, among other aspects of learning progression. Students will be equipped with an enhanced knowledge and broadened command of the Japanese language upon the successful completion of this course."
    },
    {
        "moduleCode": "LI5001 ITALIAN LANGUAGE LEVEL 1",
        "description": "The course, designed for complete beginners, introduces the students to the basic structures of Italian language and the key aspects of Italian culture such as arts, gastronomy, fashion, music, festivals and traditions. The course develops listening, reading, speaking and writing skills for an effective interaction in Italian. Through the use of a textbook and various audio-visual materials specifically tailored for NTU, students will work with activities designed to train them to deal with simple everyday situations and to master basic Italian grammar. They will read texts, answer simple questions orally, role-play, watch videos and write simple essays. Students will be also engaged in information-based tasks, working collaboratively to achieve individual and collective goals."
    },
    {
        "moduleCode": "LK5001 KOREAN LANGUAGE LEVEL 1",
        "description": "This course is designed for beginners with no prior knowledge of Korean.  It introduces students to the Korean language and covers reading and writing of the Hangul script as well as pronunciation. Starting with greetings, the course proceeds to develop communication through basic grammar, vocabulary and reading skills for simple sentences.  Students will develop the four skills of listening, speaking, reading and writing in an interactive and integrated manner through theme-based activities that relate to daily life.  By the end of the course, students will be able to read, write, and talk about topics such as identities, everyday activities, time, numbers, weather and location in basic Korean."
    },
    {
        "moduleCode": "LG5001 GERMAN LANGUAGE LEVEL 1",
        "description": "This course is an unrestricted elective (UE) for any undergraduate student with an interest in the German language, culture, study and work life, but with no previous knowledge of the language. LG9001 will teach you basic German to the level of A1.1 according to the Common European Framework of Reference for Languages (CEFR). Using a learner-centric teaching approach and a broad range of classroom and online activities, you will learn the basics of German through the four fundamental language skills; reading, writing, listening, and speaking. Thus, this course will be beneficial for you to travel, study, and work in Germany or for German companies. Learning German might make you more employable in a globalised economy."
    },
    {
        "moduleCode": "LR5001 RUSSIAN LANGUAGE LEVEL 1",
        "description": "Students will study the Russian alphabet, numbers, greetings, the politeness system, directions and places in the city, family members and professions. Throughout the course students will learn to use basic sentence structures to express present and future actions, describe themselves and their families, to ask and answer simple questions about people, weather, hobbies, and occupations. Grammatical topics introduced in LR9001 include pronouns, cases, verb conjunctions and question forms.\n\nThrough the use of authentic texts and audio-visual materials the students' knowledge of the culture in Russia and Russian speaking countries will also be enhanced and expanded."
    },
    {
        "moduleCode": "LT5002 THAI LANGUAGE LEVEL 2",
        "description": ""
    },
    {
        "moduleCode": "LL5001 SINGAPORE SIGN LANGUAGE LEVEL 1",
        "description": "This course introduces the following items at a beginner level. 1) greetings and introductions, 2) conversations in daily living, 3) asking questions and receiving instructions, 4) food and health and 5) relationships and kinship. Students will learn enough vocabulary and idiomatic expressions to be able to engage in basic conversations on the topics above. Classroom tasks in this course require a basic level of visual-manual communication."
    },
    {
        "moduleCode": "LV5001 VIETNAMESE LANGUAGE LEVEL 1",
        "description": "This course is designed for beginners with no previous knowledge of Vietnamese. It will develop the four skills of speaking, listening, writing and reading in Vietnamese in an integrated manner. Students will be introduced to the Vietnamese writing system as well as the pronunciation of alphabets and tones. Each lesson will cover pronunciation drills, conversational dialogues, and practice in vocabulary and grammar. Through a range of communicative activities, students will learn to carry out simple conversations on common topics related to their daily life. By the end of the course, they will develop some general understanding of the culture, customs and history of Vietnam."
    },
    {
        "moduleCode": "LM5001 MALAY LANGUAGE LEVEL 1",
        "description": "The course aims to provide you with competence in understanding and using basic Malay. In order to familiarize you with the target language, the requisite skills of listening, speaking, reading and writing will be taught, along with the rudiments of grammar. These are achieved through thematic and scenario-based learning which will equip you with the necessary vocabulary based on the prescribed themes."
    },
    {
        "moduleCode": "LS5001 SPANISH LANGUAGE LEVEL 1",
        "description": "Designed for beginner students, this course in basic Spanish teaches the four skills in an integrated manner, using a communicative approach. Through the use of various written and audio-visual materials, students are trained to: provide personal information about themselves (name, address, nationality, occupation, studies, etc.), describe things and people (physical appearance and personality), locate things and people, express habitual actions at specific times, talk about festivities and special events, and express their hobbies and likes/dislikes. In addition to teaching the language, this course also aims at providing students with a global vision of the Spanish and Latin American culture from various perspectives (arts, music, festivals, gastronomy, etc.)."
    },
    {
        "moduleCode": "MA0218 INTRODUCTION TO DATA SCIENCE & ARTIFICIAL INTELLIGENCE",
        "description": ""
    },
    {
        "moduleCode": "MH1100 CALCULUS I",
        "description": "This core mathematical course aims to provide an introduction to the fundamental mathematical concepts (functions, limits, continuity, derivatives and integrals). Computation of derivatives (sum, product, and quotient formulas, chain rule, and implicit differentiation), and application of derivatives to optimization problems and related rates of change problems will also be discussed. This course lays the foundation for more advanced studies in mathematics, physics, engineering, and other related subjects. \nList of key topics taught\n\n1.\tFunctions\n2.\tLimit and limit laws\n3.\tContinuity\n4.\tDerivatives and derivative function\n5.\tDifferentiation formulas\n6.\tTrigonometric derivatives and chain rules\n7.\tImplicit differentiation\n8.\tLinear approximation and extreme values\n9.\tMean value theorem\n10.\tLimit and infinity\n11.\tCurve sketching\n12.\tOptimization and Newton?s method\n13.\tAntiderivatives"
    },
    {
        "moduleCode": "MS1018 PROPERTIES OF MATERIALS",
        "description": "The main aim of this course is to further correlate the structure of materials to their electrical, thermal, optical and magnetic properties. The course will highlights the importance of careful design of the materials structure to harness the associated properties in real application examples. Understanding of these relationships helps you to achieve different functional properties in a given materials combination/system for a specific application that is necessary for a materials engineer."
    },
    {
        "moduleCode": "ML0004 CAREER & INNOVATIVE ENTERPRISE FOR THE FUTURE WORLD",
        "description": "This course aims to equip students with essential professional skills for the dynamic VUCA world. 1. Career Insights and Competencies: The course aims to provide students with a deep understanding of essential skills and competencies necessary for success in their careers. Students will gain insights into industry-specific requirements, professional behaviour, and effective communication. 2. Self-Assessment and Design Personal and Professional Lives: Students will evaluate their values, interests, personality traits, and skills through self-assessment tools and activities. The aim is to empower them to design their personal and professional lives intentionally, aligning their aspirations with their abilities. 3. Job Search and Career Development Skills: The course aims to equip students with practical skills related to job searching, networking, resume writing, interview preparation, and career planning. Students will learn how to navigate the job market effectively. 4. Conflict Resolution and Ethical Decision-Making: Students will develop the ability to identify, manage, and resolve workplace-related conflicts. Additionally, they will explore ethical issues commonly encountered in professional settings and learn how to make principled decisions."
    },
    {
        "moduleCode": "MT0003 PROFESSIONALS & SOCIETY",
        "description": "The course aims to: (1) enhance your appreciation of Singapore's maritime industry from a societal, historical, political and economic viewpoint; (2) Promote your awareness of ethical issues and your ability to analyse, argue and reflect your role, responsibility and ethical conduct as a member of the society and as a professional in the maritime community. \n\nTo accomplish (1), the course topics include Singapore's maritime history, its related social, political development, and international relations, The course also discusses the importance of the nation's maritime sector and its journey in becoming today's international maritime centre.  To achieve (2), curriculum emphasises on ethical conduct for businesses and professionals. Course content comprises topics such as professional ethics, corporate governance and corporate responsibility."
    },
    {
        "moduleCode": "PH1011 PHYSICS",
        "description": "1. VECTORS 2. KINEMATICS 3. FORCES AND TORQUES 4. NEWTON'S LAWS OF MOTION 5. IMPULSE AND MOMENTUM 6. WORK AND ENERGY 7. THERMAL PHYSICS 8. ELECTRIC FIELD 9. MAGNETIC FIELD 10. MOTION OF CHARGED PARTICLES AND APPLICATIONS 11. CIRCUITS"
    },
    {
        "moduleCode": "PS0001 INTRODUCTION TO COMPUTATIONAL THINKING",
        "description": "Computational thinking (CT) is a problem solving process with the aid of computer; i.e. formulating a problem and expressing its solution in such a way that a computer can effectively carry it out. It includes a number of characteristics, such as breaking a problem into small and repetitive ordered steps, logically ordering and analyzing data and creating solutions that can be effectively implemented as algorithms running on computer. As such, computational thinking is essential not only to the Computer Science discipline, it can also be used to support problem solving across all disciplines, including math, science, engineering, business, finance and humanities. \nThe aim of this course is hence to take you from having no prior experience of thinking in a computational manner to a point where you can derive simple algorithms and code the programs to solve some basic problems in mathematics and science in general. In addition, the course will include topics to appreciate the internal operations of a processor, and raise awareness of the socio-ethical issues arising from the pervasiveness of computing technology."
    },
    {
        "moduleCode": "RE0003 COMMUNICATING AS A 21ST CENTURY ENGINEER",
        "description": "`Communicating as a 21st Century Engineer' aims to help students in the Renaissance Engineering Programme to become highly skilled communicators. You will explore in depth how to use language appropriately and effectively, in varied academic and professional contexts, to achieve desired purposes with different audiences. While the course focuses on how to write and present dynamic technical proposals and reports, you will learn important general principles that you can apply to other forms of written and spoken communication. An important aspect of the course is that you will learn how to learn about effective communication on your own. This will involve you learning how to read, analyse and respond critically to a range of texts from engineering and other disciplines.  The course also covers non-verbal aspects of communication, such as the use of graphics, as well as ethical dimensions of academic and professional communication."
    },
    {
        "moduleCode": "SC1004 LINEAR ALGEBRA FOR COMPUTING",
        "description": "This course aims to support you to learn mathematical concepts related to linear algebra and complex numbers. You will develop set of mathematical skills for applications in computer science and engineering, e.g., machine learning, computer graphics, data science etc."
    }
]