[
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed solving a complex problem with uncertain outcomes, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you found patterns in data or assessed risks, and how did that spark your curiosity about future applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem with uncertain outcomes, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how did that spark your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Imagine you're helping people manage risks in their lives; what excites you about using math and data to make informed decisions for a secure future?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance risk and uncertainty, and how did that experience spark your curiosity about data-driven decision making?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about pursuing a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you found analyzing data or predicting outcomes intriguing, and how do you see this curiosity shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a complex problem with data, and how it sparked your curiosity about risk management in real-life situations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you found analyzing data or assessing risks intriguing, and how it might shape your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed solving a complex problem, and how do you think this skill might benefit your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem, and how do you think this skill might benefit your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a complex problem with numbers, and how it sparked your curiosity about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed working with numbers to solve a real-life problem, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Imagine predicting financial risks for a company; what excites you about using math to inform strategic decisions and drive business success?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about pursuing a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance risk and uncertainty, and how did that experience spark your curiosity about data-driven decision making?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you ever analyzed data to predict future outcomes, and how does this process spark your curiosity about its applications in finance or risk management?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed working with numbers or data to solve a real-life problem, and how did that experience inspire you?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed solving a complex problem involving numbers or uncertainty, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a complex problem with data, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed solving a complex problem, and how did that experience relate to your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem with uncertain outcomes, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a complex problem with uncertain outcomes, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a complex problem with uncertain outcomes, and how did that spark your curiosity about predicting future risks?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem involving data or risk, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you ever analyzed risks in everyday life, and how do you think understanding uncertainty could shape your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about pursuing a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed solving a complex problem with data, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you found patterns or predicted outcomes in everyday life, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share a moment when you enjoyed analyzing data or assessing risks, and how did that experience spark your curiosity about pursuing a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Imagine you're helping people plan for the future; what excites you about using math and data to make informed decisions about risk and uncertainty?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share a moment when you enjoyed solving a complex math problem or analyzing data, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a complex problem with data, and how did that make you feel about pursuing a career in numbers?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance risk and uncertainty, and how did that experience spark your curiosity about numbers and their real-world impact?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance risk and uncertainty, and how did that experience spark your curiosity about data-driven decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you ever analyzed risks in everyday situations, and how might exploring uncertainty and data help shape your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you enjoyed analyzing data or assessing risks, and how did that experience spark your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a complex problem with uncertain outcomes, and how did that spark your curiosity about future uncertainties?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed working with numbers to solve a real-life problem, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you ever analyzed risks or probabilities in a real-life scenario, and if so, what drew you to understanding uncertainties?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how it might relate to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed solving a complex problem with uncertain outcomes, and how did that experience shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed working with numbers to solve a real-life problem, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed solving a complex problem involving data or uncertainty, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed working with numbers to solve a real-life problem, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed solving a complex problem with uncertain outcomes, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed working with numbers or data, and how do you see this passion guiding your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance risk and uncertainty, and how did that experience spark your curiosity in data-driven decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you ever found yourself analyzing risks in everyday situations, and how do you think this curiosity could shape your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a complex problem with uncertain outcomes, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance risk and uncertainty, and how did that experience spark your curiosity about data-driven decision making?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a complex problem with uncertain outcomes, and how it sparked your curiosity about risk management?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance risk and uncertainty, and how did that experience spark your curiosity about data-driven decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a complex problem with uncertain outcomes, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you enjoyed analyzing data or solving a complex problem, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem with numbers, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed solving a complex problem with uncertain outcomes, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you found analyzing data or managing risk exciting, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a problem involving uncertainty or risk, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you found analyzing data or assessing risks intriguing, and how it might shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about pursuing a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share a moment when you enjoyed analyzing data or solving a complex problem, and how did it spark your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you enjoyed working with numbers or solving a complex problem, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed solving a complex problem with uncertain outcomes, and how did that experience spark your curiosity about data-driven decision making?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a problem involving uncertainty or risk, and how it sparked your curiosity about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share a moment when you enjoyed analyzing data or solving a complex problem, and how it made you think about your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you ever analyzed data to predict outcomes or manage risks in a project or game, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Imagine predicting financial risks for a new business venture - what excites you about using math and data to make informed decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you enjoyed analyzing data or assessing risks, and how did that experience spark your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a complex problem with uncertain outcomes, and how did that spark your curiosity about risk management?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a complex problem with data, and how it sparked your curiosity about predicting future uncertainties?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem with data, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed solving a complex problem with uncertain outcomes, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance risk and uncertainty to make a decision, and how did that experience shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you found analyzing data or assessing risks particularly engaging, and how it might relate to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you enjoyed analyzing data or assessing risks, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how did that spark your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how did that spark your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you enjoyed analyzing data or assessing risks, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed solving a complex problem with numbers, and how did that make you feel about pursuing a career in data-driven decision making?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you found analyzing data or assessing risks intriguing, and how it might relate to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you used data or analysis to make a decision, and how did that experience spark your curiosity about risk management?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed working with numbers to solve a real-life problem, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about pursuing a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or assessing risks, and how it sparked your curiosity about a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you ever analyzed risks in everyday life, and how do you think understanding uncertainty could shape your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a moment when you found analyzing data or assessing risks fascinating, and how it might shape your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed working with numbers or solving puzzles, and how that experience might relate to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance risk and uncertainty, and how did that experience spark your curiosity in analytical problem-solving?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you found analyzing data or managing risks intriguing, and how that experience might shape your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you found analyzing data or managing risk intriguing, and how might such experiences shape your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing and managing risk in a real-life scenario, like planning for a natural disaster?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed complex data to make a calculated decision, and how did you ensure accuracy in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed data or assessed risk in a personal or academic project, and how did you apply logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used analytical skills to make a data-driven decision, and how did you ensure its accuracy?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing and managing risk in a real-life scenario, such as planning for unexpected events in your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing and managing risk in a real-life scenario, like planning for unexpected events in your own life?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing data to predict uncertain future events, like natural disasters, to help organizations make informed decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used analytical skills to make a calculated decision, and how did you assess the risks involved?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used analytical skills to make a strategic decision, and how did you assess the potential risks involved?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used analytical skills to make a calculated decision, and how did you balance risk and uncertainty in that situation?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze complex data to make a logical decision, and how did you ensure accuracy?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach predicting and managing uncertainty in a real-life situation that affects people's financial futures?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach predicting and managing uncertainty in a real-life situation, like planning for a community event?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the likelihood of a rare event, like a natural disaster, to help people make informed decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used analytical skills to make a data-driven decision, and how did you ensure its accuracy?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing and managing risk in a real-life scenario, such as planning for unexpected events in your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to make a difficult decision involving uncertain outcomes, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing and managing risk in a real-life scenario, such as planning for a natural disaster?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the risks of a new ride-sharing service in Singapore, using mathematical models?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed data to make a prediction or informed decision, and what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used analytical skills to make a calculated decision, and how did you balance uncertainty with potential outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze and manage risk in a real-life scenario, like planning for unexpected events in your daily life?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance risk and uncertainty to make a decision, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze complex data or patterns to make a well-informed decision?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing data to predict and manage risks in a real-world scenario?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used analytical skills to predict or manage uncertainty in a personal or team project?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing and managing risk in a real-life scenario, like planning for unexpected events in your daily life?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data to make a prediction or informed decision, and how did you approach the uncertainty involved?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used analytical skills to make a calculated decision, and how did you evaluate the potential risks involved?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used analytical skills to make a calculated decision, and how did you balance risk versus reward?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach predicting and managing risk in a real-life scenario that interests you?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing data to predict uncertain future events, like estimating the likelihood of extreme weather impacting a city?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach estimating the likelihood of a future event with limited data, and why this skill excites you?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing the risk of a natural disaster impacting an insurance company's financial stability?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the risk of a natural disaster impacting a city's financial stability?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing the risk of a natural disaster impacting a city's infrastructure?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the risks and uncertainties of a new business venture you're passionate about?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing and managing risk in a real-life scenario, like planning for a natural disaster's financial impact?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach predicting and managing risk in a real-life scenario, like planning for a natural disaster?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze uncertain outcomes? How did you approach predicting the likelihood of different results?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data to make a decision, and how did you ensure your approach was both logical and creative?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the risk of a natural disaster impacting an insurance company's financial stability?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used analytical skills to assess and manage risk in a personal project or decision?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used analytical skills to make a calculated decision, and how did you assess the risks involved?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed data to predict a future outcome, and how did you ensure your prediction was reliable?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze uncertain outcomes, and how did you approach making a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used logical reasoning to assess and manage a risk, and how did that experience shape your decision-making approach?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data to make a prediction or informed decision, and how did you approach this challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing and managing risk in a real-life scenario, like planning for unexpected events?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used logical reasoning to assess risk in a personal or academic decision?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used mathematical insights to make a more informed decision in a uncertain situation?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used analytical skills to make a calculated decision, and how did you balance uncertainty with potential outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used analytical skills to assess and manage risk in a personal or group project?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing and managing risk in a real-life scenario, like planning for unexpected events?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used analytical skills to make a calculated decision, and how did you balance uncertainty with potential outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing and managing risk in a real-life scenario, like planning for a natural disaster?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach predicting and managing risk in a real-life scenario, like planning for a natural disaster?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze data or assess risks to make a more informed decision in your academic or personal life?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time you analyzed data to make a prediction or informed decision, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing and managing risk in a real-life scenario, like planning for a natural disaster?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used analytical skills to make a calculated decision, and how did you balance risk versus reward?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing the financial risks of a new ride-sharing service in your city?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the risks and uncertainties of a new ride-sharing service in Singapore?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach predicting and managing the financial risks of launching a new ride-sharing service in a bustling city?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach predicting the likelihood of a rare event, like a natural disaster, using limited data and mathematical models?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used analytical skills to make a data-driven decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach estimating the likelihood of a rare event, like a natural disaster, using limited data?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the risk of a natural disaster impacting a city's financial stability, using only the data provided?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed data to make a future prediction; how did you ensure your approach was reliable?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used analytical skills to make a calculated decision, and how did you balance uncertainty with logic?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance risk and uncertainty, and how did you approach making a decision in that scenario?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used analytical skills to make a calculated decision, and how did you balance uncertainty with potential outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used mathematical reasoning to solve a real-life problem, and how did you validate your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing data to predict future uncertainties, like estimating the impact of climate change on insurance claims?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the risk of a natural disaster impacting a city's infrastructure, using only the data you have at hand?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing the risk of a natural disaster impacting an insurance company's financial stability?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing and managing risk in a real-life scenario, like planning for a natural disaster or unexpected event?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data to make an informed decision, and how did that experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the risk of an uncertain future event, like a natural disaster, to help others make informed decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time you analyzed data to make an informed decision, and how did you ensure your approach was reliable?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used analytical skills to make a calculated decision, and how did you assess the risks involved?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used analytical skills to assess risk or uncertainty in a personal or academic project?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time you used data or logic to make a calculated decision, and how did you ensure its accuracy?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach predicting and managing risk in a real-life scenario, like planning for a natural disaster's financial impact?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or analytical thinking to make a decision, and how did you ensure its accuracy?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or analysis to make a thoughtful decision, and how did you ensure it was reliable?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing and managing risk in a real-life scenario, like planning for unexpected events?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing and managing risk in a real-life scenario, such as planning for a natural disaster?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed data to make a prediction or informed decision, and what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing and managing risk in a real-life scenario, like planning for a natural disaster's financial impact?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used logical reasoning or analytical skills to assess and manage a risk in a personal or team project?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing and managing risk in a real-life scenario, like planning for a natural disaster's financial impact?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed data to make a prediction or inform a decision, and how did you ensure its accuracy?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you would analyze and manage risk in a real-life scenario, such as planning for unexpected events in your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used analytical skills to make a decision involving uncertainty, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time you analyzed complex data to make an informed decision, and how did you ensure accuracy in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed data or assessed risk in a personal or group project?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing and managing risk in a real-life scenario, like planning for a natural disaster?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze uncertain outcomes, and how did you approach making a decision despite the uncertainty?",
    "criterion": "Skills"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision in your academics or personal projects?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a decision, and how did that process interest or challenge you?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks in a project or activity, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that spark your curiosity about their impact on decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that spark your curiosity about applying mathematical insights to real-world uncertainties?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision in your academics or personal projects?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you encountered situations where analyzing data or assessing risks helped you make informed decisions, and how did that shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you encountered situations where analyzing data or assessing risks influenced your decisions, and how did that impact the outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks to make an informed decision, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you encountered situations where analyzing data or assessing risks helped you make informed decisions, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you ever analyzed data or assessed risks in a project or activity that helped you make informed decisions or predictions about future outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks to make an informed decision, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks to make an informed decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that shape your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks to make an informed decision, and how did you approach this process?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks to make a decision, and how did that experience shape your interest in quantitative problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks to make an informed decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks to make a decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used analytical skills to make a calculated decision, and how did the outcome influence your approach to future challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did it spark your interest in pursuing a career that combines mathematics and finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks to make a decision, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you encountered situations where analyzing data or assessing risks influenced a decision you made, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that influence your decisions or outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data or assessed risks to make a more informed decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that shape your interest in pursuing a career that involves statistical decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision in your academic or personal life?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision in your academic or personal life?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a thoughtful decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision in a personal or group project?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you encountered situations where analyzing data or assessing risks helped you make informed decisions, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you used analytical skills to make a data-driven decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that shape your interest in a career involving statistical decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that shape your interest in a career involving statistical decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze data or assess risks to make a more informed decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision in your academic or personal life?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks to make an informed decision, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data or assessed risks to make an informed decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision in your academic or personal life?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks to make an informed decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that influence your decisions or outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that spark your curiosity about making informed decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks to make an informed decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze data or assess risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision in your academics, extracurricular activities, or personal projects?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that impact your decision-making or understanding of uncertain outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision in your academic or personal life?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks to make an informed decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that shape your approach to making informed decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Have you ever analyzed data or assessed risks in a project, and how did that experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a decision, and how did that impact your outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that spark your curiosity about future applications in finance or insurance?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that impact your decision-making or understanding of uncertain outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did it influence your decisions or outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or assessed risks to make an informed decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a more informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks, and how did that impact your decision-making or outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make a thoughtful decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Actuarial Science",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or assessed risks to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  }
]