[
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a moment when you marveled at something flying or in space, and how that sparked your curiosity about the science behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how things fly or explored the science behind space exploration that sparks your curiosity for future innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation systems, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a moment when you were fascinated by flight or space exploration, and how might this curiosity shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a moment when you marveled at something flying or in space, and how that sparked your curiosity about its underlying technology?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how aircraft or spacecraft are designed, and how you see yourself contributing to the future of flight or space exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Imagine designing a vehicle for space exploration - what aspects of this challenge excite you the most and why?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by flight or space exploration, and how might pursuing this curiosity impact your future career or personal aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a moment when you were fascinated by flight or space exploration, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Imagine designing a vehicle that could revolutionize air travel - what aspects of this challenge excite you the most about pursuing this field?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions, and how you see this shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or hobby that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight or space exploration, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever looked up at the sky and wondered how you could contribute to the future of air travel or space exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation systems, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight or space exploration, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or dream that sparked your curiosity about flight, space, or innovative transportation solutions, and how you see yourself contributing to these fields?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or hobby that sparked your curiosity about flight or space, and how might this passion drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share a moment when you were fascinated by flight or space exploration, and how might that curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Imagine designing a sustainable aircraft for the future - what aspects of flight or space exploration would you find most exciting to contribute to?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Imagine designing a sustainable aircraft of the future; what aspects of flight or space exploration excite you the most about contributing to such innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Could you share an experience or moment that sparked your curiosity about flight, space exploration, or innovative transportation solutions, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that made you curious about how things fly or operate in space, and why does that excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation systems, and how might this passion shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how things fly or explored the science behind space exploration that sparks your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how things fly or explored the science behind space exploration, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Imagine designing a sustainable aircraft for the future - what aspects of flight or space exploration would you prioritize, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Imagine designing a sustainable aircraft for the future - what aspects of flight or space exploration excite you most about contributing to such projects?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how aircraft or spacecraft are designed, and can you see yourself contributing to innovations in flight or space exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space exploration, or innovative transportation systems?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space exploration, or innovative transportation systems, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that made you curious about how things fly or operate in space, and why does that fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that challenged your understanding of flight or space, and what sparked your curiosity in these areas?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Could you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or the design of aircraft and spacecraft?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or imagined a vehicle for space exploration, and what sparked your curiosity about flight or space travel?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Imagine designing a sustainable aircraft for the future; what aspects of flight, environment, or innovation excite you most about contributing to this project?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a moment when you were fascinated by flight or space exploration, and how might that curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Could you share an experience or dream that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Imagine designing a sustainable aircraft of the future - what aspects of flight, environmental impact, or innovation excite you most about this challenge?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Imagine designing a sustainable aircraft for future generations - what aspects of flight or space exploration excite you the most about pursuing this field?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that made you curious about how things fly or operate in space?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how things fly or explored the science behind space exploration that sparks your curiosity for future innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share a moment or experience that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how airplanes stay aloft or spacecraft explore the cosmos, and how might studying these phenomena shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight or space exploration, and how do you see this driving your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space exploration, or innovative transportation systems, and how might this interest shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or the science behind aircraft, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Imagine designing innovative solutions for air or space travel - what excites you about the potential impact of such work on society?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space exploration, or innovative transportation solutions, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight or space exploration, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or hobby that sparked your curiosity about flight or space exploration, and how might this passion influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Could you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a moment when you were fascinated by flight or space exploration, and how that sparked your curiosity about the science behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how things fly or explored the science behind space exploration, and how might that curiosity shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space exploration, or innovative transportation solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how aircraft or spacecraft are designed, and can you see yourself contributing to innovations in flight or space exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that made you curious about how flight or space exploration works, and why does that fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that made you curious about how things fly or operate in space, and why does that fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Could you describe a moment when you were fascinated by flight or space exploration, and how might that curiosity guide your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or hobby that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how things fly or explored the science behind space exploration, and how might that curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or hobby that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this passion drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how things fly or the potential for space exploration to impact our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that made you curious about how it could fly, float, or explore beyond Earth?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Could you share an experience or curiosity that sparked your fascination with flight or space exploration, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how things fly, and could you see yourself designing innovative solutions to make air travel cleaner or space exploration more accessible?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how things fly or explored the science behind space exploration that could shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space exploration, or innovative transportation solutions, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a moment when you were fascinated by flight or space exploration, and how might that curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Imagine designing a vehicle for space travel - what aspects of flight or exploration excite you most about this challenge?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever looked up at the sky and wondered how planes or spacecraft work, and could see yourself designing or improving them?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space exploration, or designing innovative vehicles, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a moment when you were fascinated by flight or space exploration, and how might that curiosity shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Imagine designing a sustainable aircraft of the future; what aspects of flight or space exploration excite you the most about contributing to such innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space exploration, or designing innovative vehicles?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or hobby that sparked your curiosity about flight or space exploration, and how might this passion influence your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or hobby where you've applied problem-solving to design or improve something, and how it sparked your curiosity about flight or space exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how things fly or explored the science behind space exploration that could shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or hobby that sparked your curiosity about flight, space, or innovative transportation solutions, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Imagine designing a vehicle for space travel - what aspects of flight, materials, or propulsion systems excite you the most about this challenge?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how things fly or explored the science behind space exploration that sparks your curiosity for future innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that made you curious about how things fly or work in space, and why does that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a moment when you were fascinated by flight or space exploration, and how it sparked your curiosity about the science behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever been fascinated by how things fly or explored the science behind space exploration, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about flight, space, or the science behind air and spacecraft?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a moment when you were fascinated by flight or space exploration, and how might that curiosity drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved something, and how did you balance creativity with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you applied problem-solving skills to design or optimize something, and how did you iterate on your solution?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Tell me about a time you designed or improved something - how did you balance creativity with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Tell me about a time you designed or built something - what inspired your creation, and how did you troubleshoot challenges along the way?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Tell me about a time you designed or built something innovative; how did you balance creativity with practical constraints like safety or cost?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something to solve a real-world problem, and how did you iterate on your solution?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Tell me about a time you designed or improved something - how did you balance creativity with practical constraints, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved a model, machine, or mechanism, and what skills did you use to overcome its challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something, and explain how you balanced creativity with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something, and how did you balance creativity with practical constraints like safety or resources?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved a model or mechanism, and how did that experience spark your curiosity about flight or space exploration?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of physics or mechanics?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through how you would troubleshoot a model airplane's unexpected flight behavior, and what skills do you think are essential for such a?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that involved balancing multiple complex factors, like weight, speed, or safety?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something, and how did you troubleshoot challenges that arose during the process?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved a model, machine, or process, and what skills did you use to overcome its technical challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you applied problem-solving skills to design or optimize something, and how did that impact your interest in flight or space exploration?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time you designed or improved a model or system, and how did you troubleshoot challenges that arose during the process?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of flight or aerodynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something with limited resources, and how did you ensure its stability and efficiency?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something with precision, and how did that process spark your curiosity about flight or space exploration?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you applied problem-solving skills to design or optimize something, and how did that process inspire you to innovate further?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of physics or mechanics?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an example of a time when you designed or built something that involved balancing multiple constraints, like weight, cost, or performance?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved something to make it faster, lighter, or more efficient, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you applied problem-solving skills to design or optimize something, and how did you iterate on your solution?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something, and how did you troubleshoot when it didn't work as expected?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of physics or mechanics?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of physics or mechanics?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or improved a complex system, and how did you troubleshoot unexpected challenges along the way?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or improved a complex system, and how did that process spark your curiosity about flight or space exploration?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach designing a model aircraft to solve a real-world transportation challenge, highlighting your problem-solving process?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of physics or mechanics?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through a time when you designed or improved a model or system, and how did you troubleshoot challenges along the way?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that challenged your understanding of flight or space, and how did you troubleshoot unexpected problems?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of flight or weightlessness, and how did you iterate on your design?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved a complex system, and what skills did you use to overcome challenges along the way?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something, and how did you troubleshoot challenges to achieve your desired outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach designing a model aircraft to optimize flight efficiency, highlighting your problem-solving strategies?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something to solve a real-world problem, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time you designed or improved something to make it faster, lighter, or more efficient, and what inspired your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Tell me about a time you designed or built something innovative - what inspired your creation, and how did you troubleshoot challenges along the way?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved a model or device, and how did you apply problem-solving skills to overcome challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of how objects move through air or space?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something, and how did you troubleshoot challenges to achieve your desired outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved a model, gadget, or structure, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Tell me about a time you designed or improved something - how did you balance creativity with practical constraints, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you applied problem-solving skills to design or improve something, and how did that impact your interest in pursuing a career in flight or space exploration?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of how things move or fly?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of physics or mechanics?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time you designed or improved a complex system, and how did you troubleshoot unexpected challenges along the way?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time you designed or built something that involved balancing multiple constraints, like weight, cost, or safety?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to troubleshoot or optimize a complex system, and what skills did you use to overcome the challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved a model or system, and how did you balance creativity with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you applied problem-solving skills to design or improve something, and how did that experience spark your curiosity about flight or space exploration?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through how you would troubleshoot a model aircraft's unexpected flight pattern during a competition, highlighting your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved something, and how did you balance creativity with practical constraints like safety or cost?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or gravity, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved a complex system, and how did you balance creativity with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something to solve a real-world problem, and how did you iterate on its performance?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to troubleshoot a complex problem, and how did your analytical approach lead to a creative solution?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved something, and how did you balance creativity with practical constraints like safety or cost?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved something, and how did you balance creativity with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something, and how would you apply those problem-solving skills to innovate in flight or space exploration?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through how you would troubleshoot a model airplane's unexpected flight behavior, highlighting your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of physics or mechanics, and how did you troubleshoot it?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved something, and how did you balance creativity with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something, and how did you troubleshoot when it didn't work as planned?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that flew, floated, or moved, and what did you learn from the trial-and-error process?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved a simple machine, and how did that experience spark your curiosity about flight or space exploration?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach designing a sustainable aircraft for a future where fuel is scarce, and what skills do you think you'd need to develop to succeed in this project?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something, and how did you troubleshoot challenges that arose during the process?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time you designed or improved something, and how did you balance creativity with practical constraints like safety or resources?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of flight or motion?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time you designed or improved something to make it faster, lighter, or more efficient, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through a time when you applied problem-solving skills to optimize the performance of something you designed or built?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved a simple machine or structure, and how did you test its effectiveness?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach designing a model aircraft to maximize flight efficiency, highlighting your problem-solving strategies?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something to solve a real-world problem, and how did you iterate on your solution?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or improved something, and how did that process spark your curiosity about flight or space exploration?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach designing a model aircraft to optimize both flight efficiency and environmental sustainability?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved a model, gadget, or structure, and how did you apply problem-solving skills to overcome challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved something, and how did you balance creativity with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that involved balancing creativity with technical constraints, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something, and how did you troubleshoot when it didn't work as planned?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time you designed or improved a system, and how did you balance creativity with practical constraints like safety or resources?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach designing a simple aircraft model to test aerodynamic principles, and what do you hope to learn from the experiment?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through how you would approach designing a model aircraft to optimize its flight performance for a school competition?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something, and how did you troubleshoot when it didn't work as planned?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach designing a model airplane to maximize flight time, and what skills do you think are essential for this?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something, and how did you troubleshoot when it didn't work as planned?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach designing a sustainable aircraft for eco-friendly travel, highlighting your problem-solving and creative skills?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of physics or mechanics?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something, and how did you troubleshoot challenges that arose during the process?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved something, and how did you balance creativity with practical constraints like safety or resources?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time you designed or improved a simple machine, and how did you balance creativity with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or improved a model or structure, and how did you apply problem-solving skills to overcome challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach designing a sustainable aircraft for a futuristic city, emphasizing problem-solving and innovative thinking?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or improved something, and how did you balance creativity with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that involved balancing safety, efficiency, and innovative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you engaged in hands-on projects or activities that sparked your curiosity about flight, space, or innovative transportation solutions, and what did you learn from them?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight, mechanics, or innovative materials?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you explored or worked on projects involving flight, robotics, or innovative materials that sparked your curiosity about designing solutions for the skies?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that challenged your understanding of flight, space, or motion, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or tested something that relates to flight or space, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and what sparked your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you explored or been fascinated by flight, space, or designing innovative solutions that could impact air travel or beyond?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed, built, or flown something that made you curious about how things move through air or space?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight, space, or motion, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed, built, or flown something that made you curious about how things move through air or space?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that involved aerodynamics, flight, or innovative problem-solving, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about the skies or space?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that involved aerodynamics, flight, or innovative problem-solving, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something that sparked your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that involved aerodynamics, flight, or innovative problem-solving, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you explored any projects or activities that combined your curiosity for flight, space, or innovative technologies, and how did they shape your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed, built, or flown something that made you curious about how it could be improved for air or space travel?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that involved aerodynamics, flight, or innovative problem-solving, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a project or activity where you designed, built, or optimized something to overcome a real-world challenge, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed, built, or flown something that made you curious about how it could be improved to overcome real-world challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about the skies or space?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a project or activity where you designed, built, or tested something that relates to flight or space, and what sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how it sparked your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that made you curious about how things fly or work in the sky?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or space, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a project or activity where you designed or built something that involved flight, aerodynamics, or innovative problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about the skies or flight?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how it sparked your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or tested something that involved aerodynamics, flight, or space exploration, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you explored any projects or activities that combined your curiosity for flight, space, or innovative design with problem-solving skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that involved flight, motion, or innovative problem-solving, and what sparked your curiosity in these areas?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that involved flight, speed, or innovative problem-solving, and how did that experience spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that challenged you to balance creativity with technical constraints, and how did you navigate that process?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you engaged in hands-on projects or activities that sparked your curiosity about flight, space, or innovative transportation solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about the skies or flight?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you explored or designed any projects that involve flight, space, or innovative uses of physics and math, and what sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that involved aerodynamics, flight, or innovative problem-solving, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that involved aerodynamics or flight, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight, space, or mechanics, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something that sparked your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed, built, or flown something that challenged your understanding of flight or space, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or tested something that relates to flight or space exploration, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed, built, or flown something that challenged your understanding of flight or space, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed, built, or flown something that challenged your understanding of flight or space, and what sparked your curiosity in that moment?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that involved aerodynamics, flight, or innovative problem-solving, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight, space, or motion, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that involved aerodynamics or flight, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that challenged your understanding of flight or space, and what sparked your curiosity in these areas?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a project or activity where you applied scientific principles to design or build something, and how it sparked your curiosity about flight or space?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of flight or space, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed, built, or flown something that challenged your understanding of flight or space, and what sparked your curiosity in those moments?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you participated in projects or activities that involved designing, building, or testing models of aircraft, spacecraft, or related systems, sparking your curiosity in flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or tested something that relates to flight or space, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you explored or created projects that combine physics, math, and design to solve real-world flight or space-related challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you explored or been inspired by flight, space, or aircraft design in any projects, hobbies, or activities that sparked your curiosity about how things fly?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that involved aerodynamics, flight, or space exploration, and what sparked your curiosity in that project?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed or built something that made you curious about how it could fly, move through space, or withstand extreme conditions?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about the skies or flight?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how it sparked your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you explored or created projects related to flight, space, or innovative transportation solutions that sparked your curiosity about future possibilities?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you ever designed, built, or flown something that made you curious about the science behind flight or space exploration, and how did that experience inspire you?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of flight, motion, or structural integrity?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something, and how did that spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something, and how did that process spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or tested something that relates to flight or space, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight, mechanics, or innovative problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight or space exploration, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something that challenged your understanding of flight, motion, or structural integrity?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed or built something, and how did that process spark your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you explored or designed any projects that involve flight, space, or innovative uses of physics and math, sparking your curiosity for future innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something that sparked your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a project or activity where you applied scientific principles to design or optimize something, and what did you learn from the process?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or tested something that challenged your understanding of flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you describe a time when you designed or built something that challenged your understanding of flight or space, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Can you share an experience where you designed, built, or flew something that sparked your curiosity about flight or space exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Aerospace Engineering",
    "school": "NTU",
    "question": "Have you engaged in hands-on projects or activities that sparked your curiosity about flight, space, or innovative transportation solutions?",
    "criterion": "Experiences"
  }
]