[
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where a cultural event or art form deeply impacted you, and how might you want to facilitate such moments for others?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you connected with art or culture in a meaningful way, and how might that shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized a school event or exhibition that combined creativity with logistics, and what did you enjoy most about that experience?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with the arts or cultural events sparked your curiosity, and how might this passion influence your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with the arts or a cultural event sparked your curiosity, and how might you see yourself contributing to such experiences in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or created something artistic that sparked joy in others, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative event - what motivated you, and what did you enjoy most?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative event - what sparked your enthusiasm for blending art with planning?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you see yourself contributing to its growth in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you envision nurturing such experiences for others?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you see yourself contributing to its growth?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized a school event or exhibition that combined creativity with logistics, and what did you enjoy most about that experience?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where a cultural event or art form deeply impacted you, and how you envision nurturing such experiences for others?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you build a career around such passions?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Imagine organizing a festival that blends art, music, and community - what excites you about creating such experiences, and how do you see yourself contributing?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you see yourself contributing to its growth in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event - what motivated you, and what did you enjoy most about it?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event that sparked your curiosity about sustaining creative industries?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you see yourself contributing to its growth in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with the arts inspired you, and how might you want to facilitate such moments for others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Imagine organizing a festival that blends art, music, and community - what aspects of this project excite you the most about pursuing a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Imagine curating an art exhibition that sparks community dialogue - what aspects of this project excite you the most about a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and what motivated you to engage with the creative community?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with planning, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with planning, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with logistical planning, and how did that experience spark your curiosity about the arts?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you connected art to community engagement, and how did it shape your vision for its role in your future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you combined creativity with organization, and how did that spark your curiosity about managing artistic or cultural initiatives?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how you envision nurturing that passion in a professional?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized a school event or exhibition that combined creativity with logistics, and what did you enjoy most about the experience?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event that sparked your curiosity about sustaining creative initiatives long-term?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with the arts inspired you, and how might you amplify such moments for others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where the arts deeply impacted you, and how you envision nurturing such moments for others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project that sparked your curiosity about managing arts and cultural initiatives?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with planning, and how did that experience spark your interest in pursuing it further?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with planning, and what sparked your enthusiasm for such experiences?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event that sparked your curiosity about sustaining creative initiatives long-term?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where art or culture inspired you, and how you envision nurturing such moments for others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you envision building a career around such passions?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you envision turning that passion into a meaningful career?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've used creativity or innovation to impact your community, and why it sparked your curiosity about cultural careers?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a moment when engaging with arts or culture sparked your curiosity, and how might you imagine building a career around such experiences?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized a school event or exhibition that combined creativity with logistics, and what did you enjoy most about the experience?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Imagine organizing a festival that blends art, music, and community - what aspects of this project excite you the most about a career at the intersection of creativity and management?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how you see that influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where art or culture deeply impacted you, and how might you want to facilitate such experiences for others?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or cultural events sparked your curiosity, and how might you see yourself contributing to these fields in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you combined creativity with organizational skills, and how did it spark your curiosity about managing arts and cultural initiatives?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with the arts or cultural events sparked your curiosity, and how you envision nurturing this passion in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative event - what motivated you, and what did you enjoy most about it?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a moment when the arts deeply impacted you, and how you envision contributing to or supporting creative initiatives in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with the arts sparked your curiosity, and how you see yourself contributing to its growth in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Imagine organizing a festival that blends art, music, and community - what aspects of this project excite you the most about pursuing a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've combined creativity with organizational skills, and how that experience sparked your curiosity about a career at the intersection of art and management?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with the arts or a cultural event sparked your curiosity, and how might you build a career around such passions?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized a school event or exhibition that celebrated creativity, and if so, what motivated you to take on that role?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with logistical planning, and what did you enjoy most about the experience?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event that sparked your passion for blending creativity with management?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with the arts sparked your curiosity, and how might you see yourself contributing to its growth in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Imagine organizing a festival that blends traditional and modern art forms - what excites you about bringing diverse cultural experiences to life?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you see yourself contributing to its growth in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized a school event or exhibition that combined creativity with logistics, and what did you enjoy most about the experience?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever imagined a career where creativity meets organization, and how might such a balance impact your daily work life?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized a school event or exhibition that combined creativity with planning, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you envision building a career around such passions?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative event that sparked your curiosity about managing arts and cultural initiatives?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Imagine organizing a festival that blends traditional and modern art forms; what excites you about bringing diverse cultural experiences to life?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you combined creativity with organization, and how did this spark your curiosity about managing arts or cultural initiatives?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or cultural activities sparked your curiosity, and how might you see yourself contributing to these fields in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized a school event or exhibition that combined creativity with planning, and what did you enjoy most about the experience?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with planning, and how did that experience shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Imagine organizing a festival to promote a social cause you're passionate about - what aspects of this project excite you the most?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you see yourself contributing to or sustaining that spark in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized a school event or exhibition that combined creativity with logistical planning, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you build a career around such passions?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where the arts positively impacted you, and how might you want to facilitate similar experiences for others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event that sparked your curiosity about its creative and logistical aspects?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever imagined a career where you could turn your passion for arts into impactful experiences for others, and what excites you about that?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with planning, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a cultural event - what sparked your enthusiasm, and how did it impact you?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you build a career around that passion?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you build a career around that passion?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how you envision nurturing this passion in a professional setting?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with planning, and how did that experience spark your curiosity about cultural industries?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where a cultural event or art form deeply impacted you, and how you envision such moments shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where a cultural event or art form deeply impacted you, and how you envision such moments shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where a cultural event or art form deeply impacted you, and how you envision contributing to such moments in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where art or culture impacted you, and how you envision shaping such moments for others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with logistics, and what did you enjoy most about that experience?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with planning, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where the arts positively impacted your life, and how might you want to facilitate such experiences for others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with planning, and what did you enjoy most about that experience?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with planning, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where art or culture impacted you, and how you envision nurturing such moments for others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or created something artistic that sparked meaningful conversations, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you build a career around such passions?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event that sparked your curiosity about sustaining creative industries?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how might you see yourself contributing to these fields in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with the arts or culture sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where engaging with arts or culture sparked your curiosity, and how you envision nurturing that passion in a professional?",
    "criterion": "Interests"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practicality in a project, and how you think this skill might benefit your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced creativity with practical constraints, and how did you ensure the project's success?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you creatively promoted an event or activity, and how did you measure its success?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with organizational skills in a past project or event, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've creatively balanced artistic expression with practical constraints, and what did you learn from this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you creatively balanced different priorities, and how do you think this skill might help you in managing arts projects?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practical considerations in a project, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you creatively balanced diverse interests or preferences to achieve a common goal in a team or community setting?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that celebrated creativity, and how did you balance artistic vision with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practical planning in a project, and how do you think this skill will serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with logistical planning in a project, and how do you think this skill will serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practical planning in a project, and how do you think this skill will serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practical planning in a project, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practicality in a project, and how you think this skill might benefit your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practicality in a project, and how did you measure its success?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practical planning in a project, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practicality in a project, and how do you think this skill will serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've creatively balanced artistic expression with practical considerations in a project or activity?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practicality in a project, and how do you think this skill will serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project, and how did you balance creative vision with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced creativity with practicality, and how do you think this skill will serve you in a career nurturing artistic expression?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practical planning in a project, and how you think this skill might benefit your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practicality in a project, and how do you think this skill will serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that celebrated creativity or diversity, and what skills did you use to make it successful?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practicality in a project, and how this approach might benefit your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've creatively balanced artistic expression with practical considerations in a project or activity?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that celebrated creativity, and what skills did you use to make it successful?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've creatively balanced logistical planning with artistic expression in a project or event you've led?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized or participated in a creative event? How did you balance artistic vision with practical considerations?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practical planning in a project, and how you think this skill might benefit your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've creatively balanced artistic expression with organizational responsibilities, and what did you learn from this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you creatively balanced logistical challenges with artistic vision, and what skills did you develop through that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that celebrated creativity, and how did you balance artistic vision with practical logistics?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creative expression with organizational responsibilities in a project or activity, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've creatively balanced different priorities or interests in a project, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've creatively balanced diverse interests or priorities in a project, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced creativity with practicality, and how do you think this skill will serve you in a dynamic arts-related field?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that showcased creativity, and how did you balance artistic vision with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that celebrated creativity, and how did you ensure its success?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practicality in a project, and how you think this skill will serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced creativity with practicality, and how did that shape your approach to managing projects or events?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you creatively balanced the needs of artists, audiences, and resources in a project, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practical planning in a project, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced creativity with organizational skills, and how did that impact the outcome of a project or event?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you creatively balanced artistic expression with practical constraints, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creative expression with logistical planning in a project, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you promoted a creative project or event, and how did you balance artistic vision with practical considerations?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creative expression with logistical planning in a school project or community event, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've creatively promoted an event or activity, and what skills did you use to engage your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've creatively balanced diverse interests or priorities, and how this approach might benefit a role bridging art and administration?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creative expression with practical considerations in a project or activity, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practical planning in a project, and how did you measure its success?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practicality in a project, and how do you think this skill applies to cultural initiatives?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that celebrated creativity, and how did you balance artistic vision with practical logistics?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creative expression with practical considerations, and how might this skill support your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've creatively balanced artistic expression with logistical planning in a school project or extracurricular activity?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practicality in a project, and how do you think this skill will serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've creatively balanced artistic expression with organizational responsibilities in a project or event you've led or been part of?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practical considerations in a project, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practicality in a project, and how you think this skill will serve your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project, and how did you balance creativity with practical considerations like budget or timing?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've creatively balanced personal passion with practical planning, and how this approach might benefit a career in the arts?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you promoted or organized an event, and how did you balance creative vision with practical constraints?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practical planning in a project, and how you think this skill might benefit your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with structured planning, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced creativity with practicality in a project, and how you think this skill will serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project, and how did it shape your view on balancing artistic expression with practical planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts or cultural event that sparked your interest in its management aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've organized or participated in an artistic or cultural event that sparked your passion for creative collaboration?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts or cultural event - what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've organized or participated in an arts or cultural event that sparked your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and what did you learn from it about engaging audiences?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how it sparked your interest in a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized or participated in a creative project that required balancing artistic vision with practical constraints, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts or cultural event that sparked your interest in pursuing a related career?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project, and what did you learn from managing its logistics or team?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and what skills did you develop through this involvement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how it shaped your view on cultural engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with logistical planning - what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how it sparked your interest in managing creative initiatives?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you organized or participated in any arts or cultural events that sparked your interest in pursuing a career in this dynamic field?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and what skills did you develop from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized or participated in an arts event that sparked your passion for creative collaboration, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project that sparked community engagement or social impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of a time when you organized or participated in an arts or cultural event - what inspired you to take on that role?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've organized or participated in an arts or cultural event that sparked your passion for creative community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts or cultural event - what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project, and how did it shape your view on balancing artistic vision with practical planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how it sparked your interest in a career supporting creative industries?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and what did you learn about balancing creativity with practical planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and what skills did you develop through that involvement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that combined creativity with planning, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've organized or participated in a creative event that sparked community engagement or debate?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event that sparked your passion for creative expression?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts-related event, and what skills did you develop through this involvement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts or cultural event - what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how it shaped your views on creative collaboration or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with logistical planning, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that celebrated creativity or cultural diversity, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've organized or participated in a creative project or event that sparked your interest in managing arts or cultural initiatives?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts or cultural event - what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts-related event, and what skills did you develop through this involvement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that combined creativity with planning, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how it sparked your interest in a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project, and how did it shape your view on balancing artistic and logistical aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and what skills did you develop through this involvement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts-related event - what did you learn from it about balancing creativity with logistics?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project, and how did it shape your views on balancing artistic expression with practical considerations?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project that challenged you to balance artistic vision with practical constraints?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and what skills did you develop through this involvement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how it shaped your views on creative collaboration or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how it shaped your view on creative collaboration?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project that sparked community engagement, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized or participated in an arts event that challenged your creativity or leadership skills, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative event, and how did it shape your understanding of balancing artistic expression with logistical planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event that sparked your interest in managing creative projects?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative event - what did you learn from it about collaboration or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative event that sparked your interest in the cultural sector?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how did it shape your views on creativity and community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've organized or participated in a creative project that blended artistic expression with structured planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative event, and how did it shape your interest in managing arts initiatives?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized or participated in an arts event that challenged your creativity or leadership skills, and how did it shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you organized or participated in any arts or cultural events that sparked your curiosity about the creative sector's behind-the-scenes dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've organized or participated in an arts or cultural event that sparked your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've organized or participated in a creative project or event that sparked your interest in managing arts initiatives?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and what did you learn from it about balancing creativity with logistics?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative event - what did you learn about balancing artistic vision with practical logistics?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how it shaped your views on creativity and community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project that combined artistic expression with logistical planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and what skills did you develop that you think are valuable for a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts or cultural event that sparked your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project, and how did it shape your views on community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized or participated in an arts event that challenged your creativity or leadership skills, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project, and how did it shape your view on balancing artistic expression with practical considerations?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how it shaped your view on creative collaboration?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and what did you learn about balancing creativity with practical planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you organized or participated in any creative events that sparked community engagement, and how did these experiences shape your view on the arts' societal impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts-related event, and how it shaped your view on creativity's role in community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project, and how did it shape your view on balancing artistic vision with practical planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project, and what did you learn from managing its logistics?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project - what did you learn about balancing artistic vision with practical constraints?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project, and how it sparked your interest in managing arts or cultural initiatives?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've organized or participated in an arts or cultural event that sparked your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized or participated in a creative project that combined art with community engagement, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of how you've organized or participated in an arts or cultural event that sparked your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative event, and how it sparked your interest in managing arts and culture initiatives?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that showcased creativity, and what did you learn from managing it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts-related event - what did you learn from it about teamwork or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project, and how did it shape your views on community engagement or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project that sparked community engagement, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts or cultural event that sparked your interest in its behind-the-scenes management?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized or participated in a creative project that required balancing artistic vision with practical logistics?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you describe a time when you organized or participated in a creative project that combined artistic expression with logistical planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative project, and how did it shape your views on balancing artistic expression with practical considerations?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an example of a time when you organized or participated in an arts-related event - what inspired you to get involved?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts or cultural event that sparked your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Have you ever organized an event or project that combined creativity with logistical planning, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts event, and how it sparked your interest in cultural leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in an arts-related event - what inspired your involvement and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized an event or project that combined creativity with logistical planning, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Arts and Culture Management",
    "school": "SMU",
    "question": "Can you share an experience where you organized or participated in a creative event, and how did it shape your understanding of balancing artistic and logistical aspects?",
    "criterion": "Experiences"
  }
]