[
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how scientific discoveries in biology can be transformed into innovative business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business principles can improve healthcare outcomes or drive medical innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new medical treatment - what excites you more, the science behind how it works or its potential to transform healthcare and businesses?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business principles can improve human health or solve medical challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or topic that sparked your curiosity in how business principles can improve healthcare outcomes or biomedical innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a moment that sparked your curiosity about the human body or the business of healthcare, and how you see yourself contributing to these fields?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or topic that sparked your curiosity in how business principles can improve human health, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Could you share an experience or moment that sparked your curiosity about the intersection of science and business in improving human health?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about the intersection of science and business, and how do you see yourself contributing to this field?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a moment when you combined science with business thinking, and how did that spark your curiosity about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how business strategies can impact healthcare innovations or medical advancements?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine working at the intersection of science and business - what aspects of developing innovative healthcare solutions or leading biotech ventures excite you the most?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business principles can improve healthcare outcomes or drive medical innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business principles can drive medical breakthroughs or improve healthcare systems?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business strategies can enhance healthcare innovations or patient outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how business principles can improve healthcare outcomes or medical innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about the intersection of science and business in improving human health?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new medical treatment - would you be more drawn to understanding its biological mechanisms or strategizing its global market launch?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an example of how you've explored the intersection of science and business, and how it sparked your curiosity for future opportunities?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business principles can improve healthcare outcomes or medical innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a groundbreaking medical treatment - would you be more drawn to understanding its biological mechanisms or strategizing its global market launch?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or scenario where you saw the potential for science to drive business innovation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new medical treatment - what excites you more, the science behind how it works or its potential business impact on healthcare systems?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new medical treatment - what excites you more, the science behind it or the business of bringing it to those in need?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine developing a new drug: what excites you more - the scientific discovery process or the business strategy behind its global distribution?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new medical treatment - what excites you more, the science behind how it works or the business of bringing it to patients?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business strategies can impact medical breakthroughs or healthcare solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how scientific discoveries in healthcare are transformed into viable business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share how combining science and business aspects in healthcare might align with your career goals or personal passions?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or topic that sparked your curiosity about the intersection of science and business, and how might this blend impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new medical treatment - what excites you more, the science behind how it works or the business of bringing it to those in need?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about the intersection of science and business in improving human health?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or discovery that sparked your curiosity in how business strategies can drive medical breakthroughs or healthcare innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share how combining science and business aspects in healthcare might align with or spark your future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new disease treatment - what excites you more, the scientific breakthrough or the business of bringing it to those in need?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how scientific discoveries in healthcare are transformed into viable business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine developing a new medical treatment and launching it globally - what aspects of science, business, or helping others excite you most about this process?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how scientific discoveries in healthcare are transformed into practical business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about the intersection of science, business, and improving human health?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in the intersection of science and business, and how do you see this blend shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Could you share an experience or discovery in biology or healthcare that sparked your curiosity, and how do you see yourself contributing to these fields?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or discovery that sparked your curiosity in how biological systems can be harnessed to drive innovative business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about the intersection of life sciences and business, and how you see yourself contributing to this field?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business strategies can accelerate medical breakthroughs or healthcare innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a moment when you were fascinated by how scientific discoveries are translated into healthcare solutions or business opportunities?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or discovery that sparked your curiosity about the intersection of science and business in improving human health?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see combining scientific discovery with business strategy impacting your future career or personal fulfillment?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or story that sparked your curiosity in the intersection of science and business, and how do you see this blend shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share how exploring the intersection of science and business might shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or scenario where you found the intersection of science and business particularly intriguing, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or topic that sparked your curiosity about the intersection of science and business in solving real-world health challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Could you share an example from your studies or experiences that sparked your curiosity in how business strategies can accelerate medical breakthroughs or healthcare innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new medical treatment - what excites you more, understanding how it works in the body or developing its market potential?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business principles can improve human health or solve medical challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or discovery that sparked your curiosity about the intersection of science, business, and improving human health?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Could you share how combining science with business principles excites you for future opportunities, and where you see yourself applying this unique blend?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new medical treatment - what excites you more, the science behind it or its business potential to reach patients globally?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new medical treatment - what excites you more, understanding the science behind it or strategizing its global market reach?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see the intersection of science and business driving healthcare innovations that excite or inspire you?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share how exploring the intersection of science and business might shape your future career or personal growth in meaningful ways?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how scientific discoveries in health and medicine intersect with business strategies?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about the intersection of science, business, and improving human health?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see the fusion of science and business driving innovations that could shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Could you share an experience or moment that sparked your curiosity in the intersection of life sciences and business, and how you see yourself contributing to this field?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Reflecting on your passions, how might combining science and business principles help you drive meaningful change in healthcare or beyond?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a groundbreaking medical treatment - what excites you more, the science behind its development or the strategy to bring it to the global market?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine working in a field that combines science and business to improve human health - what aspects of this intersection excite you the most?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or discovery in biology or business that sparked your curiosity, and how do you see yourself contributing to advancements in healthcare?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business principles can improve human health or medical innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a groundbreaking medical treatment - would you be more drawn to understanding its scientific foundations or strategizing its global market launch?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a groundbreaking medical treatment - would you be more drawn to understanding its biological mechanisms or strategizing its global market launch?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business principles can improve human health or solve medical challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or topic that sparked your curiosity in how business strategies can enhance healthcare innovations or medical breakthroughs?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a groundbreaking cure; would you be more drawn to the scientific research behind it or the business of bringing it to market?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business strategies can improve human health or solve medical challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how scientific discoveries in healthcare are transformed into practical business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business principles can improve human health or solve medical challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new medical treatment - what excites you more, the science behind it or its potential business impact, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how business principles can improve human health or healthcare systems?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a moment when you found the connection between science and business particularly intriguing, and how this sparked your curiosity for future exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how scientific discoveries in health and medicine intersect with business strategies?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share how combining science with business principles excites you, and how you see yourself applying this unique blend in your future endeavors?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new medical treatment - what excites you more, the science behind it or its potential business impact, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new medical treatment - what excites you more, the science behind how it works or the strategy to bring it to the global market?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business principles can improve healthcare outcomes or drive medical innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how business strategies can improve healthcare outcomes or medical innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in the intersection of science and business, and how you see this blend shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business principles can improve healthcare outcomes or biomedical innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine a career where science meets business - what excites you about applying biological principles to drive innovations in the healthcare industry?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine developing a groundbreaking medical treatment; how do you envision combining science and business strategies to bring it from lab to global market?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new medical treatment - what excites you more, the science behind how it works or the strategy to bring it to the market?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new disease treatment - would you be more drawn to understanding the science behind it or developing its market strategy?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine working at the intersection of healthcare and business - what excites you most about applying scientific discoveries to drive innovative solutions in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Could you share an experience or moment that sparked your curiosity in how business strategies can improve healthcare outcomes or drive medical innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Imagine discovering a new drug - what excites you more, understanding how it heals the body or strategizing its global market launch?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in how business principles can improve healthcare outcomes or biomedical innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or scenario where you saw the potential for business to improve healthcare, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see the intersection of science and business driving innovation in healthcare impacting your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science and business to solve a problem or improve a process, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about the intersection of science, health, and business, and how might this blend impact your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business acumen to address a real-world health issue?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with business-minded thinking, and how did this blend shape your approach to solving a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business acumen, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with practical application, and how did this shape your career aspirations in a field combining science and business?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance scientific curiosity with business acumen, and how did you navigate this intersection?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an example of how you've applied scientific concepts to solve a real-world problem, and how this experience shaped your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with business acumen, and how do you think this blend will shape your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you blended scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with business-minded thinking, and how did this blend shape your approach to solving a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance scientific curiosity with business-minded thinking, and how did you navigate this intersection?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with business-minded thinking, and how did this shape your future career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with business-minded thinking, and how did this shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an example of how you've balanced scientific curiosity with practical application, and how this balance might shape your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you balanced scientific curiosity with practical application, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business acumen to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with business acumen, and how did this shape your career aspirations in healthcare or biotechnology?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business acumen, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you balanced scientific curiosity with business-minded thinking, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you blended scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an example of how you've balanced scientific curiosity with business-minded thinking in a project or activity, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with business acumen, and how did this shape your career aspirations in healthcare innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business acumen, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you balanced scientific curiosity with practical application, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an example of how you've applied scientific concepts to solve a real-world problem, and how this experience shaped your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you balanced scientific curiosity with practical application, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking to solve a problem or improve a process?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you blended scientific curiosity with business acumen to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an example of how you've applied scientific concepts to understand a health issue, and how you think business strategies could improve its solution?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an example of how you've balanced scientific curiosity with business-minded thinking in a project or activity, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business acumen, and how did it impact your understanding of healthcare innovations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with business-minded thinking, and how did that shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance scientific curiosity with practical application, and how did that experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance scientific curiosity with business-minded thinking, and how did you navigate this intersection?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you balanced scientific curiosity with practical, real-world applications, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with practical application, and how did this shape your view on healthcare innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a moment when you combined scientific curiosity with business thinking, and how did that experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business acumen, and how did this shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an example of how you've balanced scientific curiosity with business-minded thinking in a project or activity, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business acumen, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you balanced scientific curiosity with practical application, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with business-minded thinking, and how did this shape your approach to problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you balanced scientific curiosity with business-minded thinking, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem or opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with practical application, and how did this shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you balanced scientific curiosity with business-minded thinking, and how did this blend shape your approach to problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business acumen, and how did this integration shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an example of how you've applied scientific concepts to address a real-world problem, and how this experience sparked your interest in the business side of healthcare solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking, and how did that shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with business acumen, and how did this shape your approach to problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business acumen, and how did this integration enhance your understanding or outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business acumen to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an example of how you've balanced analytical thinking with business-minded creativity, and how this blend might shape your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an example of how you've balanced scientific curiosity with business-minded thinking in a project or activity, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you balanced scientific curiosity with practical business thinking to address a real-world health issue?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you blended scientific curiosity with business acumen, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking to address a real-world health issue?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to solve a problem or address a real-world issue?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an example of how you've applied scientific concepts to solve a real-world problem, and how do you see this skill evolving in a career?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you balanced scientific curiosity with business acumen, and how did this integration shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business acumen, and how did this integration shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you balanced scientific curiosity with practical application, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you blended scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you blended scientific curiosity with business thinking to address a real-world health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking to address a real-world problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined your curiosity in science with business principles, and what did you learn from integrating these two fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Reflecting on your past, how have science and business intersected in your experiences, sparking your curiosity for a career that bridges both fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a moment when you combined science with business or leadership skills, and how did this experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in a future career?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business principles, and how did this shape your career aspirations or personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined your interest in science with business principles, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in a future career?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science and business principles to solve a problem or achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business principles, and how did this integration spark your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business principles, and how did this integration spark your interest in future career possibilities?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking to address a real-world problem or opportunity?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Have you explored the intersection of science and business in any projects or activities, and how did this blend shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or entrepreneurship, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science and business principles to solve a problem or achieve a goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business acumen, and how did this shape your aspirations for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business principles, and how did it shape your career aspirations or personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a moment when you combined science with business or leadership skills, and how did it impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did this shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business principles, and how did this integration spark your interest in pursuing a career at the intersection of both fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it shaped your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in a related career?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did this impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the connection between scientific research and its practical applications in real-world industries or markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined your curiosity in science with business principles, and what did you learn from integrating these two fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business principles, and how did it shape your interest in pursuing a career at the intersection of both?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science and business principles to solve a problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking to address a real-world problem or opportunity?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined your curiosity in life sciences with business principles, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined your interest in science with business or leadership skills, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined your interest in science with business principles, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the connection between science and business, and how it sparked your interest in pursuing a career at their intersection?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science and business principles to address a real-world problem or opportunity?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science and business, and how did it shape your aspirations for a career at the intersection of both?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined your curiosity for life sciences with business principles to address a real-world problem or opportunity?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business principles, and how did it shape your career aspirations or personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did it impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Reflect on a time you blended science with business or leadership skills - how did this experience shape your career aspirations in this interdisciplinary field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking to solve a problem or pursue an opportunity?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking, and how did it shape your aspirations for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business principles, and how did this shape your career aspirations in the healthcare or life sciences sector?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking, and how did it shape your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science and business principles to solve a problem or achieve a goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Have you engaged in activities, such as volunteering or projects, that blend science with business, sparking your curiosity about innovative healthcare solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Reflecting on your experiences, how have you explored the intersection of science and business, and what sparked your curiosity in this unique blend?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did this shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business acumen, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a time when you explored the intersection of science and business, and how did it spark your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it shaped your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business thinking to address a real-world problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the connection between science and business, and how it sparked your interest in pursuing a career at their intersection?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Have you engaged in activities or projects that blend science with business principles, and how do you see this integration shaping your future career?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined scientific curiosity with business acumen, and how did this shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science and business principles to address a real-world problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Have you engaged in any activities or projects that combine science with business principles, and how did they shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you describe a moment when you combined scientific curiosity with business thinking, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business principles, and how did this integration spark your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business principles, and how did it shape your interest in pursuing a career at the intersection of both fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business principles, and how did this integration spark your interest in pursuing a career at the intersection of both fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the connection between science and business, and how it sparked your interest in pursuing a career at their intersection?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or entrepreneurship, and how did it spark your interest in pursuing a career at the intersection of these fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business principles, and how did this integration impact your understanding of healthcare solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you explored the intersection of science and business, and how it sparked your curiosity about future career possibilities?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science and business principles to solve a problem or achieve a goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Biomedical Sciences and BioBusiness",
    "school": "NTU",
    "question": "Can you share an experience where you combined science with business or leadership skills, and how did this impact your career aspirations?",
    "criterion": "Experiences"
  }
]