[
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a puzzle sparked your curiosity, and how did that moment shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a problem with evidence sparked your curiosity, and how did that moment influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a problem with numbers sparked your curiosity, and how did that moment shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a problem with numbers sparked your curiosity, and how do you see this passion evolving in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you found a hidden pattern or insight in everyday data, and how it sparked your curiosity about its potential impact?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a problem with evidence sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an example of a problem you'd love to solve using data, and how you think it could impact people's lives?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an example of a problem you'd love to solve using data, and how you think it could impact people's lives?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed patterns in everyday life and wondered how they could be analyzed to make better decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information or solving a puzzle sparked your curiosity, and how do you see this skill shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed a pattern or trend in everyday life, and how understanding it deeper could benefit society or your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing patterns or solving a puzzle sparked your curiosity, and how might such skills shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a moment when you used data or logic to solve a problem, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed a pattern or trend, and how understanding it sparked your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an example of a problem or pattern you've noticed in your daily life that you wish you could analyze or solve with data?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information helped you make a better decision, and how did that process spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you discovered a hidden pattern or insight from everyday information, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you noticed a pattern or trend in everyday life, and how understanding it could lead to better decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you noticed a pattern or trend in everyday life and wondered how it could be analyzed or predicted?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed a pattern or trend, and how understanding it could impact decisions or outcomes in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed patterns in everyday life and wondered how they could be analyzed to make better decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you found a hidden pattern or insight in everyday data that sparked your curiosity about its potential impact?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing patterns or trends sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an example of how you've used data to inform a decision or solve a problem, and what sparked your curiosity in this approach?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a puzzle sparked your curiosity, and how you see this skill shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a problem with information sparked your curiosity, and how did that moment influence your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an example of a problem you'd love to solve using data, and how you think it could impact people's lives?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did that spark your curiosity about using data to drive decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information or solving a puzzle sparked your curiosity, and how you see this trait shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you uncovered an interesting pattern or insight from everyday information, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a puzzle sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed a pattern or trend in everyday life, and how you think understanding data could help you explore it further?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you discovered a hidden pattern or insight in everyday life, and how did that spark your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or patterns sparked your curiosity, and how do you see this skill shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a problem with evidence sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you used data to inform a decision or solve a problem, and what excited you about that experience?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed a pattern or trend in everyday life and wondered how it could be analyzed or predicted?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you uncovered a surprising insight from data, and how it sparked your curiosity about its potential impact?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed patterns in everyday life, and how did that spark your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a puzzle sparked your curiosity, and how it relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed a pattern or trend in everyday life, and how understanding it deeper could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you noticed a pattern or trend in everyday life, and how did that spark your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an example of a problem you'd love to solve using data, and how you think it could impact people's lives?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed a pattern or trend, and how understanding it could have led to a better decision or outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an example of a problem or pattern you've noticed in your daily life that you wish you could analyze or solve using data?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a problem with numbers sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make sense of complex information, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed a pattern or trend in everyday life, and how understanding it more deeply could benefit society or your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you discovered a hidden pattern or insight from everyday information, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you discovered insights from data, and how did that spark your curiosity about its potential impact?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you uncovered a surprising insight from data, and how it sparked your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing data or solving a puzzle sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information or solving a problem with data sparked your curiosity, and how did that make you feel?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information or solving a problem with data excited you, and how did that moment shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information or solving a puzzle sparked your curiosity, and how do you see this passion evolving in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you discovered an interesting pattern or trend in everyday life, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed a pattern or trend in everyday life, and how understanding it deeper could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you discovered a hidden pattern or insight in everyday life, and how it sparked your curiosity to explore further?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you noticed a pattern or trend in everyday life that sparked your curiosity, and how you explored it further?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you noticed a pattern or trend in your daily life and wondered how it could be analyzed or predicted?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did that spark your curiosity about using data to drive decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make sense of a large amount of information, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an example of a problem you'd love to solve using data, and how you think it could impact people's lives?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you uncovered insights from data, and how did that spark your curiosity about its potential impact?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you found patterns or insights in everyday life, and how did that spark your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed a pattern or trend in everyday life that sparked your curiosity to understand it deeper?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an example of a problem you found fascinating to analyze, and how you think studying patterns in data could help solve real-world issues?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you noticed patterns in everyday life, and how exploring those patterns sparked your curiosity about using data to drive decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed a pattern or trend, and how understanding it could have led to better decisions or outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a problem with evidence sparked your curiosity, and how you see this shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you found patterns or insights in everyday information, and how did that experience spark your curiosity about working with data?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information or solving a problem with data sparked your curiosity, and how did that make you feel about pursuing it further?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you found patterns or insights in everyday information, and how that sparked your curiosity about working with data?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you found patterns or insights in everyday information, and how that experience sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you found patterns in everyday life, and how exploring those insights sparked your curiosity about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share a moment when you noticed patterns or trends in everyday life, and how exploring those insights sparked your curiosity about the future?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information or solving a puzzle sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a puzzle sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you uncovered an interesting insight from a large set of information, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you uncovered a hidden pattern or insight from everyday information, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you discovered a hidden pattern or insight from everyday information, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information or solving a puzzle sparked your curiosity, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed patterns in everyday life, and how analyzing them sparked your curiosity about their potential impact?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or patterns sparked your curiosity, and how do you see this skill shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you uncovered a hidden pattern or insight from a large set of information, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information helped you make a better decision, and how did that process spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information or solving a puzzle sparked your curiosity, and how did that moment shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a puzzle sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information helped you make a better decision, and how did that spark your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed patterns or trends in everyday life, and how exploring those insights sparked your curiosity about working with data?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you uncovered a surprising insight from data, and how it sparked your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information helped you make a better decision, and how did that spark your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed patterns in everyday life, and how analyzing them could lead to better decisions or outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a problem with numbers sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed a pattern or trend in everyday life, and how exploring it further sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing information helped you make a better decision, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where analyzing data or solving a puzzle sparked your curiosity, and how do you see this shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you discovered a hidden pattern or insight from a large set of information, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you noticed a pattern or trend in everyday life, and how exploring it further sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large, unorganized dataset - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you noticed a pattern in everyday life and wondered how collecting more data might help you understand it better?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex problem with lots of information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large, confusing dataset or information set?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem using data, even if you're not sure where to start?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex set of information to solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you used logic or creativity to solve a complex problem, and how did that experience shape your interest in analyzing data?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or solved a problem using data, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information to solve a problem or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex set of information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem using data, even if you've never worked with datasets before?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large set of information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information to solve a problem or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make sense of a large amount of information to solve a problem or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you collected and analyzed information to make a decision - what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach analyzing a large dataset from a topic you're passionate about, like social media trends or sports statistics?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem with limited data, and what skills do you think are essential for this process?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem with messy, real-world data to inform a critical decision?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or trend in everyday life, and how you think analyzing it further could benefit society?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large, confusing dataset or information set?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex problem with lots of information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem with limited data, and what skills do you think are essential for uncovering insights?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time you analyzed information to make a decision - what steps did you take and what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information to solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information to solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large, confusing dataset - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex set of information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or trend in everyday life, and how you would approach analyzing it further?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make sense of a large, confusing dataset or information set, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information, and how did you derive meaningful insights from it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex, data-heavy problem, and how did you approach finding insights from it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex, data-rich situation, and how did you derive meaningful insights from it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information to solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem using data, even if you're unsure where to start?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information to solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information to solve a problem or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large, unfamiliar dataset - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or insight from a complex set of information, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or solved a problem using data, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex set of information to solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex, unorganized dataset - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or trend in everyday life, and how you used that insight to make a decision or prediction?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex, data-heavy situation - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex set of information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you collected and analyzed information to make a decision, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem using data, even if you're unsure where to start?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or trend in everyday life, and how you think it could be analyzed or predicted?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make sense of a large amount of information to solve a problem, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex set of information, and how did you derive meaningful insights from it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large, confusing dataset or information set?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large, confusing dataset or information set, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex problem with limited information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex problem with limited information?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex set of information to solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem with messy, real-world data, even if you're unsure where to start?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex, unorganized dataset - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information to solve a problem or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large, confusing dataset, and how did you derive meaningful insights from it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make sense of a complex problem with limited information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem using data, and what skills do you think are essential for this process?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem using data from your daily life, like predicting study group effectiveness?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information to solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex problem with limited information?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex set of information to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem with missing data, and what skills do you think you'd need to develop to tackle such challenges effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or trend in everyday life, and how did that insight influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large set of information to inform a decision or solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or trend in everyday life, and how you used that insight to make a decision or improve something?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or solved a problem using data, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or solved a problem using data, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large, confusing dataset - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem using data, even if you're unsure where to start?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or solved a problem using data, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex problem with limited information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large, confusing dataset or information set?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make sense of a large amount of information to solve a problem or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you would approach solving a complex problem using data, even if you've never formally learned data analysis techniques?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information, and how did you derive meaningful insights from it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information, and how did you derive insights from it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or trend in everyday life, and how did that insight influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex problem with limited information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or insight from a large set of information, and how did that impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex set of information to inform a decision or solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or trend in everyday life, and how you used that insight to make a better decision?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem using data, even if you're unsure where to start?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or solved a problem using data, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or trend in everyday life - how did you analyze it and what insights did you gain?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or trend in everyday life, and how you think it could be analyzed or predicted with technology?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information to solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex problem with lots of information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex problem with limited information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large amount of information to solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or solved a problem using data, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or trend in everyday life, and how you think it could be analyzed further?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex, unorganized dataset to answer a question that genuinely interested you?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a complex set of information to inform a decision or solution?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large, confusing dataset - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or solved a problem using data, and what insights did you gain from it?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make sense of a large, confusing dataset or information set?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you walk me through a time when you identified a pattern or trend in everyday life, and how you used that insight to make a better decision?",
    "criterion": "Skills"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did that impact your decision-making or understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information to solve a problem or make a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did that shape your curiosity about problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make sense of complex information or solve a problem using data, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to make a decision, and how did that process impact your outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did it spark your curiosity about driving decisions with data?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed data to inform a decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected, analyzed, or interpreted data to solve a problem or make a decision that impacted you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information to solve a problem or answer a question?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a complex problem or large dataset, and how you approached it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did that shape your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an example of a time when you had to make sense of a large amount of information, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed data to solve a problem, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did that impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you identified a pattern or solved a problem using data, and how did that impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed data to inform a decision, and how did this process spark your curiosity about its potential impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to make a decision, and how did that process impact your outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to make a decision, and how did that process interest or challenge you?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did that impact your decision-making or perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to make a decision, and how did that process spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed information, identified patterns, or made informed decisions that sparked your curiosity in pursuing a data-driven field?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed data to solve a problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you collected or analyzed data to inform a decision or solve a problem in your academic or personal life?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did you derive insights from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you identified a pattern or solved a problem using data, and how did that impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an example of a time when you collected or analyzed data to inform a decision or solve a problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did that impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed data to inform a decision, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to solve a problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed information to solve a problem or make a decision that impacted your community or personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected, analyzed, or interpreted data to inform a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed data to solve a problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to solve a problem or make a decision that impacted you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make sense of complex information, and how did you communicate your findings to others?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did that impact your decision-making or perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed information, identified patterns, or made informed decisions, and how did this process interest or challenge you?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did that shape your curiosity for problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did that impact your decision-making or perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did that shape your decisions or insights?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information to solve a problem or answer a question?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed information to solve a problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did that shape your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did you use insights to make a decision or improve a situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did that impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did you derive meaningful insights from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a complex problem or large amount of information, and how you approached it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to solve a problem or make a decision that impacted you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed information to solve a problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did that impact your decision-making or perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did that impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to solve a problem or make a decision that impacted you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did that process spark your curiosity about driving decisions with data?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an example of a time when you had to make sense of a large amount of information to solve a problem or make a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did that impact your decision-making or perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed data to solve a problem or make a decision that impacted your community or personal project?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed data to solve a problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information to inform a decision or solve a problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did that process spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you identified a pattern or solved a problem using data, and how did that impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to make a decision, and how did that process impact your outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make sense of a large amount of information, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed information to solve a problem, and how did it spark your curiosity about data-driven insights?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did that impact your decision-making or curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed information to solve a problem, and how did that process spark your curiosity about data-driven insights?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected, analyzed, or interpreted information to solve a problem, and how did it impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did that process spark your curiosity about its potential impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to solve a problem or make a decision that impacted you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a complex problem using data, and what insights did you uncover?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information to solve a problem or make a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information to solve a problem or make a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed data to solve a problem or make a decision that impacted you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did that spark your curiosity about its potential impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed data to solve a problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed data to solve a problem or make a decision that impacted your life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed information to solve a problem, and how did it impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected, analyzed, or interpreted data to solve a problem or make an informed decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to make a decision or solve a problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you collected and analyzed data to inform a decision or solve a problem in a creative way?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an example of a time when you collected or analyzed data to solve a problem or make a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed data to solve a problem or make a decision that impacted you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to solve a problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed data to inform a decision, and how did that impact your outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information to solve a problem or make a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make sense of a complex set of information to solve a problem or make a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed data to solve a problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed information to solve a problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did that shape your decisions or outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did you derive insights from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to solve a problem or make a decision that impacted you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of complex information, and how did it spark your curiosity about solving real-world problems?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you identified a problem, collected data, and analyzed it to inform a decision or solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected, analyzed, or interpreted information to solve a problem or make a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected, analyzed, or interpreted data to solve a problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a complex problem or large dataset, and how you approached it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to solve a problem or make a decision that impacted you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected or analyzed data to solve a problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you collected and analyzed information to make a decision, and what surprised you about the process?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you share an experience where you had to make sense of a large amount of information, and how did you derive meaningful insights from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Data Science and Analytics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make sense of a complex problem or large dataset, and how did you approach it?",
    "criterion": "Experiences"
  }
]