[
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or solving a complex problem, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze data or numbers to make a decision, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how analyzing data or patterns in everyday life has sparked your curiosity about decision-making or problem-solving?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example from your life where analyzing data or patterns sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where analyzing data or patterns in everyday life sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a moment when you noticed how numbers or data influenced everyday decisions, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an everyday situation where you've noticed the impact of data-driven decision-making, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how analyzing data or patterns in everyday life has sparked your curiosity about understanding human behavior and decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've applied logical reasoning to understand a real-world problem, and how that experience sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze complex data or make a decision with uncertain outcomes, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing data or trends sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing data or patterns sparked your curiosity, and how it relates to understanding real-world decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a real-life situation where analyzing data or trends sparked your curiosity, and how it relates to your desired career path?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing numbers or trends sparked your curiosity, and how do you see this skill shaping your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing numbers helped you make a better decision, and how did that shape your approach to understanding real-world issues?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used data or logic to make a decision, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or solving a complex problem, and how it sparked your curiosity about understanding economic systems?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing data or patterns sparked your curiosity, and how do you see this skill shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze complex data or make a decision with uncertain outcomes, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've applied logical reasoning or data analysis to make a decision, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a moment when you saw how numbers or data patterns influenced real-life decisions, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Could you share an example of how you've used data or logic to make a decision, and how does this approach excite you for future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an everyday situation where you noticed patterns or trends in decision-making, and how you think analyzing these could benefit individuals or society?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share a moment when you found analyzing numbers or trends fascinating, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you enjoyed analyzing data or solving a complex problem, and how it sparked your curiosity about understanding how markets or societies function?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where analyzing data or trends sparked your curiosity, and how did it influence your thoughts about future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where analyzing data or trends sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze complex data to make a decision, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used logical reasoning or data to understand a real-world problem, and why this approach excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did that process spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used data or logic to make a decision, and how did that experience spark your curiosity in analytical fields?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you used data or logic to understand a real-world problem, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've applied logical reasoning to understand a complex issue, and how this experience sparked your curiosity in data-driven decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where analyzing data or trends sparked your curiosity, and how exploring it further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example from your life where analyzing numbers or data helped you make a better decision, and how did that feel?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Could you share an example of how you've applied logical reasoning or data analysis to make a decision, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Could you share an example of how you've used data or logical reasoning to make a decision, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share a moment when you noticed how numbers shape real-life decisions, and how did that spark your curiosity about their impact?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing data or solving a complex problem sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how analyzing data or trends has helped you make a more informed decision, and how this process sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing numbers or trends sparked your curiosity, and how you see this skill shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you noticed patterns in everyday life, and how understanding the numbers behind them sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing data or trends sparked your curiosity, and how it might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where analyzing data or trends sparked your curiosity, and how you think this skill could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a moment when analyzing numbers or trends sparked your curiosity, and how do you see this interest shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where analyzing data or trends sparked your curiosity, and how you see this skill shaping your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an everyday situation where you've noticed patterns or trends in numbers, and how exploring those insights sparked your curiosity about decision-making or problem-solving?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you noticed patterns in everyday life and wondered how numbers or data could explain them?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where analyzing data or trends sparked your curiosity, and how exploring this further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share a moment when analyzing data or patterns sparked your curiosity, and how do you see this skill shaping your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where analyzing data or trends sparked your curiosity, and how it relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you enjoyed analyzing data or patterns, and how do you see this skill shaping your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used data or logic to make a decision, and how did that experience spark your curiosity in understanding economic systems?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used logical reasoning or problem-solving to understand a real-world issue, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing data or solving a complex problem sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing data or patterns helped you make a better decision, and how did that process engage you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used data or logic to make a decision, and how this approach might shape your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share a moment when you noticed how data influences everyday decisions, and how exploring this connection might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used data or logical reasoning to make a decision, and how did that experience spark your curiosity about understanding human behavior in markets?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an everyday situation where you've noticed numbers driving decisions, and how did that spark your curiosity about the underlying economic principles at play?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where analyzing data or patterns helped you make a better decision, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing data or trends sparked your curiosity, and how do you see this skill shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an everyday situation where you've noticed patterns or trends in decision-making, and how analyzing these might influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a real-life situation where you've seen data or numbers impact decision-making, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing data or patterns sparked your curiosity, and how you think this skill might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've applied logical or analytical thinking to understand a real-world issue, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data to inform a decision, and how did that experience spark your curiosity about understanding economic systems?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a real-life situation where you noticed patterns or trends in data, and how understanding them sparked your curiosity about decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used data or numbers to make a decision, and how did that experience spark your curiosity in understanding economic trends?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used data or logic to make a decision, and how did this experience spark your curiosity in understanding economic systems?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how analyzing numbers or trends has helped you make a better decision, and how might this skill benefit your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a real-life situation where analyzing data or trends sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing numbers or trends sparked your curiosity, and how you think this relates to understanding real-world decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've applied logical reasoning to understand a real-world problem, and how that experience sparked your curiosity in data-driven decision making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a real-life problem where analyzing data or trends sparked your curiosity, and how exploring its economic implications might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used data or logic to make a decision, and how that experience sparked your curiosity in analyzing real-world issues?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a moment when you noticed how data or numbers influenced a real-life decision, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where analyzing data or trends sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where analyzing data or patterns in everyday life sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a real-life situation where you noticed patterns in human behavior, and how analyzing these patterns sparked your curiosity about decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing data or trends sparked your curiosity, and how do you see this skill shaping your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share a moment when you noticed how data influences everyday decisions, and how that sparked your curiosity about understanding economic systems?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing data or solving a complex problem sparked your curiosity, and how do you see this skill shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used data or logic to make a decision, and how did that experience spark your curiosity in understanding economic systems?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you noticed patterns in everyday life, and how understanding these patterns could inform better decisions in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where analyzing data or trends sparked your curiosity, and how you think this skill could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example from your life where analyzing numbers helped you make a better decision, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing data or patterns sparked your curiosity, and how do you see this skill shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an everyday situation where you've noticed patterns in numbers or human behavior, sparking your curiosity to analyze and understand the underlying drivers?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how analyzing numbers or trends has helped you make a better decision, and why did you find that process engaging?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where analyzing data or patterns in everyday life sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've applied logical reasoning to understand a real-world problem, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an everyday situation where you've noticed numbers driving decisions, and how that sparked your curiosity in understanding the underlying economic principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used data or logic to make a decision, and how did that experience spark your curiosity in understanding economic systems?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used data or logic to make a decision, and how did that process spark your curiosity about understanding human behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing numbers or trends sparked your curiosity, and how it might relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example from your life where analyzing data or numbers helped you make a better decision, and why did you find that process engaging?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze complex data or make a decision with uncertain outcomes, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've used data or logical reasoning to make a decision, and how it sparked your curiosity about societal or market trends?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where analyzing data or patterns sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logical reasoning to make a decision - what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to inform a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential impact of a sudden change in interest rates on your own budgeting decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that process impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed a complex situation using logical reasoning and data, and how did that experience shape your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the impact of a sudden global event on local markets using data?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision - what strategies did you employ?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden surge in global oil prices on both consumers and businesses?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the potential economic impact of a new policy in your hometown, using data and logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data to inform a decision, and how did this experience shape your approach to problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential economic impact of a new policy using data, and what insights you hope to uncover?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you used logical reasoning or problem-solving to make a decision, and how did you analyze the potential outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential impact of a new government policy on a local market, using any mathematical tools you're familiar with?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden global event on local markets, using data and logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data to make an informed decision, and how did this experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed a complex problem using logical reasoning and data, and how did that process interest or challenge you?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze complex data to make an informed decision, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you would analyze the potential impact of a new government policy on a specific industry, using basic economic principles?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed complex data or patterns to make an informed decision, and how did that process interest you?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logical reasoning to make a decision - how did that process impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed a complex situation using logic and data; how did this process influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze complex data to make an informed decision, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze complex data or trends, and how did that experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logical reasoning to make a decision - what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze complex data to make an informed decision, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used logical reasoning or data analysis to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed data to inform a decision, and how did this experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logical reasoning to make a decision - what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze complex data to make an informed decision, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you used data or logic to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential impact of a sudden global event on local market trends using data?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision - what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze a complex problem using logical reasoning, and how did the process help you make a more informed decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden global event on local markets, using only the data available to you?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden price hike on consumer behavior using basic math or logic?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze complex data to make an informed decision, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden global event, like a pandemic, on local household spending habits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision - how did that shape your outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you used logical reasoning or data analysis to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden global event on local markets using data-driven insights?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision - how did that process help you grow?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze complex data to make an informed decision, and what skills did you use to achieve this?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that experience shape your approach to problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze data to make a decision, and how did this experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logical reasoning to make a decision - what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden global event on local markets using data, and what insights you hope to gain?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed complex data to inform a decision, and how did this experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden change in government spending on a country's economy using mathematical models?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential impact of a new tax policy on consumer behavior using mathematical models?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze complex data to make a decision, and how did you ensure your approach was logical?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used logical reasoning or data analysis to make a more informed decision in a complex situation?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you used data or logic to make a decision, and how did this experience shape your approach to problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logical reasoning to make a decision, and what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time you used data or logical reasoning to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential impact of a sudden interest rate hike on your own budgeting decisions and savings goals?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden price hike on consumer behavior using mathematical models?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed data to inform a decision, and how did the process impact your understanding of the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a new tax policy on consumer behavior using data, and what insights you hope to gain?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that process interest or challenge you?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential economic impact of a new government policy on a specific industry that interests you?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision - what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time you used data or logic to make a decision - what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze complex data to make a decision, and how did you ensure your approach was logical?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision - what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did the outcome influence your approach to problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze complex data or patterns to make a decision, and how did that experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that process impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden global event on local markets using data-driven insights?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that process interest or challenge you?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden price surge in a everyday product, like coffee, on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to inform a personal or group decision, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential impact of a new government policy on a country's inflation rate, using only the economic concepts you're familiar with?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the economic impact of a new policy in your hometown, using data and logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision - what strategies did you employ?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden policy change on market trends using data, and what insights you hope to gain?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used data or logic to make a decision - what was the outcome, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that helped you understand how people make decisions or how markets work?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make an informed decision, and how did that process spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or patterns to make an informed decision, and how did this experience shape your curiosity about societal or market trends?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data or trends to inform a decision, and how did this experience shape your interest in quantitative analysis?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or trends to make an informed decision, and how did this experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that helped you understand how people make choices, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that sparked your curiosity about how people make choices in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did that process spark your curiosity about understanding economic systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data or patterns to make an informed decision, and how did this experience shape your interest in understanding economic systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or solved a problem that helped you make a more informed decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did this shape your understanding of real-world issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or solved a complex problem, and how did this experience shape your interest in understanding economic systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that helped you understand how people make choices or how markets work?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or a complex situation to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or patterns to make an informed decision, and how did that experience shape your curiosity for understanding complex systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or a complex situation to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that sparked your curiosity about how people make choices in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that sparked your curiosity about how markets, policies, or human behavior intersect?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze data or patterns to make a decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or a real-world issue to inform a decision, and how did this shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that sparked your curiosity about how markets, policies, or incentives shape everyday decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've applied logical reasoning or data analysis to make a decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or a complex situation to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or a complex situation to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did this shape your understanding of real-world issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that helped you understand how people make choices or how resources are allocated?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that sparked your curiosity about how people make choices in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've applied logical reasoning or data analysis to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make an informed decision, and how did this process interest or challenge you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or trends to inform a decision, and how did this experience shape your interest in quantitative fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or a complex situation to make an informed decision, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that helped you understand how people make choices or how markets work?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or a complex situation to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did this process spark your curiosity about understanding human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem to make a more informed decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or trends to make a decision, and how did that process spark your curiosity about understanding economic systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that sparked your curiosity about how markets or societies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or trends to inform a decision, and how did this process spark your curiosity about understanding complex systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or a complex situation to make a more informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or a real-world problem to inform a decision, and how did this experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data or patterns to make an informed decision, and how did this experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you used data or logic to analyze a real-world problem, and how did it impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that sparked your curiosity about how markets, economies, or policies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you used data or logical reasoning to make a decision, and how did it impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem to understand a real-world issue, and how did this shape your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that helped you understand how people make choices or how markets work?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did this process spark your interest in understanding economic systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that sparked your curiosity about how markets or economies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did that shape your understanding of real-world issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to inform a decision, and how did this process spark your curiosity about economic systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did this shape your understanding of problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data or patterns to make a decision, and how did this experience shape your approach to problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that sparked your curiosity about how numbers shape decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've applied logical reasoning or data analysis to make a decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or patterns to make a decision, and how did this experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data or trends to inform a decision, and how did this experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did this process spark your curiosity about understanding human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you used data or logical reasoning to make a decision, and how did this experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did this process interest or challenge you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you used data or logical reasoning to make a decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or trends to inform a decision, and how did this experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or solved a problem that helped you understand how people make choices or how resources are allocated?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or a complex situation to make a decision, and how did this shape your understanding of problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that helped you understand how people make choices or how resources are allocated?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did this process interest or challenge you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that sparked your curiosity about how numbers shape real-world decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you used data or logical reasoning to make a decision, and how did that experience shape your approach to problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or a real-world issue to inform a decision, and how did that shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did it impact your outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that sparked your curiosity about how people make choices in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make an informed decision, and how did this process spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data or patterns to make a decision, and how did this experience spark your curiosity in understanding economic systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data or patterns to make an informed decision, and how did this experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to analyze data or make a decision with uncertain outcomes, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or solved a problem that helped you understand how people make choices or how markets work?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that helped you understand how people make choices or how markets work?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data or a complex issue to inform a decision, and how did this experience shape your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or a complex situation to make an informed decision, and how did it impact your outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or a complex situation to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did this process spark your curiosity about understanding economic systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or patterns to make a decision, and how did this experience spark your curiosity about quantitative fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that sparked your curiosity about how markets or societies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or solved a problem that helped you understand how people make choices, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that helped you understand how people make choices, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make an informed decision, and how did that process interest or challenge you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or patterns to make an informed decision, and how did this experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or trends to inform a decision, and how did this process spark your curiosity about economic systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make an informed decision, and how did it impact your outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you used data or logic to make a decision, and how did that experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or solved a problem that helped you understand how people make choices or how markets work?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did it impact your outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data or a complex problem to make an informed decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed data or patterns to make an informed decision, and how did this experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did that process spark your curiosity about understanding human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to inform a decision, and how did this process spark your curiosity about understanding human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an example of how you've applied logical or analytical thinking to make a decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed data or trends to make an informed decision, and how did this experience shape your interest in quantitative analysis?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did this process spark your curiosity about understanding economic systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or patterns to make a decision, and how did this process interest or challenge you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Quantitative Economics)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed data or solved a problem that helped you understand how people make choices or how resources are allocated?",
    "criterion": "Experiences"
  }
]