[
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how understanding human behavior or decision-making processes has sparked your curiosity in everyday life or current events?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Could you share how understanding human behavior and decision-making might shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how you've observed human behavior influencing decision-making, and why understanding this connection excites you for future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how understanding human behavior or decision-making could help you make a positive impact in a field that interests you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the underlying motivations or societal impacts?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you make a better decision, and how might exploring the 'why' behind choices shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how you've observed human behavior influencing decision-making, and why understanding this interplay excites you for future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how might this insight shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making processes sparked your curiosity, and how you think exploring this intersection could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making sparked your curiosity, and how might exploring this further impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed human behavior influencing economic decisions, and how did that fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior affecting economic decisions, and how did that spark your curiosity to explore this connection further?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding human behavior or decision-making fascinated you, and how exploring these aspects could enrich your future studies or career?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed human behavior influencing economic decisions, and how that sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Could you share an experience where understanding human behavior or decision-making processes sparked your curiosity, and how exploring this further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how understanding human behavior has influenced your decisions, and how you see this insight shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you make a better decision, and how might this insight shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an everyday situation where understanding human behavior or decision-making would help you make better choices, and why fascinates you about that?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how understanding the 'why' behind their choices sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making sparked your curiosity, and how exploring this further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed people making decisions, and how understanding their motivations fascinated you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how you've observed human behavior influencing economic decisions, and why does this interplay intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how might studying this intersection further benefit your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior or decision-making processes would help you make better choices in your personal or professional life?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you make a better decision, and how might exploring this connection benefit your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior or decision-making could help solve a real-world problem, and why does this intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior affecting economic decisions, and how did that spark your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making processes sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did this experience spark your curiosity in studying the interplay between people's choices and societal outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding human behavior helped you make a better decision, and how did that spark your curiosity about studying the intersection of people's choices and societal trends?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that experience spark your curiosity in studying people's choices?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how you've observed human behavior influencing economic decisions, and how exploring this connection excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how do you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you make a better decision, and how might exploring this connection further impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making sparked your curiosity, and how you think exploring this further could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example from your daily life where understanding people's decision-making processes sparked your curiosity about how societies and markets function?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decisions affected outcomes, and how understanding their motivations might influence your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding human behavior or decision-making sparked your curiosity, and how you think exploring this further could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior or decision-making could help solve a problem, and how that fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding human behavior or decision-making fascinated you, and how exploring this curiosity might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how people's decisions or behaviors were influenced by their emotions or surroundings, sparking your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you make a better decision, and how might exploring this connection benefit your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making processes sparked your curiosity, and how you think exploring these themes could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior influenced a decision, and how you'd analyze its economic impact?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making processes sparked your curiosity, and how you see this interest shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how understanding human behavior has helped you make better decisions, and how might this skill benefit your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making sparked your curiosity, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how understanding human behavior has influenced your own decision-making, and how you think this curiosity might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior and decision-making could help solve a real-world problem you're passionate about addressing?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how people's behaviors or decisions were influenced by their emotions or surroundings, and why did that fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding human behavior helped you make a better decision, and how did that experience spark your curiosity in related fields?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how you think studying this connection could benefit your future?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding human behavior helped you make a better decision, and how does that relate to your curiosity about studying the forces that drive individual choices and market outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people's behaviors or decisions fascinated you, and how you think studying human choices could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how people's behaviors or decisions impacted a larger group, and how that sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you make a better decision, and how might exploring the 'why' behind choices shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's emotions influenced their financial decisions, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making processes sparked your curiosity, and how might exploring these themes further enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Could you share an everyday situation where understanding both human decision-making and resource allocation might help you navigate or improve the outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed human behavior affecting decision-making, and how you'd analyze it from both economic and psychological angles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making processes sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an everyday situation where understanding both human behavior and resource allocation would help you make better decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an everyday situation where understanding both human behavior and decision-making processes fascinates you, and how exploring this intersection might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share a moment when you observed how people's behaviors or decisions impacted a situation, and how that sparked your curiosity about the underlying influences?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you make a better decision, and how might studying this intersection shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making sparked your curiosity, and how might exploring this further impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making processes sparked your curiosity, and how exploring this further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior and decision-making could help solve a real-world problem, and why this intrigues you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior or decision-making processes sparked your curiosity, and how exploring this intersection could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior and decision-making processes would help you make better choices in your future career or personal life?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you make a better decision, and how might exploring this connection benefit your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you found human decision-making fascinating, and how understanding the 'why' behind choices might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting economic decisions, and how that sparked your curiosity in understanding this connection?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making sparked your curiosity, and how might exploring these aspects further impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding people's behavior helped you make a better decision, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making sparked your curiosity, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share a moment when understanding human behavior or decision-making sparked your curiosity, and how exploring this intersection might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making sparked your curiosity, and how exploring this intersection might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding human behavior or decision-making processes sparked your curiosity, and how you explored it further?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you observed how people's decisions or behaviors were influenced by emotions or incentives?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Could you share an everyday situation where you found yourself analyzing both human behavior and decision-making, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how you think studying this intersection could benefit your future?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Could you share an example of how you've observed human behavior influencing economic decisions, and why this interaction fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making sparked your curiosity, and how you think studying this intersection could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding people's behaviors or decision-making processes sparked your curiosity, and how might exploring this further impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed human behavior affecting decision-making, and how understanding this connection sparks your curiosity about studying it further?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how understanding human behavior or decision-making has sparked your curiosity, and how you see this influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding human behavior helped you make a better decision, and how might this insight shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you make a better decision, and how might exploring the 'why' behind choices shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that experience spark your curiosity in studying the connection between people's choices and broader societal trends?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding people's behavior helped you make a better decision, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding human behavior helped you make a better decision, and how might exploring such insights shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or decision-making fascinated you, and how exploring this further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share a moment when understanding human behavior helped you make a better decision, and how does this curiosity drive your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding human behavior helped you make a better decision, and how might this skill benefit your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how understanding human behavior has influenced your decisions, and how you see this insight shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how you think studying this intersection could benefit your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how understanding human behavior has helped you make better decisions, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people's emotions influenced their financial decisions, and how you'd analyze this behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how you've observed human behavior influencing decision-making, and how you'd apply economic principles to understand this phenomenon?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people's emotions influenced their financial decisions, and how would you analyze this behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how would you analyze the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed human behavior to make a decision, and how did that insight impact your choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how understanding human behavior has influenced a decision you made, and how would you analyze the outcome economically?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed human behavior in a social setting and how it influenced your understanding of decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a social issue from both a logical, numerical perspective and a human behavior standpoint?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you observed human behavior influencing economic decisions, and how would you analyze that situation?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting decision-making, and how you would analyze the underlying economic and psychological factors at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how would you apply this insight to everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how you've used logical reasoning to understand a friend's decision-making process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how you've observed human behavior influencing decision-making, and how you'd analyze this through both psychological and economic lenses?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people's emotions influenced their financial decisions, and how you would analyze this behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting economic decisions, and how you'd analyze or influence that behavior in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how would you apply this insight to everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you noticed human behavior affecting economic decisions, and how would you analyze that situation using principles from both fields?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed human behavior to make a decision, and how did understanding motivations influence your choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how you've observed human behavior influencing decision-making, and how you'd apply economic principles to analyze it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior influencing economic decisions, and how you would analyze this phenomenon?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you analyze the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how might this skill be valuable in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you analyze the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you've observed how people's emotions influenced their financial decisions, and how would you analyze this behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how you've analyzed a personal or societal decision, and what factors you considered to understand the motivations behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting decision-making, and how you'd analyze it using both psychological and economic principles?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how understanding human behavior has helped you make better decisions, and how might this skill be valuable in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how might this skill be valuable in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting decision-making, and how would you analyze it from both social and economic perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice, and how did understanding people's behaviors or motivations influence your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting decision-making, and how would you analyze it using problem-solving skills?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how you analyzed the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did this insight relate to broader social outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior influencing economic decisions, and how would you analyze that interplay?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how understanding human behavior has helped you make a better decision, and how might this skill be valuable in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how you think this skill could benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how would you apply this insight to everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting economic decisions, and how would you analyze or influence that behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting decision-making, and how you'd apply analytical skills to understand the underlying motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding human behavior helped you make a better decision, and how did that insight relate to broader social or economic patterns?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting decision-making, and how you'd analyze it from both economic and psychological perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a social issue from both a logical, numerical perspective and a human behavior standpoint?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how might this skill be valuable in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example of how understanding human behavior has helped you make a better decision, and how you think this skill could benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior influencing economic decisions, and how would you analyze the underlying motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior influencing economic decisions, and how would you analyze the motivations behind those choices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that insight impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how would you apply this insight to a real-world problem?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior influencing economic decisions, and how you'd analyze the underlying motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting economic decisions, and how you would analyze or influence that behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how might this skill benefit your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult decision, and how did understanding human behavior influence your choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you observed human behavior affecting decision-making, and how would you analyze it using economic principles?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how would you analyze the outcome economically?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the underlying motivations or societal impacts?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding human behavior or decision-making processes helped you navigate a challenging situation, and how did you apply this insight?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior influencing decision-making, and how you think understanding this connection could impact your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decision-making processes impact economic outcomes, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting decision-making, and how did that insight influence your own choices or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decisions or behaviors were influenced by incentives, emotions, or social pressures?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior influencing decision-making, and how you think understanding this interplay could impact your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the underlying motivations or societal impacts?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior affecting decision-making, and how did that insight spark your curiosity about its underlying drivers?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decision-making processes influenced a situation, and how you think understanding this dynamic could impact your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decision-making processes impact economic outcomes, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decisions or behaviors were influenced by incentives, emotions, or social norms?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior influencing decision-making, and how did that spark your curiosity about understanding people's choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the underlying motivations?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people made decisions, and how that sparked your curiosity about the underlying motivations or societal impacts?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decision-making processes influenced a real-life outcome, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's behaviors or decision-making processes impacted a social, economic, or personal outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior or decision-making processes helped you navigate a challenge, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people made decisions, and how that sparked your curiosity about the underlying motivations or economic principles at play?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting decision-making, and how you think understanding this interplay could benefit your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decisions or behaviors were influenced by incentives, emotions, or social pressures?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior affecting decision-making, and how would you analyze or influence such outcomes in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decisions or behaviors were influenced by incentives, emotions, or social pressures?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting decision-making, and how this sparked your curiosity about understanding people's choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the underlying psychological and economic factors?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior affecting decision-making, and how did that insight spark your curiosity about its broader implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding human behavior helped you make a better decision, and how did this experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decisions or behaviors were influenced by incentives, emotions, or social pressures?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you make a better decision, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the underlying motivations or economic factors at play?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior affecting decision-making, and how would you analyze or improve the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity in understanding human behavior and its societal impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decision-making processes influenced a social or economic outcome, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decisions or behaviors were influenced by incentives, emotions, or social pressures?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's behaviors or decisions impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decision-making processes impacted outcomes, and how did that insight influence your own choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting decision-making, and how you think understanding this interplay could influence your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior affecting decision-making, and how did that insight spark your curiosity about influences on choice?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people made decisions, and how that sparked your curiosity about the underlying motivations or economic factors at play?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding human behavior or decision-making processes helped you navigate a challenging situation or achieve a personal goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people made decisions, and how you think understanding their thought process could benefit your future studies or career?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's behaviors or decision-making processes impacted a social or economic outcome, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people's decision-making processes impact economic outcomes, and how did that influence your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people's behaviors or decisions were influenced by incentives, emotions, or social norms?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the underlying motivations or economic impacts?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how would you analyze their choices from both social and economic angles?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people's emotions or behaviors influenced their financial decisions, and how did that fascinate you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the underlying motivations or economic influences?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's behaviors or decisions were influenced by incentives, emotions, or social pressures?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people's behaviors or decisions impacted a group or community, and how did that influence your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting decision-making, and how you think understanding this dynamic could benefit your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding human behavior helped you make a better decision, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's behaviors or decisions impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people's emotions influenced their financial decisions, and how you would analyze this behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding human behavior helped you make a better decision, and how did that experience shape your curiosity in studying people and markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's behaviors or decisions were influenced by incentives, emotions, or social norms?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decision-making processes impact economic outcomes, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people's behaviors or decisions were influenced by incentives, emotions, or social pressures?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's behaviors or decision-making processes impacted a social or economic outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior impacting decision-making, and how did that insight influence your understanding of choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the underlying motivations or economic factors at play?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior affecting decision-making, and how did that insight spark your curiosity about studying this interplay?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the underlying motivations or economic impacts?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's behaviors or decisions impacted a group, community, or market, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior impacting decision-making, and how did that spark your curiosity about its underlying drivers?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior affecting decision-making, and how did that spark your curiosity about understanding people's choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior affecting decision-making, and how it sparked your curiosity about the underlying influences?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior impacting decision-making, and how did that insight spark your curiosity about understanding people and markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior impacting decision-making, and how you think understanding this connection could influence your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the underlying motivations or economic factors at play?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decisions or behaviors were influenced by incentives, emotions, or social pressures?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people's behaviors or decisions were influenced by incentives, emotions, or social pressures?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the underlying motivations or economic influences?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decisions or behaviors were influenced by incentives, emotions, or social norms, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's behaviors or decisions were influenced by incentives, emotions, or social pressures?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's behavior or decision-making processes impacted a situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people's behaviors or decisions were influenced by their environment or emotions, and how did that insight impact your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior impacting decision-making, and how did that spark your curiosity about the underlying motivations?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior influencing decision-making, and how you think understanding the 'why' behind these choices could impact your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior influencing decision-making, and how you think understanding this connection could impact your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how would studying human behavior impact your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior affecting decision-making, and how did that insight spark your curiosity about its broader implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people's decisions or behaviors were influenced by their emotions or social environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the factors influencing their choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and what did you learn from it about human behavior or incentives?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding human behavior or decision-making helped you solve a problem or achieve a goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people's behaviors or decisions were influenced by incentives, emotions, or social pressures, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people's decisions or behaviors were influenced by incentives, emotions, or social pressures?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people's behaviors or decisions impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decision-making processes impact economic outcomes, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people's decisions or behaviors were influenced by incentives, emotions, or social norms?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's emotions or behaviors influenced their decision-making, and how did that insight impact your understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's behaviors or decisions were influenced by incentives, emotions, or social pressures?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people made decisions, and how that sparked your curiosity about the factors influencing human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decision-making processes impact economic outcomes, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior impacting decision-making, and how did that spark your curiosity about studying the interplay between the two?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior affecting decision-making, and how this sparked your curiosity about the underlying motivations or economic principles at play?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people's decisions or behaviors were influenced by incentives, emotions, or social pressures?",
    "criterion": "Experiences"
  }
]