[
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Could you share an example of how you've observed economic principles at play in your daily life, and how exploring these concepts further excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example from your life where understanding how people make choices or how resources are allocated sparked your curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you observed a problem related to resource allocation, and how did that spark your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how resources were allocated, and how did that observation spark your curiosity about decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you noticed how people make choices with limited resources, and how it sparked your curiosity about the underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how resources were allocated, and how it sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you observed supply and demand in action, and how did that spark your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Could you share an example from your life where understanding how people make choices or how resources are allocated sparked your curiosity, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed the impact of scarcity or decision-making, and how it sparked your curiosity about understanding such phenomena?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share a real-life situation where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about the underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where understanding how people make choices or how resources are allocated sparked your curiosity about studying human decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example from your daily life where understanding how people make choices or how resources are allocated sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you observed a problem related to resource allocation, and how you think studying economics could help address it?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how did that spark your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how resources were allocated, and how it sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share a real-life situation where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Could you share an everyday situation where you noticed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Have you ever observed how people make daily choices, and how would understanding the 'why' behind these decisions impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you observed a 'scarcity' issue, and how would you analyze or address it if given the chance?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about how markets function?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where understanding how people make choices or how resources are allocated sparked your curiosity, and why it fascinated you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Have you ever observed how people make daily choices, and how would studying these decisions impact your understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share a moment when you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed the impact of scarcity or decision-making, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Have you ever observed how people make choices in your daily life, and how might understanding these decisions shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you observed a trade-off between choices, and how did that spark your curiosity about decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed supply and demand in action, and how it sparked your curiosity about decision-making in everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you noticed how people's choices affect outcomes, and how did that spark your curiosity about understanding these patterns?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you observed a problem related to resource allocation, and how would you approach solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example from your daily life where understanding how people make choices or how resources are allocated sparked your curiosity about studying this field?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share a real-life situation where you observed how people make choices, and how understanding the 'why' behind these decisions fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example from your life where you observed a problem related to resource allocation, and how did it spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where understanding how people make choices or how resources are allocated sparked your curiosity, and why it fascinated you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how that sparked your curiosity about understanding decision-making patterns?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to explore them further?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example from your life where you noticed how people make choices with limited resources, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed the impact of scarcity or decision-making, and how it sparked your curiosity about understanding such phenomena?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about decision-making in a global?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about understanding markets better?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share a current event or personal experience that sparked your curiosity about how people make choices or how resources are allocated?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed how people make choices, and how that sparked your curiosity about understanding decision-making patterns?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example from your daily life where you noticed how people make choices, and how that sparked your curiosity about understanding decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding the 'why' behind these decisions excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you observed supply and demand in action, and how it sparked your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Could you share an example of how understanding how people make choices or how resources are allocated might impact your future goals or daily life decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed supply and demand in action, and how it sparked your curiosity about how markets function?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed the impact of scarcity or trade-offs, and how it sparked your curiosity about understanding such phenomena?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you've observed supply and demand at play, and how it sparked your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, sparking your curiosity to understand such economic principles better?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Could you share an everyday situation where you noticed the impact of scarcity or trade-offs, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you've noticed the impact of supply and demand, and how it sparked your curiosity about the subject?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example from your life where understanding how people make choices or how resources are allocated sparked your curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions could impact your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed the impact of scarcity or trade-offs, and how it sparked your curiosity about understanding these dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how observing everyday life, like how people make choices, has sparked your curiosity about the world's resource distribution?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed how people make choices, and how understanding those decisions might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you've observed the impact of scarcity or trade-offs, and how it sparked your curiosity about decision-making in life?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Could you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about the underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed supply and demand in action, and how it sparked your curiosity about understanding economic principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example from your life where understanding how people make choices or how resources are allocated sparked your curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about decision-making in a global?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you observed a 'scarce resource' and how you think people made decisions about it?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example from your life where understanding how people make choices or how resources are allocated sparked your curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share a recent event or personal experience that sparked your curiosity about how people make choices or how resources are allocated in society?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you observed a problem related to resource allocation, and how you think it could be improved?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding the 'why' behind these decisions excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Could you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you've observed the impact of supply and demand, and how it sparked your curiosity about decision-making in life?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed the impact of supply and demand, and how did that spark your curiosity about decision-making in everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life or current events, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed the impact of supply and demand, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a real-life situation where you observed the impact of supply and demand, and how it sparked your curiosity about understanding such economic principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an everyday situation where you observed a problem related to resource allocation, and how you think it could be improved?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example from your life where understanding how people make choices or how resources are allocated sparked your curiosity about studying human behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Could you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, to understand its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you had to make a difficult choice with limited resources, and how did you weigh the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you analyzed the costs and benefits of a personal decision, and how did this experience shape your understanding of decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand, and how did it influence your decision-making or perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, using logical reasoning and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a real-world problem, like a market trend or social issue, and how you approached understanding its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you had to make a difficult choice involving trade-offs, and how did you weigh the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a real-world problem, like a market trend or social issue, and how did that experience shape your curiosity about understanding human decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand in action, and how it impacted your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a real-life situation involving trade-offs, and how did you weigh the pros and cons?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you analyzed the costs and benefits of a personal decision, and how did this experience shape your understanding of decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand, and how did it influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through how you'd analyze the impact of a new government policy on your local community's spending habits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, and what insights did you gain?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you analyzed the costs and benefits of a personal decision, and how did that shape your choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and how you weighed the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a real-world problem, like inflation or unemployment, and how you would approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a real-world issue, like inflation or unemployment, and explain how you would approach understanding its root causes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and considered the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a real-world problem, like a market trend or a policy change, and how did you apply logical reasoning to understand its impact?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and how you weighed the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've analyzed everyday situations, like household budgeting or market trends, to make informed decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through how you'd analyze the potential impact of a new government policy on a local community, using everyday observations?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like pricing or resource allocation, to understand the underlying incentives or trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the motivations behind people's choices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction or a personal financial decision, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical decision-making to resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding between two options, and how you weighed the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market transaction, to understand the motivations and decisions behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a everyday situation, like a price change, and considered how it might impact people's behavior or decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, to make a better decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make a difficult choice, and how did you weigh the potential costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and considered the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a everyday problem, like deciding on a purchase, and considered the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed a change in supply or demand, and how you think it impacted the market or community involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand, and how did it influence your understanding of decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a everyday situation, like managing your allowance, and applied logical reasoning to make a better decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you had to make a difficult choice involving trade-offs, and how did you weigh the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you had to make a choice with limited resources, and how did you weigh the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a real-world problem, like inflation or unemployment, and how did that experience shape your curiosity about understanding how societies make choices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, using logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a real-world problem, like a market trend or policy change, to understand its broader impact?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it spark your curiosity about economic principles?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and considered the broader impact on resources or society?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed supply and demand in action, and how you'd adapt if those dynamics suddenly shifted?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you had to make a difficult choice, and how did you weigh the potential costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example from your life where you had to weigh the costs and benefits of a decision, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, to inform a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social or market trend, to understand its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through how you'd analyze the impact of a sudden global event on your local community's spending habits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and how did you apply logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you noticed how people make choices, and how would studying these decision-making patterns help you in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you analyzed the costs and benefits of a personal decision, and how did that influence your choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you analyzed a real-life situation, like a market trend or personal finance decision, to make an informed choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example from your life where you had to make a difficult choice, and how you weighed the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a real-world problem, like a market trend or a personal finance decision, and how you applied logical reasoning to understand its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, using logical reasoning and data?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make a difficult choice, and how did weighing the pros and cons influence your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you had to make a difficult choice with limited resources, and how did you weigh the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market transaction or a personal decision, using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the motivations of those involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a real-world issue, like a market trend or policy change, to understand its broader impact?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you analyzed the impact of a everyday decision, like choosing a part-time job, on your personal 'scarcity' of time or money?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and how you weighed the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, and applied logical reasoning to find a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market or a decision, and how you broke it down to understand the underlying motivations or patterns?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through how you'd analyze the potential impact of a new public policy on both individual choices and the broader economy?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make a difficult decision involving trade-offs, and how did you weigh the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand, and how did it influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you had to make a difficult choice with limited resources, and how you analyzed the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and considered the broader implications of your choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you analyzed the impact of a everyday decision, like choosing a phone plan, and how it relates to broader economic principles?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and how did you apply logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a real-life example of supply and demand, and how did it influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make a difficult choice, and how did you weigh the potential costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market or a social issue, using logical reasoning and data?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and considered the broader impact on resources or society?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the motivations behind people's choices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market transaction, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make a difficult choice involving trade-offs, and how did you weigh the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed a real-life example of scarcity or trade-offs, and how did it influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, and how did you break it down?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to make a difficult choice involving trade-offs, and how did you weigh the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and considered the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market transaction, to understand the motivations behind people's choices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you had to make a difficult choice with limited resources, and how did you weigh the pros and cons?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and considered the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like pricing or resource allocation, to understand the underlying decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how would you analyze their decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you had to make a difficult choice with limited resources, and how did you weigh the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about understanding decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices with limited resources, and how did that shape your curiosity about decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed how people make choices, and how did that insight spark your curiosity about everyday decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy change, and explain how it sparked your curiosity about how societies allocate resources?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how did that spark your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity, choice, or trade-offs in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about understanding decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a real-world issue, such as a market trend or policy change, and how it sparked your curiosity about human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that influence your perspective on decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed or experienced the impact of decision-making on resource allocation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resources and decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed how people make choices, and how did that spark your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed a real-world problem, like a market trend or social issue, and how it sparked your curiosity about decision-making or resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market trend or a personal finance decision, to understand the underlying motivations or patterns?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices or allocate resources, and how did that spark your curiosity about understanding such behaviors?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about understanding decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed or experienced a real-life example of scarcity, and how it influenced your decision-making or perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed how people make choices, and how that sparked your curiosity about the world's resource distribution?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that spark your curiosity about understanding decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed the impact of everyday decisions on resources or outcomes, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people made choices with limited resources, and how did that influence your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed how people make choices, and how that sparked your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed how people make choices or observed the impact of scarcity, and how it sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how did that spark your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity, choice, or trade-offs in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you analyzed how people make choices or how resources are allocated, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people made choices with limited resources, and how did that influence your curiosity about decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed how people make choices, and how did that spark your curiosity about understanding decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed how people make choices, and how that insight might shape your future decisions or career?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed how resources were allocated or decisions were made, and how that sparked your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed or experienced the impact of economic decisions in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about understanding decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed how people make decisions, and how that insight might shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or trade-offs in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices or allocate resources, and how did that spark your curiosity about understanding such decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed how people make choices or observed how resources were allocated, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed a real-world problem, like a market trend or policy change, and how it sparked your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed how resources were allocated, and how did that experience shape your understanding of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed or experienced the impact of decision-making on resource allocation in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about its broader impacts?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed how people make choices, and how that insight might shape your future decisions or career goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about understanding decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed how people make choices, and how that sparked your curiosity about the factors influencing decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed how people make choices or observed how resources were allocated, sparking your curiosity about these dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed how people make choices, and how that sparked your curiosity about the world of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a situation where you observed how people make choices, and how that sparked your curiosity about the forces driving those decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how did that spark your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how did that spark your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about global systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you analyzed how people make choices, and how did that insight spark your curiosity about understanding decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the forces driving those decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an example of how you've observed or experienced the impact of economic decisions in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NUS",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  }
]