[
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading a book or discussing an idea sparked your curiosity, and how you envision such experiences shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your reading experiences, how do you think exploring literary works can shape your understanding of diverse cultures and inform your approach to teaching others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book, how would you design an engaging lesson to share its themes with younger readers, and why?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books, how do you see storytelling shaping perspectives, and could teaching these narratives inspire future generations?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books, how do you see storytelling shaping perspectives, and could you envision guiding others in discovering such literary insights?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever envisioned yourself inspiring others through storytelling or teaching, and how do you think exploring literary works could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might you build on this in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books or stories, how do you think exploring their deeper meanings could shape your future interactions with others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book or author, how do you see exploring literary works shaping your future interactions with diverse learners?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading a book or discussing an idea sparked your curiosity, and how might that relate to inspiring others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever been inspired by a novel or poem to see the world differently, and how might sharing such experiences shape your future interactions with others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when a literary work deeply impacted you, and how you envision sharing such experiences with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever imagined teaching a novel that changed your perspective, and how would you inspire others to find similar insights through literature?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading or discussing a literary work sparked your curiosity, and how might that relate to inspiring others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books or stories, how do you see exploring their themes and teaching them to others shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books or stories, how do you see exploring their themes and teaching them to others shaping your personal growth or career?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when a literary work deeply resonated with you, and how you'd use that connection to inspire future students?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when a book or story deeply impacted you, and how you envision sharing such experiences with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book or literary character, how do you think exploring such texts in depth could shape your future teaching or mentoring approach?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book, how would you creatively teach its themes to a diverse group of students, and why does this approach excite you?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading a book or discussing a story sparked your curiosity, and how you envision such experiences shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when a book or story deeply impacted you, and how you envision sharing such experiences with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever envisioned a future where you inspire others through storytelling or teaching, and how might exploring literary works shape your personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books or stories, how do you think exploring their themes and teaching them to others could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book, how would you creatively teach its themes to a diverse group of students, and what inspired this approach?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book or author, how do you envision exploring and sharing its impact with others in a teaching or mentorship role?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book, how would you creatively teach its themes to a diverse group of students, and why does this approach excite you?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work sparked your curiosity, and how you envision sharing such experiences with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book or author, how do you envision exploring and sharing such literary passions with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when a book or story deeply impacted you, and how you'd inspire others to have similar experiences in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book, how would you design an engaging lesson to share its themes with younger readers?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite literary works, how do you envision using storytelling to inspire or educate others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever imagined teaching a novel that changed your perspective, and how would you make its themes resonate with diverse young minds?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see storytelling shaping perspectives, and could teaching these works inspire future generations?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever envisioned using literature to inspire young minds, and how might this passion shape your future career or personal fulfillment?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever envisioned yourself inspiring others through storytelling or literary analysis, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading or discussing a literary work sparked a desire in you to teach or inspire others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching moment sparked your curiosity, and how might this passion guide your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work sparked a desire in you to teach or discuss its themes with others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever connected with a character or theme in a novel that sparked a desire to share such experiences with others through teaching?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you see exploring literary works shaping your personal growth or future role in inspiring young minds?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work sparked a new perspective for you, and how would you inspire others to explore such insights?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading a literary work sparked a desire to teach or share its impact with others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book or author, how do you envision sharing its impact with others, and what role might teaching play in your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when a literary work sparked a new perspective for you, and how you'd inspire others to discover similar insights?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when a book or story deeply impacted you, and how you envision sharing such experiences with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book, how would you creatively teach its themes to a diverse group of students, and why does this approach excite you?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books, how do you envision using storytelling to inspire or educate others in your future career or personal projects?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you envision exploring and sharing their impact with others in a teaching or mentoring role?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book, how would you creatively teach its themes to a diverse group of students, and why does this approach excite you?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you think exploring literary works could shape your teaching style or inspire future students?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading or discussing a literary work sparked your curiosity, and how might that experience shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when a book or story deeply impacted you, and how you envision sharing such experiences with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when a book or story deeply impacted you, and how you envision sharing such transformative experiences with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever imagined teaching a novel that changed your perspective, and how would you make it resonate with students from diverse backgrounds?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading or discussing a literary work sparked your curiosity, and how might exploring such texts shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever envisioned using literature to inspire young minds, and how do you see storytelling shaping your future interactions with diverse learners?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books or stories, how do you see exploring and teaching literature shaping your future goals or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading or discussing a literary work sparked your curiosity, and how you envision sharing such experiences with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books, how do you see storytelling shaping perspectives, and how might you inspire others through literature in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading or discussing a literary work sparked your curiosity, and how you envision sharing that passion with others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work sparked a desire to discuss its themes or messages with others, and why did that resonate with you?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book, how would you creatively teach its themes to a diverse group of students, and why does this approach excite you?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books or stories, how do you envision exploring and sharing their impact with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever imagined teaching a novel that changed your perspective - how would you make it resonate with diverse young readers?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever connected with a character or theme in a book that inspired you to share its impact with others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when a literary work deeply impacted you, and how you'd creatively teach its themes to others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favourite book, how would you creatively teach its themes to a diverse group of students, and why does this approach excite you?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading a novel or poem sparked a new perspective for you, and how would you inspire others to have similar experiences?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you think exploring their works in depth could shape your future or inspire others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading or discussing a literary work sparked your curiosity, and how you envision sharing such experiences with others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books or stories, how do you think exploring their deeper meanings could shape your future interactions with others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books, how do you see exploring literary works shaping your future, whether in teaching, writing, or beyond?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work sparked a desire in you to teach or share its insights with others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books, how do you see storytelling shaping perspectives, and how might you share this passion with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever envisioned using storytelling or literary analysis to inspire young minds, and how might that shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your reading experiences, how do you see exploring literary works shaping your views or informing your approach to teaching others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book or author, how do you envision exploring and sharing literary works with others in a meaningful way?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books, how do you see exploring literary works shaping your understanding of diverse perspectives and informing your future role as an educator?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading a novel or poem sparked a desire in you to discuss its themes or teach it to others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your reading experiences, how do you see exploring literary works shaping your understanding of diverse perspectives and informing your approach to teaching others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your reading experiences, how do you see exploring literary works shaping your understanding of diverse cultures and informing your approach to teaching others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books or stories, how do you think exploring their deeper meanings could shape your future or impact others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when a literary work deeply impacted you, and how you envision sharing such transformative experiences with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading or discussing a literary work sparked your curiosity, and how you envision sharing such experiences with others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever envisioned using storytelling to inspire young minds, and if so, what draws you to this unique blend of literary exploration and educational nurture?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work sparked a desire in you to share its impact with others, and why?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when a book or story deeply impacted you, and how might you inspire others to have similar experiences?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your understanding of the world or informing your approach to teaching others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading or discussing a literary work sparked your curiosity, and how you envision such experiences shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your reading experiences, how do you see exploring literary works shaping your understanding of diverse perspectives and informing your future role as an educator?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading a literary work sparked a desire in you to teach or share its impact with others?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever envisioned using storytelling to inspire young minds, and if so, what draws you to this transformative approach to learning and growth?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book, how would you design a lesson to share its themes with others, and what do you hope they'd learn from it?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading or discussing a literary work sparked your curiosity, and how you envision such experiences shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when a book or story deeply impacted you, and how would you inspire others to have similar experiences?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you see exploring literary works shaping your perspective, and how might sharing this passion with others inspire your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share a moment when reading a book or discussing literature sparked your curiosity, and how you envision sharing such moments with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever envisioned shaping young minds through storytelling, and how might this role impact your own literary journey and growth?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Have you ever envisioned teaching literature to diverse groups, and how do you think storytelling shapes perspectives in a multicultural society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work deeply impacted you, and how would you share that enthusiasm with students who might not initially appreciate it?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or poem sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work helped you develop a new perspective, and how might this skill benefit your future teaching practices?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or poem deeply impacted your perspective, and how would you share that experience with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of a literary work that resonated with you and how you would creatively teach its themes to a diverse group of students?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work impacted your perspective, and how would you adapt this lesson to engage younger readers?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflect on a time when a literary work profoundly impacted you; how would you creatively teach its themes to a diverse group of students?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work helped you develop a new perspective, and how might this skill benefit your future interactions with diverse groups?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work impacted your perspective, and how would you inspire others to find similar value in literature?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of a literary work that has influenced your perspective, and how would you teach its themes to a diverse group of students?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work helped you develop a new perspective, and how might this skill benefit your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has influenced your perspective, and how you might apply this reflective process in guiding others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has helped you develop empathy or understand different perspectives, and how might this skill benefit your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work sparked a new perspective for you, and how would you inspire others to find similar insights?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work changed your perspective, and how would you inspire others to have similar transformative experiences?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work helped you understand different perspectives, and how would you apply this skill in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary character's journey has influenced your perspective, and how might you apply this insight in guiding others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or poem sparked a new perspective for you, and how would you inspire others to explore such literary works?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or poem sparked a new perspective for you, and how would you inspire others to discover this?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how reading a literary work has influenced your perspective, and how would you inspire others to have similar experiences?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem has influenced your perspective, and how you might apply this skill in guiding others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of a literary work that resonated with you and how you'd creatively teach its themes to a diverse group of students?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work deeply impacted you, and how would you share its significance with a diverse group of learners?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has influenced your perspective, and how might you inspire others to find similar value in literature?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem has influenced your perspective, and how you might apply this skill in a teaching or mentorship role?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem has influenced your perspective, and how might you inspire others to find similar insights?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work influenced your perspective, and how would you creatively teach its themes to others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary text has influenced your perspective, and how you might apply this skill in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on a novel that resonated with you, how would you creatively adapt it for younger readers, and what skills do you think this process would develop in you?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary character's journey has influenced your perspective on personal growth or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has influenced your perspective, and how might you apply this skill in guiding others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary character's journey has influenced your perspective on teaching and learning in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or poem sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary character's journey has influenced your perspective, and how might you apply this reflective approach in guiding others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or poem sparked a new perspective for you, and how would you inspire others to discover this?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or poem sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary character's journey has influenced your perspective on teaching or mentoring others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has influenced your perspective, and how you might apply this skill in guiding others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work profoundly impacted you, and how would you share that experience with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work influenced your perspective, and how would you inspire others to have similar transformative experiences?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work helped you develop a new perspective, and how might this skill benefit your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work profoundly impacted your perspective, and how would you inspire others to discover similar insights?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary character's journey has influenced your perspective on teaching or mentoring others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of a literary work that resonated with you and how you would creatively teach its themes to a diverse group of students?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work profoundly impacted you, and how would you share that experience with others in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work sparked a new perspective for you, and how would you inspire others to explore such insights?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has influenced your perspective, and how might you apply this skill in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work sparked a new perspective for you, and how you'd share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem has influenced your perspective, and how might you inspire others to find similar insights?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or poem sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work influenced your perspective, and how would you adapt this lesson for younger learners?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has influenced your perspective, and how would you apply this process to inspire future students?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem has influenced your perspective, and how might you inspire others to explore such literary insights?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work impacted your perspective, and how would you inspire others to discover similar transformative experiences through teaching?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of a literary work that profoundly impacted you and explain how you'd inspire others to engage with it?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has influenced your perspective, and how might you apply this skill in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary character's journey has influenced your perspective, and how might you apply this insight in guiding others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem has influenced your perspective on life or society, and how might you inspire others to do the same?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a new perspective, and how might this skill benefit your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary character's growth has influenced your own perspective or approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary character's journey has influenced your perspective, and how might you apply this insight in guiding others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work helped you understand a social issue, and how would you teach this insight to others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work influenced your perspective, and how would you inspire others to explore such transformative texts?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has influenced your perspective, and how you might apply this skill in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work broadened your perspective, and how would you inspire others to have similar experiences?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop empathy or a new perspective, and how might this skill benefit your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work impacted your perspective, and how would you share that experience with others in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has helped you develop a new perspective or empathy, and how might this skill benefit your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work helped you develop a new perspective, and how might this skill benefit your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of a book or poem that resonated with you and explain how you would teach its themes to a diverse group of students?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem has influenced your perspective, and how might you inspire others to find similar insights?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of a literary work that resonated with you, and how you would creatively teach its themes to a disengaged student?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work influenced your perspective, and how would you inspire others to discover that same impact?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem has helped you develop empathy or a new perspective, and how might this skill benefit your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or poem sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of a literary work that inspired you, and how would you creatively teach its themes to a diverse group of students?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of a literary work that resonated with you and explain how you would creatively teach its themes to a diverse group of students?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of a literary work that deeply resonated with you, and how would you creatively teach its themes to a disinterested student?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or poem sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has influenced your perspective, and how might you apply this skill in a teaching or mentoring role?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem has influenced your perspective, and how might you apply this skill in guiding others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work influenced your perspective, and how would you inspire others to explore such transformative texts?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work helped you understand different perspectives, and how might this skill benefit your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem has influenced your perspective, and how might you apply this skill in guiding others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary text has influenced your perspective, and how you might apply this reflective practice in guiding others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary character's journey has influenced your perspective on teaching or mentoring others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work changed your perspective, and how would you inspire others to have similar experiences?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has influenced your perspective, and how might you apply this skill in a teaching or mentoring role?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work influenced your perspective, and how would you creatively teach its themes to others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem has influenced your perspective, and how might you inspire others to find similar insights?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work profoundly impacted your perspective, and how would you share this experience with others effectively?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has influenced your perspective, and how you might apply this skill in guiding others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how reading a novel or poem has influenced your perspective, and how you might inspire others to have similar experiences?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has influenced your perspective, and how you might apply this skill in a teaching or mentoring role?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your reading and learning journey, how have your experiences with literature influenced your desire to teach and inspire others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or teaching others helped you grow, and how might such experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this impact your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading or discussing a literary work sparked a new perspective for you, and how you shared that insight with others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your journey, how have your experiences with literature influenced your desire to teach or share stories with others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading or discussing a literary work sparked a new perspective for you, and how you'd share that excitement with others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading or discussing a literary work sparked your curiosity, and how you envisioned sharing that passion with others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work influenced your perspective, and how might you apply that insight in guiding others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work sparked a new perspective for you, and how might this shape your approach to teaching or mentoring others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work influenced your perspective, and how might you apply that insight in guiding others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or teaching others helped you grow, and how might that relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, shaping your aspirations for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work sparked a meaningful conversation, and how did you facilitate or contribute to it?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others deepened your understanding of yourself or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work sparked a new perspective for you, and how you applied it?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this impact your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work sparked a meaningful conversation or reflection that you still think about today?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflect on a moment when a literary work deeply impacted you; how did you envision sharing its significance with others in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, shaping your future aspirations in meaningful ways?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring a literary work or teaching others has influenced your personal growth or sparked a career aspiration?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your reading or teaching experiences, how have stories or literature influenced your perspective, and how might you share this impact with others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or sharing a story sparked your curiosity about teaching or mentoring others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work inspired you to teach or share its lessons with others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, shaping your aspirations for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this impact your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, shaping your aspirations for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work sparked your curiosity, and how you envisioned sharing its insights with others in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how reading or discussing a literary work has inspired you to teach or mentor others in some capacity?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring a literary work or teaching moment has inspired a new perspective or interest in you?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading or discussing a literary work inspired you to teach or share its impact with others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others deepened your understanding of different perspectives or cultures?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work sparked a meaningful conversation or reflection for you?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work sparked a new perspective for you, and how you applied it?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, shaping your aspirations for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work inspired you to teach or share its impact with others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work sparked a new perspective, and how you applied that insight in a teaching or mentoring role?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when reading or discussing a literary work sparked a new perspective for you, and how you shared that insight with others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite book or literary character, how has reading or discussing it with others influenced your desire to teach or share stories with diverse groups?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how reading or discussing literature has influenced your perspective on teaching or learning, and why was this moment significant?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching moment sparked your curiosity, and how did it shape your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching moment sparked your curiosity, and how it relates to your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, shaping your goals for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work sparked your curiosity, and how you envisioned sharing that excitement with others in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work sparked a new perspective for you, and how might this shape your approach to teaching or learning in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others deepened your understanding of its themes or your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, shaping your aspirations for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others deepened your understanding of yourself or your community?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how reading or discussing a literary work has influenced your perspective, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring a literary work or teaching moment sparked your curiosity about shaping young minds through storytelling?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your journey, can you share an experience where exploring a literary work or teaching others helped you grow, shaping your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others deepened your understanding of yourself or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or teaching others a new concept sparked your curiosity or creativity, and why it resonated with you?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work influenced your perspective, and how might such moments shape your approach to teaching others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work influenced your perspective, and how might you inspire others to explore such texts?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work sparked a new perspective for you, and how might you inspire others with it?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work sparked a meaningful conversation or reflection for you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others deepened your understanding of yourself or society, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work influenced your perspective, and how might you inspire others to explore such insights?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or teaching others deepened your understanding of yourself or your community?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring a literary work or teaching moment sparked your curiosity about shaping young minds or societal perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching moment sparked your curiosity about how stories shape our understanding of the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, shaping your aspirations for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching moment sparked your curiosity, and how it might shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where reading or discussing a literary work inspired you to teach or share knowledge with others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching moment sparked your curiosity, and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, shaping your vision for your future?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring a literary work or teaching moment has inspired your own growth or sparked a desire to inspire others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Reflecting on your past, can you share an experience where exploring a literary work or teaching others deepened your understanding of different perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  }
]