[
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or philosophical debates, how do you see exploring literature and critical thinking shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea sparked your curiosity, and how might such explorations shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you think exploring the human condition through literature and philosophical debates might shape your worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite book or philosophical debate, how do you see exploring language and ideas shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and critical thinking shaping your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and philosophical ideas shaping your personal growth or career path?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite book or philosophical debate, how do you see exploring language, ethics, or reality shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading and discussions, how do you see exploring the complexities of language and ethics shaping your future perspectives or career choices?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share a moment when exploring a complex idea or analyzing a literary work helped you better understand yourself or the world around you?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you think exploring the nuances of language and philosophical ideas will shape your perspective on life and inform your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, what draws you to exploring complex ideas in literature, and how might this enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and critical thinking shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and critical thinking shaping your future pursuits or personal outlook?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading and discussions, how do you see exploring the intricacies of language and fundamental questions about existence shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or pondering life's big questions, and how do you see exploring these passions shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favourite book or philosophical debate, how do you see exploring language and critical thinking shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language, ethics, or reality shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or philosophical debates, how do you see exploring language, ethics, or logic shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea sparked your curiosity, and how it might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share a moment when exploring a literary work or philosophical idea sparked your curiosity, and how might such explorations shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or philosophical idea deeply impacted your perspective, and how might such exploration shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you see exploring the nuances of language and philosophical ideas shaping your perspective or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a complex idea or analyzing a literary work helped you better understand yourself or the world?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and fundamental questions shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favourite book or philosophical debate, how do you see exploring language and critical thinking shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favourite books or thought-provoking discussions, how do you see exploring language and critical thinking shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language, ethics, or reality shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you think exploring the complexities of language and ethics might shape your perspective in future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thinkers, how do you see exploring their ideas in-depth shaping your worldview or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Have you ever analyzed a novel or poem that challenged your worldview, and how did that shape your curiosity about language and critical thinking?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favourite books or philosophical debates, how do you see exploring language and critical thinking shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you think exploring the nuances of language and ethics might shape your worldview or career path?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or philosophical debates, how do you see exploring language, ethics, and meaning shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the nuances of language or pondered life's big questions, and how might exploring these interests shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, which book or author sparked your curiosity about the human condition, and how do you see exploring these themes shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea helped you better understand yourself or the world around you?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and fundamental questions shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how exploring the meaning of a literary text or philosophical idea has influenced your perspective on life or society?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a thought-provoking novel or philosophical idea inspired you to think critically about life or society?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or questioning fundamental beliefs sparked your curiosity and shaped your perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea helped you better understand yourself or the world around you?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading and thinking habits, how do you see exploring the nuances of language and ethics shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or philosophical debates, how do you see exploring language, ethics, or reality shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or philosophical idea sparked your curiosity, and how did it influence your thoughts or actions?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, which book or author has profoundly impacted your perspective, and how do you see exploring language and ideas shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favourite books or philosophical debates, how do you see exploring language, ethics, or reality shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share a moment when exploring complex ideas or analyzing literature sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the meaning of a text or questioning life's big ideas truly captivated you, and how did that feel?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share a moment when reading a novel or discussing an abstract idea sparked your curiosity, and how did it shape your thoughts about your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea helped you better understand yourself or the world around you?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favourite books or thought-provoking discussions, how do you see exploring language and critical thinking shaping your personal growth or career?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and critical thinking shaping your future pursuits or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel's themes or pondering life's big questions, and how might exploring these interests shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and ideas shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or philosophical debates, how do you see exploring language, ethics, or human experience shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or poem, and then pondered the deeper meaning of life - how might exploring such connections enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a philosophical concept or analyzing a literary work sparked your curiosity, and how did it impact you?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you see exploring the intricacies of language and fundamental questions about existence shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you think exploring the nuances of language and ethical dilemmas will shape your personal growth or career?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how exploring complex ideas through literature has influenced your perspective, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel's themes or pondering life's big questions, and how might exploring such ideas shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or philosophical debates, how do you see exploring language, ethics, or logic shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language, meaning, and ideas shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and critical thinking shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or philosophical concept has influenced your perspective on life or society?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite book or philosophical debate, how do you see exploring language, ethics, or reality shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or philosophical debates, how do you see exploring the intersections of language and critical thinking shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and critical thinking shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where reading a thought-provoking novel or philosophical idea changed your perspective, and how might exploring such ideas shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or philosophical debates, how do you see exploring language and critical thinking shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and critical thinking shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language, ethics, or reality shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, what draws you to exploring complex ideas through literature, and how might this enrich your personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and philosophical ideas shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and fundamental questions shaping your future pursuits or personal outlook?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and ideas shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a thought-provoking idea or analyzing a complex text sparked your curiosity about the human experience?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflect on a moment when a literary work or philosophical idea challenged your perspective - how did this shape your curiosity about the human experience?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a thought-provoking book or idea inspired you to question assumptions, and how did that impact your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a thought-provoking novel or philosophical idea inspired you to question your assumptions or broadened your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives, and how did that impact you?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Have you ever analyzed a novel or debated an abstract concept that challenged your perspectives, and how did that experience shape your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language, ethics, or reality shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a thought-provoking novel or philosophical idea inspired you to question your own perspectives or societal norms?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you see exploring literary works and philosophical ideas enriching your perspective on life and informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you see exploring literary works and philosophical ideas shaping your perspective on life and future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you think exploring complex texts and philosophical ideas might shape your perspective or career path?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite book or philosophical idea, how do you see exploring language and critical thinking shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or philosophical debates, how do you see exploring language, ethics, or reality shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and critical thinking shaping your future pursuits or personal outlook?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language, meaning, and ideas shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel's themes or pondering life's big questions, and how might exploring these interests shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and critical thinking shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and critical thinking shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and philosophical ideas shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thinkers, how do you see exploring language and ideas shaping your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share a moment when exploring a thought-provoking book or idea challenged your perspectives, and how that experience shaped your curiosity about language and critical thinking?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your favorite books or thought-provoking discussions, how do you see exploring language and critical thinking shaping your future pursuits or personal outlook?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning behind a text or questioning fundamental assumptions sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or debating an abstract idea has influenced your perspective or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or argument helped you form a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or idea helped you develop a new perspective, and how do you think this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or idea deeply changed your perspective, and how might such critical thinking shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or philosophical idea challenged your perspective, and how did that shape your understanding of yourself or society?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a text or debating an idea helped you better understand yourself or others?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an abstract idea helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you discuss a time when analyzing a literary work or philosophical concept challenged your perspectives, and how did that shape your critical thinking?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when reading a thought-provoking novel or philosophical text challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or philosophical idea helped you better understand a real-world issue or personal challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you discuss how analyzing a novel's themes or a philosopher's argument has influenced your perspective on a real-world issue or personal belief?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective or decision-making in a real-life situation?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective or decision-making in a personal or academic?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of a novel or philosophical idea that challenged your worldview, and how you critically engaged with it?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or philosophical concept has influenced your perspective on a real-world issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective or decision-making in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you discuss a time when analyzing a literary text or philosophical concept challenged your perspectives, and how did that shape your critical thinking skills?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a text or idea deeply impacted your perspective, and how might such analytical skills shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary text or philosophical idea helped you better understand a real-world issue or your own perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or philosophical idea helped you develop a deeper understanding of human behavior or societal norms?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or philosophical idea helped you develop a deeper understanding of yourself or the world?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or philosophical idea challenged your perspective, and how did that shape your understanding of yourself or society?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a complex text or idea helped you better understand a personal belief or societal issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or philosophical idea challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective or decision-making in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective or decision-making in a real-life situation?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or idea deeply impacted your perspective, and how might such critical thinking shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of a time when analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of a book or idea that challenged your perspective, and how you critically engaged with it to form your own insights?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a text or idea challenged your perspective, and how did that shape your understanding of yourself or the world?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective or decision-making in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debate significantly influenced your perspective, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of a book or idea that profoundly challenged your perspective, and how did engaging with it shape your critical thinking skills?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or debating an abstract idea has influenced your perspective or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective or decision-making in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary text or philosophical idea has influenced your perspective on a real-world issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective or decision-making in a personal or academic?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or idea helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you discuss how analyzing a novel's themes or a philosopher's argument has influenced your perspective on life or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective on a real-world issue or personal belief?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or idea has helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you discuss a moment when analyzing a literary text or philosophical idea challenged your perspective, and how did that shape your critical thinking?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or idea helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a complex text or idea challenged your perspective, and how did that shape your understanding of yourself or the world?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective on life?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or idea challenged your perspective, and how did that shape your critical thinking or communication skills?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you discuss a time when analyzing a complex text or debate significantly shifted your perspective, and how did that impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective or decision-making in a personal or academic?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you discuss a time when analyzing a complex text or idea challenged your perspectives, and how did that shape your critical thinking skills?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or idea helped you develop a new perspective, and how did that impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a complex text or argument helped you form a new perspective, and how did that impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective or decision-making in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you discuss a time when analyzing a complex text or idea challenged your perspectives, and how did that shape your critical thinking skills?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debate helped you develop a deeper understanding of yourself or the world around you?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a complex text or argument helped you develop a deeper understanding of yourself or the world?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of a time when analyzing a complex text or philosophical idea helped you better understand a real-world issue or personal challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or philosophical text challenged your perspective, and how did that influence your thoughts or actions?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or philosophical idea challenged your perspectives, and how did that shape your thoughts or actions?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of a book or idea that challenged your worldview, and how analyzing its language or logic impacted your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an abstract idea helped you develop a new perspective, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or philosophical idea challenged your perspectives, and how did that shape your critical thinking skills?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective or decision-making in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an abstract idea helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or philosophical idea has influenced your perspective on a real-world issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or philosophical text challenged your worldview, and how did that shape your critical thinking skills?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective or decision-making in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or philosophical idea has influenced your perspective or decision-making in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or idea helped you form a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a complex text or debating an abstract idea helped you develop a new perspective, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or philosophical concept helped you navigate a real-life dilemma or shape your personal beliefs?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of a time when analyzing a complex text or philosophical idea helped you better understand a real-world issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea challenged your assumptions and reshaped your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or questioning fundamental beliefs inspired a new perspective in you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a philosophical concept or analyzing a literary work helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading or writing experiences, how have they shaped your perspectives, and how might exploring deeper philosophical questions enrich your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or questioning assumptions helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or questioning fundamental beliefs sparked your curiosity and shaped your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical concept challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives or influenced your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a complex idea or text helped you develop a new perspective, and how might this shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective, shaping your goals or values?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an abstract idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a thought-provoking idea or analyzing a complex text helped shape your perspective or sparked personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand different perspectives or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea challenged your perspectives, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a complex text or idea challenged your perspectives, and how did that shape your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives or inspired personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or philosophical idea challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or questioning assumptions helped you grow or sparked a new perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a thought-provoking text or abstract idea challenged your perspectives, and how did that shape your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or questioning a widely accepted idea sparked your curiosity or changed your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a thought-provoking book, film, or discussion challenged your perspectives and influenced your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea challenged your perspectives, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or philosophical concept helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a thought-provoking text or idea challenged your perspectives, and how did that shape your views on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives or inspired personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea helped you better understand yourself or others?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a thought-provoking text or idea challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a philosophical concept or analyzing a literary work helped you better understand yourself or others?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea challenged your perspectives, and how did that shape your thoughts?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Reflecting on your reading or writing experiences, how have you explored complex ideas or moral dilemmas that challenged your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or philosophical concept helped you better understand a personal or societal issue?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a complex idea or text challenged your perspectives, and how did that shape your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or questioning fundamental assumptions sparked your curiosity or challenged your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a complex text or debating an abstract idea has influenced your perspective or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or debating an abstract idea significantly impacted your perspective or communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or philosophical concept has influenced your perspective on life or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a philosophical concept or analyzing a literary work helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a philosophical concept or analyzing a literary work helped you better understand yourself or the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how exploring literary themes or philosophical ideas has influenced your perspective on life or shaped your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a complex idea or text challenged your perspectives, and how did that shape your understanding of yourself or the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a philosophical concept or analyzing a literary work helped you better understand yourself or others?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an abstract idea helped you develop new perspectives or challenge your own assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when reading a thought-provoking novel or discussing abstract ideas helped you navigate real-life challenges or shaped your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an abstract idea helped you develop a new perspective or skill?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand different perspectives or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea helped you navigate a personal challenge or shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a thought-provoking novel or philosophical idea inspired you to challenge your own beliefs or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a complex idea or text challenged your perspectives, and how did that shape your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or philosophical idea challenged your perspective, and how did that impact your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a thought-provoking book, film, or idea challenged your perspectives and sparked meaningful discussions with others?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a complex idea or text helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or philosophical idea challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea helped you navigate a real-life challenge or sparked personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a philosophical idea or analyzing a literary work challenged your perspectives or sparked personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea challenged your perspectives, and how did that shape your thoughts?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an abstract idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives, and how did that shape your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea significantly impacted your perspective or sparked personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or philosophical idea challenged your perspectives, and how did that shape your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a text or debating an idea helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or philosophical text challenged your worldview, and how you responded to that challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or philosophical concept has influenced your perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English and Philosophy",
    "school": "NTU",
    "question": "Can you share an experience where exploring the meaning of a text or idea challenged your assumptions and shaped your perspective?",
    "criterion": "Experiences"
  }
]