[
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy that sparked your curiosity, and how might such experiences shape your future professional pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a situation where you uncovered a hidden discrepancy or solved a puzzling problem - what sparked your curiosity in that moment?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy that sparked your curiosity, and how do you think investigating financial puzzles could shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a hidden pattern or solved a mystery that sparked your curiosity, and how might this drive your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy in numbers or solved a puzzling financial mystery that sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected and solved, and can you see yourself contributing to this effort in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud, and if so, what motivated you to learn more about uncovering such deceit?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you uncovered a discrepancy or solved a puzzle, and how it sparked your curiosity in analytical problem-solving?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy in personal finances or observed a situation where financial transparency was crucial, sparking your curiosity to dig deeper?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you uncovered a discrepancy or solved a puzzle, and how it sparked your curiosity in pursuing a career in investigative finance?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by solving puzzles or uncovering hidden information, and how might such skills be valuable in a career?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by solving puzzles or uncovering hidden information, and how might such skills be valuable in a career?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Imagine discovering a financial discrepancy in a company - what aspects of uncovering the truth or preventing fraud excite or intrigue you about this scenario?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Imagine discovering a financial discrepancy in a company - what aspects of uncovering the truth and ensuring accountability excite or intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected, and can you see yourself contributing to solving such puzzles in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story of financial fraud and imagined how you would uncover the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial scandals and thought about how you'd uncover the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you uncovered a hidden problem or inconsistency, and how did that spark your curiosity about investigating financial matters?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy in personal finances or observed a situation where financial transparency was crucial - what drew your curiosity in such moments?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a hidden detail or solved a puzzle, and how did that experience spark your curiosity about financial systems?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud and imagined yourself helping to uncover the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud and wondered how you could help uncover such crimes in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected, and can you see yourself contributing to solving such puzzles in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud, and if so, what sparked your curiosity about uncovering the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Imagine discovering a financial discrepancy in a company - what sparks your curiosity to investigate and uncover the truth behind the numbers?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are uncovered, and can you see yourself contributing to solving such puzzles in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected, and can you see yourself contributing to justice through financial analysis in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by news of financial scandals and thought about how you'd help uncover the truth or prevent such crimes?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by news of financial scandals and thought about how you'd uncover the truth behind them?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy in numbers or been curious about how financial crimes are detected and prevented in the digital age?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a hidden pattern or solved a puzzling problem, and if so, how did that experience spark your curiosity about financial discrepancies?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time you uncovered a hidden pattern or solved a puzzle, and how did that experience spark your curiosity in investigating financial discrepancies?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud, and if so, what motivated you to learn more about uncovering such deceit?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud and thought about how you'd help uncover the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you uncovered a hidden detail or solved a mystery, and how did that spark your curiosity about financial systems?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected and prevented, and can you see yourself contributing to this effort in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by solving puzzles or uncovering hidden information, and how might this curiosity shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a situation where you uncovered a hidden discrepancy or solved a puzzling problem, and how it sparked your curiosity about financial investigations?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a hidden detail or solved a puzzling problem - how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by solving puzzles or uncovering hidden information, and how might such skills be valuable in a career?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Imagine discovering a discrepancy in a company's accounts - what excites you about tracing the issue to its root cause?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected, and can you see yourself contributing to justice in the financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a situation where you uncovered a hidden discrepancy or solved a puzzling problem, and how it sparked your curiosity in analytical pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected and solved, and could you see yourself contributing to such investigations in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story of financial fraud and thought about how you'd uncover the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy that sparked your curiosity, and how do you think investigating financial puzzles could shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud and imagined how you could help uncover the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud? What motivates you to uncover the truth behind such cases?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you uncovered a hidden detail or solved a puzzle - how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by solving puzzles or uncovering hidden information, and how might this curiosity drive your future professional pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by solving puzzles or uncovering hidden information, and how might such skills impact your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story of financial fraud and thought about how you would uncover the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected, and can you see yourself contributing to justice through financial analysis?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud and imagined how you'd help uncover the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a situation where you've been curious about uncovering hidden information, and how you think this skill might benefit your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud and imagined yourself helping to uncover the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a hidden detail or solved a mystery that sparked your curiosity about the financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are uncovered, and can you see yourself playing a role in solving such puzzles?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy or solved a puzzling problem, and how did that experience spark your curiosity in tracing financial clues?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy in numbers or been curious about how financial crimes are detected and prevented in the digital age?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a hidden problem or inconsistency, and how did that experience spark your curiosity about investigative work?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud and imagined how you'd help uncover the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a hidden detail or solved a puzzling problem, and how it sparked your curiosity about financial investigations?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected and investigated, and can you see yourself contributing to such efforts in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a discrepancy or solved a puzzle, and how did that experience spark your curiosity in analytical problem-solving?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a hidden pattern or solved a puzzling problem, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a hidden discrepancy or solved a puzzling problem, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Imagine uncovering a hidden financial crime - what sparks your curiosity about tracing money trails or detecting fraud in a business setting?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Imagine uncovering hidden financial crimes - what excites you about using analytical skills to solve puzzles and bring justice to victims?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by solving puzzles or uncovering hidden information, and how might such skills impact your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you uncovered a hidden problem or inconsistency, and how it sparked your curiosity about investigating financial discrepancies?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected and prevented, and can you see yourself contributing to this effort in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you uncovered a hidden problem or inconsistency, and how did that spark your curiosity in solving financial puzzles?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a discrepancy or solved a puzzle that sparked your curiosity about how financial systems can be vulnerable?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected, and can you see yourself contributing to solving such puzzles in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by solving puzzles or uncovering hidden truths, and how might such skills be valuable in a career?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial scandals and thought about how you'd uncover the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a hidden pattern or solved a puzzling problem, and how did that experience spark your curiosity about financial discrepancies?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time you uncovered a hidden detail or solved a mystery, and how did that experience spark your curiosity about financial discrepancies?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a hidden discrepancy or solved a puzzling problem, and how did that experience spark your curiosity in analytical pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a hidden detail or solved a puzzle that sparked your curiosity about how financial systems can be vulnerable?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud and thought about how you'd help uncover the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by solving puzzles or uncovering hidden truths, and how might this curiosity drive your career aspirations in analyzing complex financial data?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a situation where you've uncovered a hidden problem or inconsistency, and how it sparked your curiosity about tracing and resolving financial puzzles?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a situation where you had to uncover a hidden truth or solve a puzzling problem, and what sparked your curiosity in that moment?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are uncovered, and could you see yourself helping businesses or authorities solve such puzzles in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud and imagined yourself investigating such cases in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you uncovered a hidden detail or solved a mystery - how did that spark your curiosity in pursuing analytical challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a hidden pattern or solved a puzzle, and how did that experience spark your curiosity about financial systems?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected, and can you see yourself contributing to uncovering such issues in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud and thought about how you'd help uncover the truth?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected, and can you see yourself contributing to solving such puzzles in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you uncovered a hidden problem or inconsistency, and how did that spark your curiosity about investigating financial matters?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected and prevented, and can you see yourself contributing to this effort in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected and solved, and can you see yourself contributing to this effort in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by how financial crimes are detected and prevented, and can you see yourself contributing to this effort in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a hidden pattern or solved a puzzle that sparked your curiosity, and how might such skills be valuable in a career?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by solving puzzles or uncovering hidden truths, and how might such skills be valuable in a career?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever been intrigued by a news story about financial fraud, and if so, what motivated you to learn more about how such crimes are uncovered?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you uncovered a hidden issue or solved a puzzle, and how did that spark your curiosity in analytical problem-solving?",
    "criterion": "Interests"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a confusing puzzle or uncover hidden information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you uncovered a discrepancy or solved a puzzle - how did you approach it and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to uncover a hidden pattern or inconsistency in a complex set of data?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you uncovered a discrepancy or solved a puzzling problem - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle or solve a mystery - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to carefully analyze a complex puzzle or mystery - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did that experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you uncovered a discrepancy or solved a puzzling problem - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through how you'd investigate a suspicious transaction in a friend's bank statement, highlighting your analytical and problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through how you'd investigate a suspicious transaction in a school fundraising event, highlighting your analytical and problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to carefully analyze a complex situation to uncover a hidden truth?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you had to piece together a confusing puzzle or mystery, and how your analytical skills helped you find a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you noticed a discrepancy in numbers, and how you would investigate it to uncover the truth?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through how you'd investigate a suspicious transaction in a friend's small business, highlighting your analytical and problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a confusing puzzle or mystery - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together incomplete information to solve a puzzle or mystery?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze a complex puzzle or mystery - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you uncovered a discrepancy or solved a mystery, and how did you methodically piece together the puzzle?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through how you'd investigate a suspicious transaction in your school's canteen fund, highlighting your analytical and problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to meticulously analyze a complex problem; how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to analyze confusing information? How did you uncover the truth, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to investigate a discrepancy or solve a puzzle - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time you noticed a discrepancy in numbers and how you would go about investigating it to uncover the truth?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to carefully analyze a complex problem to uncover a hidden truth?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you've uncovered a discrepancy or solved a puzzle? How did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze complex information to uncover a hidden issue - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a confusing puzzle or discrepancy, and how did you resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to piece together incomplete information to solve a puzzle or mystery, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you had to piece together a confusing financial situation, like managing a school event budget?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through how you'd investigate a suspicious transaction in a school fundraiser, and what skills do you think are essential for such a?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did that experience shape your analytical approach?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a confusing puzzle or mystery - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to carefully analyze a complex problem with unclear information, and how did you uncover the truth?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze a complex puzzle or mystery - how did you approach uncovering the truth?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through how you'd investigate a suspicious transaction in your school's fundraising account, highlighting your analytical approach?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together incomplete information to uncover a hidden issue - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to uncover a hidden problem or inconsistency, and how your analytical skills helped you find the solution?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you had to piece together a puzzle or solve a mystery - how did your analytical skills help you crack it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you uncovered a discrepancy or solved a mystery - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to uncover a hidden pattern or inconsistency in data, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to carefully analyze a complex situation to uncover a hidden truth?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to carefully analyze a confusing situation to uncover the truth, and what skills did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you noticed a discrepancy in numbers or data - how did you investigate and resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you noticed a small inconsistency in numbers or data, and how you investigated it further?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did that process spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through how you'd investigate a suspicious transaction in your school's fund, highlighting your analytical and problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle or uncover a hidden issue - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with missing information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time you analyzed a complex puzzle or mystery, and how your problem-solving approach might apply to uncovering hidden financial discrepancies?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through how you'd investigate a suspicious transaction in your school's fundraising account, highlighting your analytical and problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to carefully analyze a complex situation to uncover a hidden truth?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through how you'd investigate a suspicious transaction in a school fundraiser, and what skills do you think are essential for uncovering the truth?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to carefully analyze a complex situation to uncover a hidden truth, and what skills did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together incomplete information to uncover a hidden issue or solve a puzzle?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to carefully analyze details to uncover a hidden issue - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you identified and resolved a discrepancy in personal finances or a group project budget?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle or solve a mystery - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with missing information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with missing information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you noticed a discrepancy in numbers or a suspicious situation - how did you investigate and resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through how you'd investigate a suspicious transaction in your school's fundraising account, highlighting your analytical and problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with missing information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze a complex puzzle or mystery, and how your attention to detail helped you uncover the truth?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to meticulously analyze a complex situation to uncover a hidden truth, and what skills did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you noticed a discrepancy in numbers or information, and how you investigated or resolved it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you uncovered a discrepancy or solved a puzzle - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with limited information, and how did that experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to investigate a discrepancy or solve a puzzle? How did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with missing information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through how you would investigate a suspicious transaction in a school fundraiser, and what skills do you think are essential for uncovering the truth?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to carefully analyze a complex situation to uncover a hidden truth?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a confusing puzzle or mystery - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through how you'd investigate a suspicious transaction in a school's fundraising event, highlighting your analytical and problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to carefully analyze details to uncover a hidden issue - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you identified and resolved a discrepancy, and how did that experience spark your interest in analytical problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to piece together incomplete information to uncover a hidden issue, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time you uncovered a discrepancy or solved a mystery - how did you approach it and what skills did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you had to piece together a puzzle with limited information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time you noticed a discrepancy in numbers or a confusing financial situation, and how you went about investigating it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you uncovered a discrepancy or solved a puzzling problem - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you uncovered a discrepancy or solved a puzzling problem - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time you uncovered a discrepancy or solved a puzzle, and how did that experience spark your curiosity in analytical problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to piece together a puzzle with missing information, and how did you ensure accuracy in your findings?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you noticed a discrepancy in numbers or a potential fraud, and how you would investigate it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to carefully analyze details to uncover a hidden issue - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing money issue or spotted an error in a financial record - how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you uncovered a discrepancy or solved a puzzle, and how it sparked your curiosity in analytical problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to analyze complex information to uncover a hidden issue or solve a puzzling problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to investigate or resolve a puzzling financial issue, and what skills did you use to uncover the truth?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a discrepancy or solved a puzzle, and how did that experience spark your curiosity in analytical problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to uncover a hidden truth or solve a mystery, and how did that shape your curiosity for analytical challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to uncover a hidden issue or solve a puzzling problem, and how did that process interest you?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing financial situation, and if so, how did you approach uncovering the truth?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you helped resolve a confusing financial issue or discrepancy, and what skills did you use to address it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to carefully analyze details to uncover a hidden issue or solve a puzzling problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing money issue or spotted an error in a financial document?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to carefully analyze details to uncover a hidden issue or solve a complex problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to analyze a complex situation, identify discrepancies, and piece together a clear story from incomplete information?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to piece together a puzzle or uncover a hidden issue, and how did that process spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to investigate or resolve a puzzling financial discrepancy, and what skills did you use to uncover the truth?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to carefully analyze details to uncover a hidden issue or solve a puzzling problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to carefully analyze details to uncover a hidden issue or solve a puzzling problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing financial situation or uncovered a hidden discrepancy - how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed a complex problem, identified discrepancies, or uncovered hidden information, and how did that impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing financial situation or spotted an inconsistency in numbers, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing money issue, and how did you approach uncovering the truth?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you uncovered a discrepancy or solved a puzzle, and how it sparked your interest in analytical problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you uncovered a discrepancy or solved a puzzle, and how it sparked your interest in analyzing complex financial situations?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a mystery or uncovered a hidden issue, and how did that experience spark your curiosity about finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to investigate or resolve a puzzling financial discrepancy, and what skills did you use to uncover the truth?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to analyze confusing information, like a mystery or puzzle, and how you uncovered the truth?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to analyze or resolve a complex financial puzzle, and what skills did you use to uncover the solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to carefully analyze details to uncover a hidden issue, and how did that experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to uncover a hidden pattern or discrepancy in numbers, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a discrepancy or solved a puzzle, and how did that experience spark your curiosity in analytical problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to piece together a puzzle or solve a mystery, and how did that process spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing financial situation or spotted an inconsistency in numbers, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to carefully analyze details to uncover a hidden issue or solve a puzzling problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to carefully analyze details to uncover a hidden issue or solve a puzzling problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a mystery or uncovered a hidden issue, and how did that experience spark your curiosity about finance or investigation?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to investigate or resolve a discrepancy, and how did that spark your interest in analytical problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to uncover hidden information or solve a mystery, and how did that experience spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to analyze a complex puzzle or discrepancy, and how did you approach resolving it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing financial situation or discrepancy, and how did you approach finding a solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing financial situation or caught an error in a budget, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a puzzling discrepancy, such as a missing item or unexplained expense - how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you uncovered a discrepancy or solved a puzzle, and how it sparked your interest in pursuing a career in investigative finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a discrepancy or solved a puzzle, and how it sparked your interest in analyzing complex financial situations?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to carefully examine details to uncover a hidden issue or solve a mystery?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a mystery or discrepancy, such as uncovering errors in a school project budget or personal finances?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to carefully analyze details to uncover a hidden issue or solve a puzzling problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to carefully analyze details to uncover a hidden issue or solve a puzzling problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to investigate or resolve a mystery involving money, and what skills did you use to uncover the truth?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy or solved a puzzling problem in a financial?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to analyze complex information to uncover a hidden issue, and how did that process spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy in a personal budget or school project that sparked your curiosity to dig deeper into the numbers?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed a complex puzzle or mystery, and how you uncovered the solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to carefully examine details to uncover a hidden issue or solve a puzzling problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to uncover a hidden mistake or solve a puzzling problem, and how did that experience shape your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing money issue or spotted an error in a budget, and how did that experience spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to analyze confusing financial information, and how did you make sense of it to inform a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to investigate or resolve a mystery related to money or resources, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to investigate or resolve a complex puzzle or discrepancy, and what skills did you use?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy in personal finances or observed unethical financial behavior? How did you address or learn from the situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you helped resolve a confusing financial issue or discrepancy, and what skills did you use to address it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy or solved a puzzle in a financial?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to analyze a complex problem, like uncovering inconsistencies in a school project or personal budget, and how you approached it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to investigate or solve a mystery, and how did that process spark your curiosity about financial systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to analyze complex information to uncover a hidden issue or solve a puzzling problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a discrepancy or solved a puzzle, and how did that experience spark your curiosity in analytical problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a mystery or discrepancy, such as uncovering a hidden error in a school project budget?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy or solved a puzzling problem, and how did that experience spark your interest in pursuing a career in investigative finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to uncover a hidden problem or discrepancy, and how you went about resolving it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to analyze a complex situation, identify discrepancies, and piece together a clear explanation?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a discrepancy or solved a puzzle, and how did that experience spark your curiosity in analytical problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to carefully analyze details to uncover a hidden issue, and how did that process spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy in a personal project or school assignment that led you to investigate further, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to investigate or resolve a complex puzzle or discrepancy, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing financial situation or caught an error in a budget, and how did that experience spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a financial discrepancy or helped resolve a puzzling money-related issue - how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to investigate or resolve a discrepancy, and how did that experience spark your interest in analytical problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to investigate or resolve a complex puzzle or discrepancy, and what skills did you use?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever uncovered a discrepancy in a personal budget or school project that sparked your curiosity to investigate further?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing financial situation or discrepancy, and how did you approach uncovering the truth?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to piece together a puzzle or uncover hidden information, and how did that process intrigue or challenge you?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing financial situation, and how did you approach uncovering the truth in that scenario?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing money issue or spotted an error in financial records? How did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a discrepancy or solved a puzzle that involved analyzing numbers or financial data?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you uncovered a discrepancy or solved a puzzling problem, and how did that experience spark your curiosity in analytical work?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to carefully examine details to uncover a hidden issue or solve a puzzling problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to analyze a complex puzzle or mystery, and how did you approach solving it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to investigate or resolve a discrepancy, and how did that spark your interest in analytical problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to analyze a complex situation, identify hidden patterns, or uncover discrepancies that others might have missed?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing financial situation or spotted an inconsistency in numbers that others missed?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing money issue or spotted an error in a budget - how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing financial situation or spotted an inconsistency in numbers, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to investigate or resolve a discrepancy, and how did that shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing money issue, and how did that experience spark your interest in uncovering financial truths?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to uncover a hidden pattern or solve a puzzling problem, and how did that experience spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing financial situation or noticed discrepancies in personal or school finances that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing money issue, like a missing payment or unclear transaction, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you describe a time when you had to investigate or resolve a puzzling financial discrepancy, and what skills did you use to uncover the truth?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to carefully analyze details to uncover a hidden issue or solve a puzzling problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Have you ever helped resolve a confusing money issue or spotted a discrepancy in a budget or transaction - how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Financial Forensics",
    "school": "SMU",
    "question": "Can you share an experience where you had to investigate or resolve a discrepancy, and how did that shape your problem-solving approach?",
    "criterion": "Experiences"
  }
]