[
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you felt connected to a global issue, and how did that spark your curiosity about its broader implications?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about global issues, and how do you see yourself contributing to these discussions in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue or culture that sparked your curiosity, and how you think it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a global issue that fascinates you and how exploring its cultural, political, or economic dimensions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example from your life where understanding different cultures or global issues sparked your curiosity, and how you explored it further?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about global issues, and how do you see yourself contributing to addressing them in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global challenges, and how you think exploring these issues could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of a global issue that fascinates you, and how you think studying it could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue or culture that sparked your curiosity, and how you think it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global cultures, economies, or politics, and how exploring these further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global connections, and how might exploring these themes shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue or culture that sparked your curiosity, and how do you see this shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global challenges, and how exploring these might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global connections, and how might exploring these further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of a global issue that fascinates you, and how you think studying it in-depth could shape your future career or worldview?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global challenges, and how exploring these might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about global issues, and how do you see exploring these interests shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share a global issue that sparks your curiosity, and how exploring its complexities might shape your future goals or worldview?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global cultures, economies, or politics, and how you think exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Reflecting on current global challenges, what motivates you to explore their interconnectedness and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about global issues, and how do you see exploring these themes shaping your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global connections, and how exploring this further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global cultures, economies, or politics, and how you explored it further?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it sparked your curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you felt a strong connection to a global issue, and how it sparked your curiosity about its broader implications?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about global issues, and how do you see yourself contributing to a more interconnected world?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global challenges, and how you think exploring these issues could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global cultures, economies, or politics, and how exploring it further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Reflecting on global challenges that intrigue you, how do you envision your future self contributing to or navigating a more interconnected world?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global cultures, economies, or environments, and how exploring this further might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of a global issue that fascinates you, and how you think understanding its cultural and historical contexts could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Reflecting on your experiences, how do you think understanding global issues and diverse cultures will shape your future goals and personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a global issue that fascinates you and how exploring its complexities might shape your future career or personal perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about different cultures or global issues sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about different cultures or global issues sparked your curiosity, and how might exploring these further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a global issue that sparks your curiosity and explain how exploring its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example from your life or current events that sparked your curiosity about global connections, and how might exploring these connections shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a global issue that fascinates you and how exploring its complexities might shape your future aspirations or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Imagine working on a global challenge - what aspect of international cultures, economies, or environments would you find most compelling to explore and why?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global cultures, economies, or societies, and how you think exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue, and how it shaped your curiosity about different cultures or societies?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global cultures or international challenges, and how exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of a global issue that sparks your curiosity, and how you think studying it could shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Have you ever found yourself curious about how global issues, like climate change or social inequality, impact everyday lives, and how you could contribute to solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global connections, and how exploring it further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a global issue that fascinates you and how exploring its cultural, political, or economic dimensions could shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about global issues, and how do you see yourself contributing to positive change worldwide?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Imagine working on a global issue that sparks your curiosity - what kind of challenge would it be, and how do you see yourself contributing to positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global challenges, and how you think studying these issues could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of a global issue that sparks your curiosity, and how exploring it might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global challenges, and how exploring these might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example from your life where understanding different cultures or global issues sparked your curiosity, and how did you explore it further?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about different cultures or global issues sparked your curiosity, and how you think exploring these further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about different cultures or global issues sparked your curiosity, and how you think exploring these further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global cultures, economies, or environments, and how exploring it further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue, and how did it shape your desire to understand diverse cultures and societies?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example from your life where understanding different cultures or global issues sparked your curiosity, and how you explored it further?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of a global issue that fascinates you, and how you think understanding it could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global challenges, and how you see yourself contributing to solutions in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share a global issue that sparks your curiosity, and how understanding its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of a global issue that fascinates you, and how exploring its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Reflecting on global challenges like climate change or social inequality, what motivates you to explore their interconnectedness in your future studies or career?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you felt connected to a global issue, and how did that spark your curiosity about its broader implications?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global challenges, and how you think exploring these issues could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global challenges, and how you see yourself contributing to solutions in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about how global connections shape societies, and why exploring this further excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global cultures, economies, or environments, and how exploring these further might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a different culture or global issue - how did it shape your worldview or spark curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of a global issue that sparks your curiosity, and how you'd like to contribute to addressing it in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue that sparked your curiosity, and how did it shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue, and how did that spark your curiosity about its broader impact on societies?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a different culture or global issue - how did it shape your curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about different cultures or global issues sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global connections, and how might exploring these themes shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of a global issue that fascinates you, and how exploring its complexities might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you felt a connection to a global issue, and how did that shape your aspirations for the future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue that sparked your curiosity, and how do you see yourself contributing to its solution?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about how global events or cultural differences shape our interconnected world?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue that sparked your curiosity, and how do you see yourself contributing to its solution?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored different cultures or global issues, and how did that spark your curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a global issue that sparks your curiosity, and how understanding its complexities might shape your future goals or worldview?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global challenges, and how do you see yourself contributing to solutions worldwide?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue or culture, and how it sparked your curiosity about its broader implications?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue or culture, and how it sparked your curiosity about its broader implications?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue or culture that sparked your curiosity, and how might this shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue or culture, and how it sparked your curiosity about its broader impact?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about how global connections impact local communities, and why does this fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global cultures, economies, or politics, and how exploring it further might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a global issue that sparked your curiosity, and how do you see yourself contributing to its solution?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by how global events impact local communities, and can you share an example that sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Reflecting on your own experiences, how do you think understanding global issues and diverse cultures could shape your future goals or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Reflecting on your experiences, what global issues or cultural encounters have sparked your curiosity, and how do you see yourself contributing to a more interconnected world?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Reflecting on your own experiences, how do you think understanding diverse cultures and global issues could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of a global issue that sparks your curiosity, and how you think understanding its complexities could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you felt a connection to a global issue, and how did it spark your curiosity about its broader implications?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of a global issue that fascinates you, and how you think studying it could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about different cultures or global issues sparked your curiosity, and how you think exploring these further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global connections, and how might exploring these interests shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Imagine you're a global citizen: what aspects of international cultures, economies, or societies most intrigue you to explore and why?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about global connections, and how do you see exploring these connections shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your worldview?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective or skills?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will impact your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of how you've navigated a cultural difference or global issue in your life, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of how you've navigated a cultural difference or global issue, and what skills did you develop through that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will serve you in addressing global challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will shape your approach to global challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective or actions?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue that sparked your curiosity, and how did you engage with it?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective or skills?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example from your life where you navigated a cultural difference, and how did that experience shape your worldview?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural misunderstanding, and how do you think this skill will serve you in a globally interconnected future?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue - how did this shape your perspective on interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective or skills?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of how you've navigated a cultural misunderstanding, and what skills did you use to resolve it effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective on interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective on interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated cultural differences, and how do you think such experiences shape your approach to understanding global challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of how you've navigated a cultural difference or global issue in your community, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example from your life where you navigated cultural differences, and how did that experience shape your worldview?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your perspective on global interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences or worked with someone from a diverse background, and what skills did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue that sparked your curiosity, and how did you engage with it?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural misunderstanding, and how did that experience shape your approach to global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example from your experiences where understanding diverse cultural perspectives helped you navigate a challenging situation?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future in an interconnected world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated cultural differences, and how do you think such experiences shape your approach to global challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective on interconnected societies?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of how you've navigated cultural differences in your life, and how might this skill help you address global challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will impact your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how do you think such experiences shape your approach to understanding global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated a cultural difference or global issue - how did you adapt, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how do you think this skill will serve you in addressing global challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will serve you in addressing global challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated cultural differences or global issues, and how did that experience shape your perspective on interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your perspective on global issues or cooperation?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will benefit your future pursuits in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your perspective on global issues or collaborations?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time you navigated cultural differences, and how do you think such experiences shape your approach to understanding global challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future pursuits in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did this shape your perspective on global issues or collaborations?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills might shape your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences or worked with someone from a vastly different background, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated cultural differences, and how do you think that skill will serve your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of how you've navigated a cultural difference or global issue in your life, and what skills did you develop from it?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective or skills?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did this shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of how you've navigated a cultural difference or global issue, and what skills did you use to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did this shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of how you've navigated a cultural difference or global issue, and what skills did you use to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will shape your future in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will aid your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how do you think such experiences shape your approach to global challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global issues or your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your perspective on global interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated a cultural difference or global issue, and how did that experience shape your perspective or skills?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of how you've navigated cultural differences in your life, and how that experience shaped your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective or skills?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global issues or collaborations?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a cultural difference or global issue, and how did it shape your perspective on interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a cultural difference or global issue, and how did it shape your perspective on interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective or actions?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a cultural difference or global issue, and how did it shape your perspective on interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated cultural differences, and how did that experience shape your perspective on global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a cultural difference or global issue, and how did that experience shape your perspective or skills?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an example of how you've navigated cultural differences in your life, and how you think this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you navigated cultural differences or global issues, and how did that experience shape your perspective or skills?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a cultural difference or global issue, and how did it shape your perspective on interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it shaped your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it shaped your views on global issues or interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences or global issues, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures, and how did it shape your views on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences or global issues, and how it shaped your worldview or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a time when you engaged with diverse cultures or global issues, and how did this shape your perspectives or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your worldview or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did it shape your views on global issues or interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures, and how did that shape your perspective on global issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture or global issue - how did it shape your worldview or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did it shape your perspective on global issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it shaped your views on global connections or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it shaped your views on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it broadened your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures, and how did that shape your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did it shape your perspective on global issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences or global issues, and how did it shape your perspective on interconnected societies?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it shaped your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences or global issues, and how it shaped your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you engaged with a culture or community different from your own, and how it shaped your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture or global issue, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures, and how did it shape your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures, and how did that shape your views on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did that shape your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did it shape your views on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you navigated a cultural difference or global issue that sparked your curiosity about its broader implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did that shape your perspective on global issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture or global issue, and how it shaped your perspective or sparked curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures, and how did it shape your perspective on global challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it shaped your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it shaped your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective or sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your worldview or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures, and how did it shape your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it shaped your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture or global issue - how did it shape your perspective or spark curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it shaped your views on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did it shape your perspective on global issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did that shape your views on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did it shape your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures, and how did it shape your perspective on global challenges or opportunities?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did it shape your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did that shape your views on global connections or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did that shape your views on global connections or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences or global issues, and how it shaped your perspective on interconnected societies?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures, and how did it shape your perspective on global issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on your future role in a globalized world?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did it shape your perspective on global issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it shaped your views on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective or sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture or global issue, and how it shaped your perspective or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it shaped your views on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures, and how did that shape your perspective on global issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture or global issue, and how it shaped your worldview or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture or global issue, and how it shaped your perspective or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures, and how did it shape your perspective on global challenges or opportunities?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did it shape your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did it shape your views on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your worldview or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it shaped your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture or global issue, and how it shaped your perspective or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your worldview or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did it shape your perspective on global issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how did it shape your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your worldview or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture, and how it shaped your perspective on global issues or your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture or global issue, and how it shaped your perspective or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with diverse cultures or global issues, and how it shaped your perspective on interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you describe a moment when exploring different cultures or global issues sparked your curiosity, and how you pursued that interest further?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a different culture or global issue - how did it shape your worldview or spark curiosity?",
    "criterion": "Experiences"
  }
]