[
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you see exploring historical events shaping your views on teaching and learning in the future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past has influenced your views on shaping the minds of future generations?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring historical events or teaching others sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past or teaching others sparked your curiosity, and how do you see this passion shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past learning experiences, how do you think studying the past can shape your future and influence the way you'd like to teach or share knowledge?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example from your past where exploring historical events or cultural heritage sparked your curiosity, and how might this shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about the past sparked your curiosity, and how you think it could shape your approach to teaching or mentoring others?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think exploring historical events and cultural narratives might shape your future approach to teaching or mentoring others?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past sparked your curiosity, and how might sharing such stories impact others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your own learning journey, what historical events or cultural stories have sparked your curiosity, and how might exploring these further enrich your future role as an educator?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past sparked your curiosity, and how might that passion influence your future interactions with others?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think studying the past could shape your approach to teaching and mentoring others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past learning experiences, what aspects of exploring the past or shaping young minds excite you about contributing to society in the future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your own learning journey, what aspects of exploring historical events or cultural heritage excite you, and how might sharing these stories shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning about the past has influenced your views on shaping future generations?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think understanding historical events can shape your approach to teaching or mentoring others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past sparked your curiosity, and how might that passion influence your future interactions with others?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of a historical event that sparked your curiosity, and how would you teach it to others in an engaging way?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that passion shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events or cultural heritage has sparked your curiosity, and how you think this passion could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think studying the past can shape your future role in inspiring or educating others?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that fascinates you, and how exploring such topics might shape your future or teaching approach?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past sparked your curiosity, and how do you think learning from history could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think exploring historical events and cultural heritage could shape your approach to teaching or mentoring others?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your own learning journey, how do you think studying the past could shape your approach to teaching and inspiring future generations?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think studying the past can shape your approach to teaching and mentoring future generations?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think exploring historical events and teaching methods can shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about the past influenced your perspective, and how might exploring history shape your approach to teaching others?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, what aspects of studying historical events or teaching others have sparked your curiosity, and how do you see this passion evolving?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think learning from history shapes our future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, what aspects of exploring historical events or teaching others excite you the most about shaping future generations?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning about the past has influenced your perspective on current events or shaped your approach to teaching others?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past or teaching others sparked your curiosity, and how might that shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past sparked your curiosity, and how do you see learning from history shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think exploring historical events and teaching methods might shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think exploring historical events and educational systems could shape your perspective and inform your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past learning experiences, what aspects of exploring historical events or teaching others excite you the most about shaping future minds?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past sparked your curiosity, and how might this shape your approach to inspiring future generations?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think exploring the past can shape your future, whether in teaching or beyond?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Have you ever found yourself drawn to understanding the past or imagining how historical events shape our present, and how could exploring these themes influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past sparked your curiosity, and how might that passion influence your future role in shaping young minds?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about the past sparked your curiosity, and how you think studying history could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, what aspects of learning about the past or teaching others have sparked your curiosity, and how might this passion shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events or cultural heritage has sparked your curiosity, and how you see this passion influencing your future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example from your studies or personal experiences that sparked your curiosity about the past, and how might exploring historical contexts shape your future interactions or teachings?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue, and how might this curiosity shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when learning about the past sparked your curiosity, and how do you see exploring history shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you see the study of historical events shaping your approach to teaching and learning in the future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your own learning journey, what aspects of exploring historical events or teaching methods excite you about shaping future generations?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, what aspects of exploring historical events or teaching others excite you, and how might they shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your own learning journey, what aspects of exploring the past or shaping future minds excite you about pursuing a field that combines historical inquiry with educational practice?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think studying the past could shape your future, whether in teaching or beyond?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past sparked your curiosity, and how might that drive your approach to shaping young minds?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Have you ever thought about how understanding the past could shape your approach to teaching and inspiring future generations?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example from your past where exploring historical events or teaching others sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think exploring historical events and teaching methods could shape your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think learning from history could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how might this shape your approach to teaching others?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past or teaching others sparked your curiosity, and how might this enthusiasm shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events or cultural heritage has sparked your curiosity, and how you see this passion influencing your future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think exploring historical events and teaching methods could shape your future aspirations or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you see the study of historical events shaping your approach to teaching and learning in the future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how might that shape your approach to teaching others?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example from your own life where exploring the past helped you understand a current issue or shaped your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your own learning journey, what aspects of exploring the past or teaching others excite you most about shaping future minds?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a present-day issue, and how might teaching others about it inspire future change?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding the past has influenced your perspective on teaching or learning in everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this passion shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think studying the past can shape your future, and what role do you see education playing in that journey?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that fascinates you, and how you think learning about the past could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see learning from history shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a present issue, and how might that shape your approach to teaching others?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that passion shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past learning experiences, what aspects of history or teaching methods would you like to explore further to shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Have you ever found yourself drawn to understanding the past or imagining how historical events shape our present, and how would exploring this influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite historical event, how do you think learning from the past could shape your approach to teaching or mentoring others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example from your past where exploring historical events or teaching others sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning about the past has influenced your perspective on current events or shaped your personal values?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example from your past where exploring historical events or cultural heritage sparked your curiosity, and how might such experiences shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think exploring historical events and teaching methods could shape your future goals or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of a historical event that sparked your curiosity, and how would you creatively teach it to others?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see learning from history shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era, how do you think learning from the past could shape your approach to teaching or mentoring others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you see exploring historical events shaping your perspectives, and how might sharing these insights inspire others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think exploring historical events has shaped your perspective on teaching and learning?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how might that shape your approach to teaching others?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about the past sparked your curiosity, and how you think it could shape your future interactions or career?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think understanding historical events and effective teaching methods could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when learning about the past sparked your curiosity, and how you envision sharing such 'aha' moments with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning from the past has influenced your perspective on current events or your own decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding historical events has influenced your perspective on current social issues or shaped your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this insight to others effectively?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding historical events has influenced your perspective on current social issues, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding the past has influenced your perspective on current events or your approach to learning from mistakes?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you share this insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding historical events has influenced your perspective on current educational challenges or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when learning about the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue, and how would you share this insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "How do you think studying the past can help you shape engaging lessons for students with diverse backgrounds and interests?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand current societal issues, and how would you share this insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding historical events has influenced your perspective on current educational systems or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where analyzing past events helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this insight to others effectively?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring historical events or cultural heritage sparked your curiosity, and how would you share that enthusiasm with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring historical events or cultural heritage sparked your curiosity, and how would you share that enthusiasm with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding historical events has influenced your perspective on current social issues or educational practices?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue, and how would you share this insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding past events has influenced your perspective on current social issues or your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when learning about the past influenced your perspective, and how would you share that insight with others effectively?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding historical events has influenced your perspective on current social issues, and how you'd apply this insight in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when understanding historical?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand current societal issues, and how would you apply this skill in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you share this insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding the past has influenced your perspective on current social issues or shaped your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you teach this insight to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example from your past where analyzing historical events helped you understand current societal issues, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when learning about the past influenced your perspective on current events, and how would you share this insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how might such insights shape your approach to teaching others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you share this insight with others effectively?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning from the past has influenced your perspective on current events or your own learning journey?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding historical events has influenced your perspective on current social or educational issues, and why?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you teach others about this connection?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach that insight to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding past events has influenced your perspective on current social issues, and how would you teach this to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding past events has influenced your perspective on current social issues, and how would you teach this to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events has influenced your perspective on current social issues or your own learning approach?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example from your own experiences where understanding the past helped you make better decisions or navigate a challenging situation?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning from the past has influenced your perspective on current events or shaped your approach to teaching others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this insight to others effectively?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example from your past where exploring historical events or cultural heritage sparked your curiosity, and how did that experience shape your views on teaching or mentoring others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned from the past, and how you would creatively teach that lesson to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding historical events has influenced your perspective on current societal issues, and how might you apply this insight in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events has influenced your perspective on current social issues or educational practices?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "How do you think understanding historical events has influenced your perspective on current social issues, and how might you apply this in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a present-day issue, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand current societal issues, and how might you apply this insight in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand current societal issues or inform your own decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example from your past where exploring historical events or cultural heritage sparked your curiosity, and how would you apply that experience to inspire others in the future?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "How do you think understanding historical events and cultural narratives can influence your approach to teaching and mentoring future generations?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "How do you think studying the past can shape your approach to teaching and inspiring future generations in a rapidly changing world?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "How do you think studying historical events can shape your approach to teaching and mentoring future generations?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach that connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you share this insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "How do you think studying the past can inform your approach to teaching and mentoring future generations effectively?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a present-day issue, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a present-day issue, and how would you teach others about this connection?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "How do you think studying historical events has influenced your perspective on current educational systems, and how might this shape your future role in education?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example from your past where exploring historical events helped you understand current societal issues, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring historical events helped you understand current societal issues, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how would you teach this lesson to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example from your experiences where analyzing the past helped you understand a current issue, and how would you teach this insight to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how understanding the past has influenced your perspective on a current issue, and how would you teach this connection to others?",
    "criterion": "Skills"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you shape your views on teaching or learning, and how might this influence your future?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past, how have your experiences with historical events or educational activities shaped your curiosity or skills that could impact your future?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you shape your views on teaching or mentoring others, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand current societal issues or informed your approach to teaching others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring historical events or cultural heritage sparked your curiosity, and how might such experiences shape your approach to teaching or mentoring others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past, can you share an experience where exploring the past or teaching others sparked your curiosity about shaping future minds?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how have you seen the value of understanding historical contexts in shaping your own learning or teaching moments?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand current societal issues or shape your perspective on teaching others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how do you see this shaping your future?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue, and how might such insights shape your future interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand current societal issues or shaped your views on teaching others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue or shaped your perspective on learning or teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand current societal issues or shape your perspective on learning and growth?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how do you see this shaping your future?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue or inspired a personal perspective shift?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past or teaching others sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how do you see this shaping your future?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand current societal issues or shaped your approach to learning or teaching others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how do you see this shaping your future?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how do you see this shaping your future?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand current societal issues or informed your approach to teaching or mentoring others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how did that shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how would you teach this lesson to others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how would you share that insight with others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue, and how would you teach this to others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events or cultural heritage has influenced your perspective on teaching or learning?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how do you see this shaping your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how do you see this shaping your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand current societal issues or shaped your perspective on teaching others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you shape your perspective on teaching or mentoring others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past or teaching others sparked your curiosity, and how did this shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past or teaching others sparked your curiosity, and how might that shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand current societal issues or shape your perspective on teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past or teaching others sparked your curiosity, and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand current events or shaped your perspective on teaching others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue, and how might such insights shape your future interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past, how have your experiences with learning or teaching history shaped your perspective on its impact on individuals or society?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how might such insights shape your future interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past or teaching others sparked your curiosity, and how it might shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others helped you understand its impact on shaping your future goals or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand current societal issues, and how might this shape your future interactions with others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how might this shape your approach to teaching or mentoring others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you shape your views on teaching or mentoring others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue or shaped your perspective on teaching others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how might this shape your approach to teaching others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand current societal issues, and how might this shape your approach to teaching others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue, and how might this shape your approach to teaching others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you shape your views on teaching or learning, and how might this impact your future?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past or teaching others sparked your curiosity, and how do you see this passion shaping your future?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past or teaching others sparked your curiosity, and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past or teaching others sparked your curiosity, and how might that experience shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a present-day issue, and how might such insights shape your future interactions or teachings?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring historical events or cultural heritage sparked your curiosity, and how did you share that excitement with others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how would you teach this connection to others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how do you see this shaping your future?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how do you see this shaping your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how might such insights shape your future interactions with others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Reflecting on your past, how have historical events or cultural traditions influenced your perspective, and how might you share this passion with others?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you shape your perspective on teaching or learning, and how might this impact your future?",
    "criterion": "Experiences"
  },
  {
    "major": "History and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past or teaching others helped you grow, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  }
]