[
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and problem-solving to create something innovative, and how did that impact your interest in tech-driven solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial tasks - what excites you about creating user-friendly tech that impacts everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where technology helped you solve a problem, and how that sparked your curiosity about innovating in finance or product development?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or created something to solve a problem, and how did that impact your interest in technology?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and creativity to solve a problem, and how did that experience spark your curiosity for innovative solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you improved a process or created something that combined technology, finance, or business, and what excited you about it?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience spark your curiosity about its potential in finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a problem, and how it sparked your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a problem, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how it sparked your curiosity for innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital solution to simplify financial tasks - what excites you about designing tech products that impact everyday financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or created something new using technology, and how it sparked your curiosity about its potential impact?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital solution that simplifies financial transactions - what aspects of designing such a product excite you the most about pursuing this field?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process using technology, and how it sparked your curiosity about innovating in finance or product development?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital solution to simplify financial transactions - what excites you about designing tech products that impact everyday financial lives?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you improved a process or created something new using technology, and how it sparked your curiosity for innovative problem-solving?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience inspire you?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and creativity to solve a problem, and how did that experience shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or product, and how it sparked your curiosity about integrating technology and business?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital solution to simplify financial tasks - what excites you about designing such innovative tools for everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and imagined a tech-based solution, and how that process sparked your curiosity for innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital solution that simplifies financial transactions; what aspects of designing such a product excite you the most about pursuing this field?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital solution to simplify financial transactions - what excites you about designing technology that impacts everyday financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a situation where you combined technology and finance to solve a problem, and what sparked your curiosity in this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or created something new, and how it sparked your curiosity about blending technology and business?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial tasks - what excites you about creating such impactful tech, and how do you see yourself contributing?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you improved a process or created something new, and how did that experience spark your curiosity about technology's role in driving innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or created something new, and how it sparked your curiosity about technology's role in business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you improved a process or created something to solve a problem, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and creativity to solve a problem, and how did that experience spark your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a problem, and how did that spark your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial transactions - what excites you about creating such impactful technology?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and how did that inspire your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where technology helped you solve a problem, and how that sparked your curiosity about innovating for business or finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an example of how you've used technology to solve a problem or improve a process, and how that experience sparked your curiosity about its potential in finance or product innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and thought about creating a tech solution, even if you didn't build it?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or created something new, and how it sparked your curiosity about blending technology and finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and creativity to solve a problem, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when technology solved a real-life problem, and how that inspired your curiosity about building innovative solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital solution to simplify financial transactions - what excites you about designing tech products that impact everyday financial lives?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital solution to simplify financial tasks - what excites you about designing tech products that impact how people manage money?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you improved a process or created something to solve a problem, and how did that experience spark your curiosity about technology's role in shaping financial or business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital solution to simplify financial transactions - what excites you about designing tech products that impact everyday financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where technology solved a real-life problem, and how that inspired your curiosity about designing innovative solutions for finance or everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial transactions - what aspects of this process excite you the most about pursuing a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or product, and how did that spark your curiosity about integrating technology with business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or created something new, and how it sparked your curiosity about technology's role in solving real-world problems?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and creativity to solve a real-world problem, and how did that experience shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a problem, and how did that spark your curiosity about future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial tasks - what aspects of creating such a product excite you the most?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where technology solved a problem, and how that inspired your future career goals in a tech-driven field?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or created something new, and how it sparked your curiosity about blending technology with business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when technology solved a real-life problem for you, and how did that experience spark your curiosity in designing innovative solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or product, and how did that spark your curiosity about blending technology with business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial transactions - what aspects of this challenge excite you the most about pursuing a career in tech?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or created something new using technology, and how it sparked your curiosity for innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process that sparked your curiosity for future innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you improved a process or created something new using technology, and how it sparked your curiosity about its potential in finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and problem-solving to create something innovative, and how did that impact your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial transactions - what excites you about creating such impactful technology?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or created something new, and how it sparked your curiosity about blending technology with business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial transactions - what aspects of this project excite you the most about pursuing a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial tasks - what aspects of this process excite you the most about pursuing a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or created something new, and how did that impact your interest in blending technology with business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or created something new, and how it sparked your curiosity about technology's role in business?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a problem, and how did that impact your interest in innovating for business?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you improved a process or created something to solve a problem, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial tasks - what aspects of this project excite you the most about pursuing a career in tech?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial transactions - what excites you about creating technology that impacts everyday financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process using technology, and how did that spark your curiosity about its potential in finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where technology solved a real-life problem, and how that inspired your curiosity about designing innovative solutions for the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial tasks - what excites you about creating technology that impacts everyday financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial tasks - what excites you about creating user-friendly tech that impacts everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you improved a process or created something new, and how did that experience spark your curiosity about technology's role in finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a problem, and how did that spark your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and problem-solving to create something valuable, and how did that impact your interest in tech-driven innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you improved a process or created something new using technology, and how it sparked your curiosity for future innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or created something useful with technology, and how it sparked your curiosity about its potential impact?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial tasks - what aspects of this process excite you the most about pursuing a career in tech and finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a problem, and how did that spark your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem, and how did that spark your curiosity about its potential in finance or product innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a real-life problem, and how did that impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you improved a process or created something new using technology, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital solution to simplify financial transactions - what aspects of this process excite you the most about pursuing a career at the intersection of technology and finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process using technology, and how did that spark your curiosity about its potential in finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you improved a process or created something new using technology, and how it sparked your curiosity about its potential in finance or business?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where technology solved a real-life problem, and how that inspired your curiosity about designing innovative solutions for finance or business?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital solution to simplify financial transactions - what excites you about designing such impactful tech products?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you improved a process or created something new, and how it sparked your curiosity about technology's role in business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital solution to simplify financial tasks - what excites you about designing tech that impacts everyday financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem, and how did that spark your curiosity about its potential in finance or product innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you improved a process or created something to solve a problem, and how it sparked your curiosity about technology's role in finance or business?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and imagined a tech solution, even if you couldn't build it?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you improved a process or created something new using technology, and how it sparked your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where technology helped you solve a real-life problem, and how it sparked your curiosity about its potential in finance or product innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital solution to simplify financial transactions - what aspects of designing such a product excite you the most about this field?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a problem, and how did that spark your curiosity about its potential impact?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem, designed a simple solution, and considered how it might impact users or finances?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and envisioned a tech-based solution, even if you couldn't build it yourself?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple digital tool to help your friends manage their part-time job earnings and expenses?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple app to help students manage their daily expenses, and what features would you prioritize?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach creating a simple digital tool to help your friends manage their school expenses effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to help students manage their expenses, and what skills do you think you'd need to develop to make it user-friendly and secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and brainstormed a tech-driven solution, even if it didn't come to fruition?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple app to manage personal finances, highlighting your problem-solving and creative skills?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple digital solution to help a small business owner manage their finances more efficiently?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and brainstormed a tech-driven solution, even if it didn't come to fruition?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple app to help students track their daily expenses, and what features would you prioritize?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time you identified a problem, designed a simple solution, and how you would measure its success in a digital or financial?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem, brainstormed a tech-driven solution, and considered its financial feasibility?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple digital solution to help a friend manage their daily expenses, and what skills do you think you'd need to develop to make it user-friendly and secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and brainstormed a tech-driven solution, even if it didn't work out as planned?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to help students manage their daily expenses effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital tool to help students manage their expenses, even if you have no coding experience yet?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-based solution, even if you didn't have all the technical skills?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to help your community manage personal finances effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple digital solution to help a friend manage their daily expenses, and what skills do you think you'd need to learn to make it a reality?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital tool to help your friends manage their daily expenses, and what skills do you think you'd need to develop to make it user-friendly and secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-enabled solution, even if you didn't have all the technical skills yet?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple digital solution to help your school manage event registrations efficiently?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to help students like yourself manage their daily expenses effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple app to help your school friends track and manage their daily expenses effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to help your school manage event registrations more efficiently?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-driven solution, even if you didn't have all the technical skills yet?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach creating a simple digital solution to manage your school's event ticket sales efficiently?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple digital solution to help students like yourself track expenses effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to manage personal expenses, and what skills do you think you'd need to develop to make it user-friendly and secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to help your peers manage their school expenses effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital tool to help students manage their expenses, and what features would you prioritize?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple app to help students manage their daily expenses, even with no prior coding experience?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you would design a simple digital solution to help your school manage event registrations more efficiently?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-based solution, even if you didn't have all the technical skills yet?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-driven solution, even if you didn't have all the technical skills yet?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital tool to help students manage their expenses, and what skills do you think you'd need to develop to make it user-friendly and secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and envisioned a tech-based solution, even if you didn't build it, and what inspired your idea?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple app to help friends split bills, even if you've never coded before?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem in your daily life and brainstormed a tech-based solution, even if you didn't build it?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem in your daily life and brainstormed a tech-driven solution, even if you couldn't build it?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-driven solution, even if you didn't have all the technical skills?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and brainstormed a tech-driven solution, even if it didn't work out as planned?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple app to help students manage their part-time job earnings and expenses?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple digital solution to help students like yourself manage their daily expenses effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to a common financial problem you've personally encountered?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital tool to help a friend manage their daily expenses, and what skills do you think you'd need to learn to make it a reality?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple app to help students track their daily expenses, and what features would you prioritize?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and brainstormed a tech-based solution, even if it didn't come to fruition?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple digital solution to help students manage their daily expenses, and what skills do you think you'd need to develop to make it user-friendly and secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you would design a simple digital solution to manage personal expenses, and what skills do you think you'd need to develop it?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple app to help students track their daily expenses, and what features would you prioritize?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and brainstormed a tech-driven solution, even if it didn't fully come to fruition?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to help students manage their daily expenses, and what skills do you think you'd need to develop to make it successful?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach creating a simple digital solution to help your school manage event registrations more efficiently?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to manage personal expenses, and what skills do you think you'd need to develop along the way?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem in your daily life and brainstormed a tech-driven solution, even if you didn't build it?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital tool to help your friends manage their part-time job earnings, and what features would you prioritize?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem, designed a simple solution, and evaluated its potential impact on people or processes?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple app to help friends split bills, highlighting your problem-solving and technical skills?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and brainstormed a tech-driven solution, even if it didn't come to fruition?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple app to help students track their daily expenses, and what features would make it indispensable to you?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to help students manage their expenses, and what skills do you think you'd need to develop for this project?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple app to help students manage their daily expenses, even if you have no coding experience?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and brainstormed a tech-driven solution, even if it was just an idea?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to help your school club manage its finances more efficiently?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and brainstormed a tech-driven solution, even if it was just an idea?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-driven solution, even if you didn't have all the skills to build it yet?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and brainstormed a tech-driven solution, highlighting your creative and analytical skills?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution, like a budgeting app, to solve a common financial problem you've observed?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple digital solution to help your school manage event registrations more efficiently?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple app to help students manage their daily expenses, and what features would you prioritize?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple digital solution to help your school club manage finances more efficiently?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple app to help your school friends track their daily expenses, and what features would you prioritize?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital tool to help your friends manage their part-time job earnings?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to help students manage their school expenses effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple app to help students manage their daily expenses, and what features would you prioritize?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and envisioned a tech-driven solution, even if you couldn't build it yourself?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to manage personal expenses for a first-time user?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you would design a simple digital solution to help your school community manage expenses effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple app to help students track their daily expenses, and what features would you prioritize?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and brainstormed a tech-based solution, even if it didn't come to fruition?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-based solution, even if you didn't have all the technical skills yet?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and brainstormed a tech-driven solution, even if it didn't come to fruition?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple app to help students track their expenses, even if you've never coded before?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to manage your school's event payments, and what skills do you think you'd need to develop to make it user-friendly and secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-driven solution, even if you didn't have all the technical skills yet?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-driven solution, even if you didn't have all the technical skills yet?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and brainstormed a tech-driven solution, even if it didn't fully come to fruition?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to help your friends manage their part-time job earnings and expenses?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital solution to help your friends manage their school expenses effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple app to help students track their expenses, and what features would you prioritize?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you would design a simple digital solution to help your school manage event registrations more efficiently?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple app to help students manage their expenses, and what features would you prioritize?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple app to help students track their daily expenses, even if you have no coding experience?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd design a simple app to help students track expenses, highlighting your problem-solving and tech adaptation skills?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-based solution, even if you couldn't fully implement it?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-driven solution, even if you didn't have all the technical skills yet?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple app to help students manage their daily expenses, and what features would you prioritize?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and brainstormed a tech-driven solution, even if it didn't fully come to fruition?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw how it could impact people's financial lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Have you ever identified a problem in your daily life and thought of a tech-based solution? How did you approach developing or proposing it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you designed or improved a system, product, or process that involved technology, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and brainstormed a tech-driven solution, even if it didn't come to fruition?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and considered how it might impact users or financial processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw its impact, sparking your curiosity in technology's role in finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process that interested you?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and reflected on how it could impact people's financial lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and brainstormed a tech-driven solution, even if it didn't come to fruition?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and creativity to solve a real-world problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and created a simple solution, such as a tool or process, to address it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and how it impacted users, inspiring you to innovate further?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw its impact on people or processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and creativity to solve a real-world problem or improve a process that interested you?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you designed or improved a system, product, or process that you think could be enhanced with technology?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem, designed a simple solution, and saw how it could impact people's financial lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-driven solution, even if it didn't come to fruition?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw how it could impact people's financial lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and reflected on how it could impact people's financial lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw its impact, sparking your interest in tech-driven innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and brainstormed a tech-driven solution, reflecting on how it sparked your interest in innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem, designed a simple solution, and reflected on how technology could improve financial processes around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and reflected on how technology could further improve it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and brainstormed a tech-driven solution, even if it didn't fully come to fruition?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process that interested you?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Have you ever designed or improved a simple product or system, and how did that experience shape your interest in blending technology with business solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw its impact on people or processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-based solution, even if you didn't have all the skills to build it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and created a simple solution, like a tool or process, to address it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-life problem, and how did that impact your interest in innovating for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and how it impacted users or a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and reflected on how it could impact people's financial lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw its impact, sparking your curiosity in technology's role in finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and brainstormed a tech-driven solution, even if it didn't fully come to fruition?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and reflected on how technology could be used to improve it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and brainstormed a tech-driven solution, even if it didn't come to fruition?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw how it could impact people or processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem, and how did that impact your interest in innovating for business or finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw its impact, even if it didn't fully succeed?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw how it could impact people's financial lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Have you ever designed a simple solution to a real-world problem, and if so, how did you balance user needs with technical feasibility?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and created a simple solution, like a tool or process, to address it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw its impact, sparking your interest in tech-driven innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and brainstormed a tech-driven solution, reflecting on what you learned from the process?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and reflected on how technology, like apps or software, could have enhanced the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-world problem, and how it sparked your interest in innovating for businesses or finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you designed or improved a product, and how did you consider its potential impact on users or financial systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and creativity to solve a problem, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-driven solution, even if it didn't come to fruition?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and brainstormed a tech-based solution, even if it didn't come to fruition?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and reflected on how it could impact people's daily lives or financial decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and brainstormed a tech-driven solution, even if it didn't come to fruition?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a problem, and how it sparked your interest in innovative tech solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you designed or improved a process, and how did that impact its users or outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw its impact on others or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Have you ever identified a problem in your daily life and thought of a tech-based solution, even if you didn't build it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and brainstormed a tech-based solution, even if you didn't have all the skills to implement it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a real-world problem, and how did that impact your interest in innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Have you ever designed or improved a process, product, or system that combines technology with financial or business aspects, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and creativity to solve a real-world problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw its impact, sparking your interest in tech-driven innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process that you're passionate about?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and envisioned a tech-based solution, even if you didn't build it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-life problem, and how did that impact your interest in innovating for future industries?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and problem-solving to create something innovative, and how did that impact your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and reflected on how it could impact users or businesses?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and envisioned a tech-driven solution, even if you couldn't build it yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and created a simple solution, like a tool or process, to address it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and brainstormed a tech-driven solution, even if it didn't come to fruition?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and envisioned a tech-driven solution, even if you didn't build it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and brainstormed a tech-driven solution, reflecting on what you learned from the process?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a problem, and how did that impact your interest in innovative fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and reflected on how it could impact users or businesses?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Have you ever designed or improved a process, product, or system, and if so, what motivated you to innovate in that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to solve a real-life problem or improve a process, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and reflected on how technology could further improve it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to solve a real-life problem or improve a process, and how did that experience shape your interest in innovative solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process that interested you?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a real-world problem, and how did that impact your interest in tech-driven solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and creativity to solve a real-world problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem and created a simple solution, like a tool or process, to make a?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Have you ever designed or improved a product, system, or process that you think could impact financial services or everyday life, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem, and how did that impact your understanding of its role in business?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and reflected on how technology could scale its impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem and created a simple solution, like a tool or process, to address it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Have you ever designed or improved a process to solve a real-life problem, and how did you leverage technology or data in your approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem, brainstormed a tech-based solution, and what motivated you to improve or create something new?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you identified a problem, designed a simple solution, and saw its impact, like building a tool to manage finances or streamline a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw how it could impact people or processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and reflected on how it could impact people's financial lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and saw its impact on people or processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Product Development and Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you identified a problem, designed a simple solution, and reflected on how technology could further enhance it?",
    "criterion": "Experiences"
  }
]