[
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand how laws can drive positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a moment when you witnessed an injustice, and how would you advocate for change in such situations?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you could advocate for change, and how does that relate to your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you advocated for someone or something, and how did that shape your desire to understand the legal framework?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution - what did you enjoy about that process?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you advocated for someone or something, and how did that moment spark your curiosity about legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did those experiences shape your desire to understand and uphold legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to learn how laws can drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - how did that experience spark your curiosity about the systems that govern our society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you stood up for someone or something, and how did that moment shape your desire to pursue a career in justice?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a moment when you witnessed injustice, and how would you have advocated for change if given the opportunity?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could advocate for change - what sparks your desire to drive societal impact through legal means?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how you think studying the legal framework could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about justice, rights, or governance, and how you think studying law could empower you to create meaningful impact?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you advocated for someone or something, and how did that moment spark your curiosity about legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could address it through a structured, impactful system - is this drive something you'd like to pursue?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding the legal framework around it could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you stood up for someone or something, and how did that shape your desire to advocate for others?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - how did that experience shape your desire to understand and influence societal rules?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - how did that experience shape your desire to understand and navigate legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced an injustice, and how do you think a deeper understanding of legal systems could empower you to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished to address it through a structured, argumentative process - what sparked that desire in you?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and how do you think a deeper understanding of laws could empower you to create positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you stood up for someone or something, and how did that moment shape your desire to advocate for others?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its legal dimensions could empower you to drive meaningful change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to consider playing a role in creating a more just society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished to intervene - how do you think studying law could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - what sparked your curiosity to learn more about the systems that govern such situations?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding the legal framework around it might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced an injustice that sparked your desire to understand how laws can drive positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to make a positive change through legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and how do you think a deeper understanding of legal systems could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Reflecting on your aspirations, how do you envision using legal principles to address societal challenges or advocate for change in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and how did that experience spark your curiosity about creating positive change through legal frameworks?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you stood up for someone or something, and how did that moment shape your desire to advocate for others?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced an injustice that sparked your desire to understand and shape the rules governing society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could advocate for change - what drives your desire to be a voice for others?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand how laws could be used to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding the legal framework around it could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice that sparked your desire to create positive change, and how do you see yourself contributing to a fairer society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a moment when you witnessed an injustice, and how would you have addressed it if given the opportunity?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a moment when you witnessed unfairness and how it sparked your curiosity to learn more about creating positive change through legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced an injustice that sparked your desire to understand how laws can drive positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for someone or something, and what motivated you to take on that role?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did those experiences shape your desire to advocate for change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did that spark your curiosity about creating positive change through legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its legal dimensions could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did that spark your curiosity about creating systemic change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to want to address or resolve it?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to want to address or prevent such issues in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you advocated for something you believed in, and how did that shape your desire to pursue a career in justice?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could help create a fairer outcome, and how might studying law empower you to do so?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation and wished you could advocate for change - what drives your desire to stand up for others?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to want to address or resolve it?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could create change through a structured, argument-based approach?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to want to address or resolve it?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand how laws can drive positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did those experiences shape your desire to advocate for change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you had the power to advocate for change, and what sparked that desire in you?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could advocate for change - how do you see yourself contributing to a fairer society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to want to address or resolve it?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a moment when you witnessed an injustice, and how did that experience shape your desire to understand and address societal rules?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a moment when you witnessed an injustice, and how would studying law empower you to address such issues in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial topic that sparked your curiosity about how laws shape society and individual rights?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - what sparked your curiosity to learn more about the systems that govern such situations?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand and potentially shape the rules governing society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and how did it spark your desire to understand the systems that promote equality and justice?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced an injustice, and how did that spark your curiosity to understand the systems that govern fairness in society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and how do you think studying law could empower you to create positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you advocated for a cause or negotiated a resolution, and how did this shape your desire to pursue a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for someone or something - what did you learn from that experience?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could advocate for change - how might studying law empower you to make a difference?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about justice, rights, or governance, and how you see yourself contributing to these areas?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - how did that experience shape your desire to understand and influence societal rules?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a social issue you're passionate about and explain how you'd work to address it through a career in law?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, how did it spark your desire to understand the systems in place to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could advocate for change - what draws you to using the law as a tool for impact?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice seemed compromised, and how did those experiences shape your desire to understand legal systems better?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its legal dimensions could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial topic that sparked your desire to understand and shape the rules governing society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Reflecting on a recent social issue that sparked your curiosity, how do you see yourself contributing to creating positive change through legal frameworks?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced an injustice that sparked your desire to create positive change through a career in the legal field?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue that sparked your desire to understand and shape the rules governing society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding the legal framework around it might shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced an injustice that sparked your desire to understand and potentially shape the rules governing society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to want to address or prevent such issues in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to consider playing a role in creating positive change through the legal system?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you could advocate for change, and how does that inspire your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you had the power to create positive change, and how does that relate to your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding the legal framework around it might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand how laws could be used to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you've seen fairness or justice being upheld, and how it sparked your curiosity about pursuing a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you advocated for a cause or helped resolve a conflict, and how it sparked your curiosity about legal principles?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you felt strongly about fairness or justice, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice was compromised, and how do you think studying law could empower you to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced an injustice that sparked your desire to understand and potentially shape the rules governing society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to want to address or prevent such issues in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to consider how laws could be used to address or prevent such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did those experiences shape your desire to learn about upholding rights?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to want to address or resolve it?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuade someone to adopt your viewpoint, and how did you approach the situation effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you approach convincing others who disagreed with you?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to adopt your viewpoint, and what strategies did you use to build your case effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point of view, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to see things from your perspective, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you approach convincing others?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to adopt your viewpoint, and how did you approach the conversation?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you approach convincing others who disagreed with you?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for yourself or someone else, and what strategies did you use to persuade others?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you ensure your message resonated with your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point effectively, and how did you ensure your perspective was heard?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to see things from your perspective, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to see things from your perspective, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point of view, and how did you approach building your case?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you ensure your message resonated with your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuade someone to see things from your perspective, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point of view, and how did you approach the situation effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your perspective was effectively communicated?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you ensure your perspective was effectively communicated?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you ensure your perspective was effectively communicated?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to adopt your viewpoint, and how did you approach the negotiation?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you approach convincing others of your viewpoint?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to see things from your perspective, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point of view, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to convince others?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point of view, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to see things from your perspective, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to see things from your perspective, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you walk me through how you would approach resolving a heated dispute between two close friends, ensuring fairness and maintaining relationships?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuade someone to see things from your perspective, and how did you approach the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to argue a point you strongly believed in, and how did you persuade others?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you approach building a convincing case?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for someone or something, and how did you approach the challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you walk me through how you would approach resolving a heated dispute between two friends, highlighting your critical thinking and negotiation skills?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for someone or something, and how did you approach the challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message resonated with your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your perspective was effectively communicated?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for someone or something, and how did you approach the challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point effectively, and how did you ensure your perspective was well-received?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach resolving a heated dispute between two close friends, ensuring fairness and preserving relationships?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to persuade someone to adopt your viewpoint, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you ensure your perspective was effectively communicated?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you approach building a strong, logical case?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuasively argue a point of view, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your perspective was effectively communicated?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for a cause or person, and how did that shape your perspective on fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you engaged in debates, mock trials, or discussions on social justice, and how did these experiences shape your perspective on fairness and advocacy?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your perspective on fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your interest in pursuing a career in justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did that influence your desire to understand and uphold justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to navigate a complex rule or guideline, and how did that experience shape your perspective on fairness?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and how did it shape your communication approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and how did that shape your interest in legal studies?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or disagreement, and how did that experience shape your perspective on fairness or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for someone or something, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for yourself or others, and how did that experience shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to advocate for yourself or others, and how did that experience shape your interest in pursuing a career in law?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was in question, and how did that influence your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to advocate for yourself or others, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to persuade someone or negotiate a resolution, and what did you learn from that encounter?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was questioned, and how did that spark your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and how did that shape your interest in pursuing a legal career?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you advocated for someone or something, and how did that experience shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuade someone or argue a point, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was in question, and how did that influence your interest in understanding legal systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and how did that shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to persuasively argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuade someone or negotiate a resolution, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you engaged in debates, negotiated resolutions, or advocated for a cause that sparked your curiosity about shaping societal rules and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for yourself or others, and how did that experience shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and how did that shape your communication style?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and how did that shape your communication approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your perspective on fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for someone or something, and how did that experience shape your interest in justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was questioned, and how did that influence your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to persuasively argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to advocate for someone or something, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or disagreement, and how did that experience shape your interest in justice or advocacy?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever navigated a complex rule or disagreement? How did you approach it, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuade someone or argue a point, and how did that experience shape your communication style?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuasively argue a point or negotiate a resolution, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your understanding of fairness or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or conflict, and how did that experience shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for a cause or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever navigated a situation where fairness was questioned, and how did you advocate for a resolution that felt just to all parties involved?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for someone or something, and how did that experience shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for a cause or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your communication approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did you respond or wish you had intervened?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to advocate for yourself or others, and how did that experience shape your understanding of fairness or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or disagreement, and how did you work towards a fair resolution?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your understanding of fairness or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and how did this experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you engaged in debates, mock trials, or discussions on social justice issues that sparked your curiosity about shaping societal rules?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or conflict, and how did that experience shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did you respond or wish you had intervened?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuade someone to see things from your perspective, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or conflict, and how did that experience shape your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution? What strategies did you use and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuade someone or argue a point, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did you respond or wish you could have intervened?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was a concern; how did you navigate it and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or conflict, and how did that experience shape your approach to fairness and advocacy?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was in question, and how did you respond or wish to intervene?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever navigated a situation where fairness or justice was at stake, and how did you approach resolving it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your interest in pursuing a career in law?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did that influence your desire to understand or address such issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you advocated for someone or something, and how did that experience shape your interest in pursuing a legal career?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did that influence your desire to understand legal systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and how did that shape your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to persuade someone or argue a point, and how did that experience shape your communication style?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did you respond or wish you could have intervened?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to navigate a complex rule or moral dilemma, and how did that experience shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to navigate a complex rule or regulation that impacted your community or personal life?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and what did you learn from that experience?",
    "criterion": "Experiences"
  }
]