[
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about living organisms, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about the natural world and how it relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery related to living organisms that sparked your curiosity, and how do you see yourself exploring this fascination further?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever wondered how living organisms impact our daily lives, and how exploring these connections could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how it sparked your curiosity about living organisms and their interactions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you wondered how living things work, and how might exploring such curiosities shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about living organisms, and how might exploring this field shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Could you share an experience that sparked your curiosity about living organisms, and how might exploring this fascination shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about living organisms, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about living organisms, and how do you see this fascination guiding your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever wondered how living organisms interact with their environments, and how exploring these relationships could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you wondered how living things work, and how you explored that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you were fascinated by the natural world, and how did that spark influence your thoughts about your future studies or career?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery in biology or environmental science that sparked your curiosity and made you eager to explore further?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Could you share an experience or moment that sparked your curiosity about living organisms, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you were fascinated by the natural world, and how do you think studying its complexities could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about how living organisms work, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you explored the natural world, and how did that experience spark your curiosity about living organisms?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever wondered how living organisms interact with their environments, and how exploring these interactions could shape your future career or personal passions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever wondered how living organisms adapt to their environments, and how exploring these mechanisms could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery in biology or the natural world that sparked your curiosity and makes you eager to explore further?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever been curious about how living organisms interact with their environment, and how exploring this could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery in biology or the natural world that sparked your curiosity and why it still fascinates you today?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you wondered how living things work, and how exploring those questions might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how it sparked your curiosity about living organisms and their interactions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about living organisms, and how do you see this fascination shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Could you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery in biology, chemistry, or the environment that sparked your curiosity and might influence your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you marveled at the natural world, and how might exploring its intricacies shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Reflecting on your future, how might exploring the intricacies of living organisms and ecosystems impact your career aspirations or personal fulfillment?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever wondered how living organisms interact with their environment, and how exploring these interactions could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where exploring the natural world sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery in biology or environmental science that sparked your curiosity, and how do you see it shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you were curious about how living things work, and how might exploring such questions shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery related to living organisms that sparked your curiosity and made you eager to explore further?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you wondered how living things work, and how might exploring those questions shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Could you share an experience or discovery that sparked your curiosity about living organisms, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Could you share a moment when you were fascinated by how living things interact or evolve, and how might exploring such phenomena shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you were fascinated by the natural world, and how do you see yourself contributing to its understanding in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever wondered how living organisms interact with their environment, and how exploring these interactions could shape your future career or personal passions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery related to living organisms that sparked your curiosity and might influence your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about living organisms, and how might this interest shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you wondered how living things work, and how might exploring these questions shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Could you share an experience or discovery in biology or environmental science that sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever wondered how living organisms impact our daily lives, and how exploring these connections might shape your future career or personal passions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how it sparked your curiosity about living organisms and their interactions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Reflecting on your hobbies or experiences, what aspects of understanding living organisms or ecosystems excite you about potential future studies or career paths?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery in biology that sparked your curiosity, and how do you see it shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you were fascinated by the natural world, and how do you see this curiosity shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Could you share an experience or discovery in biology or environmental science that sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about how living organisms work, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever explored the natural world through hands-on activities or projects, and how did those experiences shape your curiosity about living organisms?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Could you share an experience or moment that sparked your curiosity about how living organisms function, and how do you see this fascination guiding your future?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about how living organisms interact, and how might this fascination shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you explored the natural world, and how did that experience spark your curiosity about living organisms?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Could you share a moment when you found the natural world fascinating, and how might exploring its intricacies shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where exploring the natural world sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you wondered how living things work, and how might exploring such questions shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you found the natural world fascinating, and how might exploring this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about living organisms, and how do you see this fascination guiding your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about living organisms, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about living organisms, and how might this shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you were fascinated by the natural world, and how might exploring these curiosities shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about how living organisms function, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery related to living organisms that sparked your curiosity and made you eager to explore further in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever been curious about how living organisms interact with their environments, and how exploring these interactions could shape your future career or personal passions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you wondered about living organisms, and how might studying their intricacies shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Could you share an experience or moment that sparked your curiosity about how living organisms function, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about living organisms, and how do you see this fascination guiding your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you were fascinated by the natural world, and how did that spark your curiosity about living organisms?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Could you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever wondered how living organisms interact with their environment, and how understanding these interactions could shape your future career or personal passions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about the natural world, and how do you see this driving your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever been fascinated by how living things interact or evolve, and how exploring these questions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how it sparked your curiosity about living organisms and their impact on our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you were fascinated by the natural world, and how might exploring such curiosities shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you found the natural world fascinating, and how might exploring its intricacies shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever wondered how living organisms interact with their environments, and how exploring these interactions could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where exploring the natural world sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you were fascinated by the natural world, and how might exploring these interests shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you were fascinated by the natural world, and how you think studying it could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about how living organisms work, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever explored the wonders of living organisms, and how might understanding these systems shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where exploring the natural world sparked your curiosity, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever wondered how living organisms interact with their environments, and how exploring these relationships could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever wondered how living organisms interact with their environment, and how exploring these interactions could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery in biology or the natural world that sparked your curiosity and keeps you eager to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience or discovery in biology, chemistry, or environmental science that sparked your curiosity about how living things interact?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share a moment when you wondered how living things work, and how exploring this curiosity might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever wondered how living organisms impact our daily lives, and how exploring these connections could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Could you share an experience or discovery in biology that sparked your curiosity, and how do you see it shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you explored the natural world, and how did that experience spark your curiosity about living organisms?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever wondered how living organisms interact with their environments, and how exploring these interactions could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms?",
    "criterion": "Interests"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing the natural world sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when observing the natural world sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how would you apply scientific principles to understand the phenomenon better?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about the natural world, and how it sparked your curiosity to explore further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an interesting biological phenomenon, and how would you systematically investigate it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when observing living organisms or ecosystems sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing biological phenomenon, and how would you go about investigating its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you observed something in nature that sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing biological phenomenon and how you would approach investigating its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing the natural world sparked your curiosity, and how did you explore that interest further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an interesting biological phenomenon and how you would approach investigating its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing biological phenomenon, and how would you systematically investigate its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an interesting biological phenomenon, and how would you systematically investigate its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing the natural world sparked your curiosity, and how might this drive your future exploration of biological principles?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed the impact of biological processes on everyday life, and how did that spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an example of how you've applied scientific principles to understand a biological phenomenon in your daily life or hobbies?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an interesting biological phenomenon, and how would you approach investigating its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an interesting biological phenomenon, and how would you systematically investigate its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how might this drive your future exploration of living systems?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how might this drive your future exploration of biological principles?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed a biological phenomenon, and how would you systematically investigate its underlying mechanisms?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an interesting biological process, and how would you investigate it further if given the chance?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed how living organisms interact with their environment, and how did that spark your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an example of how observing the natural world has sparked your curiosity, and how you've explored that interest further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed something in nature that sparked your curiosity, and how did you go about exploring it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when observing the natural world sparked your curiosity, and how you explored that interest further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an interesting biological process, and how would you investigate its underlying mechanisms if given the chance?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you observed something in nature that sparked your curiosity, and how did you go about exploring it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing biological phenomenon, and how would you approach investigating its underlying mechanisms?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an example of how observing the natural world has sparked your curiosity, and how you've explored those interests so far?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an unusual plant or animal behavior - how would you investigate its cause and relevance to ecosystems?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing living organisms sparked your curiosity, and how would you explore this interest further in your studies?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing the natural world sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an interesting biological process, and how did that spark your curiosity about living organisms?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing the natural world sparked your curiosity, and how you explored that interest further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing living organisms sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when observing the natural world sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you observed something in nature that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing living organisms sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how might this drive your future exploration of living systems?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an interesting biological process, and how would you approach understanding it systematically?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed something in nature that sparked your curiosity, and how did you go about exploring it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing the natural world sparked your curiosity, and how you explored that interest further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing the natural world sparked your curiosity, and how would you explore this further in a scientific?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how might this relate to your future academic pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an interesting biological phenomenon and explain how you would investigate its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how might this drive your future exploration of living systems?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an example of how observing the natural world has sparked your curiosity, and how you've explored those interests further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how might this relate to your future career goals?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed something in nature that sparked your curiosity, and how would you go about investigating it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing biological phenomenon and how you would approach understanding its underlying mechanisms?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed something in nature that sparked your curiosity, and how did you go about exploring it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how you explored that interest further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how did you explore or investigate further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing biological phenomenon and how you would approach understanding its underlying mechanisms?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing biological process, and how would you systematically investigate its underlying mechanisms?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing living organisms or ecosystems sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed something in nature that sparked your curiosity, and how did you go about exploring it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an interesting biological phenomenon, and how would you systematically investigate its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing biological phenomenon and explain how you would systematically investigate its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity about living organisms?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing living organisms or ecosystems sparked your curiosity, and how might this interest guide your future academic or career choices?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing biological process, and how did it spark your curiosity about living organisms?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an example of how you've applied scientific principles to understand a natural phenomenon or solve a real-world problem?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing living organisms sparked your curiosity, and how might exploring such interests shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing living organisms sparked your curiosity, and how would you build on that interest in a scientific setting?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an interesting biological phenomenon and explain how you would approach understanding its underlying mechanisms?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed something in nature that sparked your curiosity, and how would you approach investigating it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing the natural world sparked your curiosity, and how you explored that interest further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing biological phenomenon, and how would you approach investigating its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity about living organisms?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about a biological process that sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever conducted simple experiments or observed living organisms, and how did those experiences spark your curiosity about the natural world?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in the study of living organisms, and how did it spark your curiosity about the natural world?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our world?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you observed or learned about the natural world, and how it sparked your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about potential career paths in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing or learning about living organisms sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing living organisms or ecosystems sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our daily lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about living organisms, sparking your curiosity about how life works around us?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about the natural world, and how it sparked your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing living organisms or ecosystems sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing living organisms or ecosystems sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our daily lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing or learning about living organisms sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the natural world sparked your curiosity, and how did that experience influence your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever explored the natural world through hands-on activities, and how do you think these experiences might shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our world?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our world?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or learned about living organisms, sparking your curiosity about their potential impact on our daily lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing living organisms or ecosystems sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our world?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about potential career paths in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you explored the natural world, and how did that experience spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in the study of living organisms, and how did it spark your curiosity about life processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our daily lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our daily lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our daily lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their impact on our world?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our world?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing living organisms or ecosystems sparked your curiosity, and how did that shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing the natural world sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in the study of living organisms, and how it sparked your curiosity about potential career paths?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in the study of living organisms, and how did it spark your curiosity about potential career paths?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing living organisms or ecosystems sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our daily lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you observed or learned about the natural world, and how it sparked your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms or ecosystems?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when you observed or learned about the natural world, and how it sparked your curiosity or interest in further exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in the study of living organisms, and how did it spark your curiosity about the natural world?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing living organisms or ecosystems sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our world?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing the natural world sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever observed or participated in activities where you explored the natural world, and how did those experiences spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing living organisms or ecosystems sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in the study of living organisms, and how it sparked your curiosity about potential career paths?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about potential career paths in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in the study of living organisms, and how it sparked your curiosity about the natural world?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our world?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever explored the natural world through hands-on activities, and how might these experiences shape your future goals in understanding living systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about potential career paths in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in the study of living organisms, and how it sparked your curiosity about future scientific pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our daily lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing living organisms or ecosystems sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or contributed to understanding living organisms, sparking your curiosity about their potential impact on our world?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where observing living organisms or ecosystems sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Have you ever explored the natural world through hands-on activities or projects that deepened your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms or ecosystems?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did it spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in the study of living organisms, and how did it spark your curiosity about life's complexities?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you share an experience where you explored the natural world, and how did that spark your curiosity about living organisms and their interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Life Sciences",
    "school": "NUS",
    "question": "Can you describe a moment when observing living organisms or ecosystems sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  }
]