[
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Reflecting on your daily interactions, what aspects of human behavior or mental processes intrigue you the most, and how do you see yourself exploring them further?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how might exploring this curiosity benefit your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share a moment when understanding someone's behavior or mindset fascinated you, and how exploring this further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior fascinated you, and how exploring this curiosity might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or mental processes sparked your curiosity, and how might exploring this field further impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when you were curious about someone's behavior or motivations, and how did that spark your interest in understanding people better?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how understanding this could impact your future relationships or career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share a personal experience or observation that sparked your curiosity about human behavior, and how might exploring this field shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or mindset helped you, and how has this sparked your curiosity about the human mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever found yourself wondering why people behave the way they do, and how understanding this could help you in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how understanding this could impact your future interactions or career?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this field could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how you think exploring this field could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or mindset fascinated you, and how you think exploring this curiosity could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior fascinated you, and how might exploring this fascination impact your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how understanding these behaviors could impact your future interactions or career?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you found human behavior intriguing, and how understanding it better could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you found human behavior fascinating, and how exploring it further could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior fascinated you, and how exploring this interest could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Reflecting on your daily interactions, what aspects of human behavior or mental processes intrigue you the most and why do you think studying them would be valuable?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever observed a behavior or mindset that fascinated you, and what motivated you to understand the underlying reasons behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how understanding these motivations could help you in your future interactions or career?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how you think studying this field could help you make a positive impact?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever observed a behavior or pattern in yourself or others that sparked your curiosity to understand the underlying motivations?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever observed a behavior that intrigued you, and what motivated you to understand the underlying reasons behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when understanding someone's behavior or thoughts fascinated you, and how exploring this curiosity might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or emotions sparked your curiosity, and how exploring this further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or motivations sparked your curiosity, and how you think exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you found human behavior intriguing, and how exploring this fascination might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share a moment when understanding someone's behavior or motivations fascinated you, and how you think exploring this curiosity could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever helped someone through a tough time, and if so, what sparked your curiosity about the human mind and behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Reflecting on your daily interactions, what aspects of human behavior or mental processes fascinate you the most and why?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this further could impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when you were curious about why someone behaved a certain way, and how did that spark your interest in understanding human behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior fascinated you, and how might exploring this fascination impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share a moment when understanding human behavior or motivations fascinated you, and how you see this curiosity shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or mindset helped you navigate a challenging social situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how understanding this could impact your future interactions or career?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share a moment when understanding someone's behavior or mindset fascinated you, and how you think studying this field could impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how you think exploring this curiosity could impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how exploring this further could enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how might exploring this field shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Reflecting on your interactions with others, what aspects of human behavior or mental processes fascinate you the most and why?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Reflecting on your experiences, what aspects of understanding human behavior or the mind intrigue you, and how might exploring these areas shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how would exploring these 'whys' impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share a moment when understanding someone's behavior or thoughts fascinated you, and how exploring this further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging situation, and how did that spark your curiosity about the mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share a moment when you found human behavior intriguing, and how exploring it further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever tried to understand someone's behavior or motivations that seemed unusual to you, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations helped you navigate a challenging situation, and why did that fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Reflecting on your own experiences, how do you think understanding human behavior could help you achieve your personal or professional goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or mindset helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how you think exploring this curiosity could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share a moment when understanding someone's behavior or motivations fascinated you, and how exploring this interest could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when understanding human behavior or emotions sparked your curiosity, and how you see this fascination guiding your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging situation, and how did that spark your curiosity about the mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share a personal experience or observation that sparked your curiosity about how people think, behave, or interact, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share a moment when understanding someone's behavior or mindset fascinated you, and how exploring this interest could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or mindset fascinated you, and how exploring this interest could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how exploring this further could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever observed a behavior in others or yourself that sparked curiosity, and how do you think understanding its underlying causes could impact your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or mindset fascinated you, and how exploring this further could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you were curious about someone's behavior, and how understanding their mindset could have helped you or others?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a social situation, and how did that spark your curiosity about the mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how might exploring this curiosity benefit your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Reflecting on your own experiences, can you describe a moment when understanding human behavior or mental processes sparked your curiosity about its underlying reasons?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share a personal experience or observation that sparked your curiosity about how people think, behave, or interact, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you found human behavior intriguing and how understanding it could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Reflecting on your interactions with others, what aspects of human behavior or mental processes intrigue you the most and why?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how you think studying this field could help you make a meaningful impact?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how would exploring these motivations impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how would exploring these questions impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or emotions sparked your curiosity, and how might exploring this fascination shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how you think exploring this field could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging social situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging social situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging social situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this field could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how you think studying this field could help you make a positive impact?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how that curiosity might shape your future studies or career?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Reflecting on your daily interactions, what aspects of human behavior or mental processes intrigue you the most and why do you want to explore them further?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging situation, and how that sparked your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how might exploring this curiosity shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Reflecting on your daily interactions, what aspects of human behavior or mental processes intrigue you the most and why do you want to explore them further?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how understanding this could impact your future interactions or career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations fascinated you, and how exploring this curiosity might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior fascinated you, and how might exploring this fascination shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or motivations sparked your curiosity, and how might exploring this field shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how you think studying this field could help you make a positive impact?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone overcome a challenge, and how did that shape your understanding of human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively supported a friend or family member through a challenging emotional situation, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively helped someone understand their emotions or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively supported a friend or family member through a challenging situation, and what skills did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone overcome a challenge, and how did that shape your understanding of human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you effectively supported a friend or family member, and what did you learn about human behavior from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you effectively supported a friend or family member through a challenging time, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you effectively helped someone understand their behavior or emotions, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you helped someone overcome a challenge, and how did that experience shape your understanding of human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where observing human behavior sparked your curiosity, and how you think understanding it could benefit your future interactions or career?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you effectively helped someone understand their emotions or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in this field?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you helped someone understand their behavior, and how did that experience shape your interest in studying the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what strategies did you use to support them?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and how did that experience shape your interest in this field?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where observing human behavior sparked your curiosity, and how would you systematically explore the underlying motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively supported a friend in distress, and what did you learn about human behavior from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their feelings or behaviors, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively supported a friend or family member through a challenging emotional situation, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in studying human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where understanding someone's behavior or motivations helped you navigate a challenging social interaction, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you helped someone understand their feelings or behaviors, and how did that experience shape your interest in studying human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what strategies did you use to support them?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did that experience impact you?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your own understanding of human interactions?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you effectively understood and influenced someone's behavior, and how did that impact your communication approach?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior, and how did that shape your interest in understanding human motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively supported a friend or family member through a difficult emotional situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in studying human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone overcome a challenge, and how did that shape your understanding of human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in studying human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their behavior, and how did that experience shape your interest in understanding human motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you observed a change in someone's behavior, and how would you try to understand the underlying reasons?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you effectively supported a friend or family member through a challenging time, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively supported a friend through a tough situation, and what did you learn from this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their emotions or behaviors, and what strategies did you use to support them?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where observing human behavior sparked your curiosity, and how you think understanding it could impact your future interactions or career?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively helped someone understand their behavior or emotions, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where observing human behavior sparked your curiosity, and how you would systematically explore the underlying motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and how did that experience impact your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively helped someone understand their emotions or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behavior, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience spark your curiosity in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you effectively supported a friend in distress, and what did you learn from that experience about human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you effectively supported a friend in distress, and what did you learn from that experience about human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you observed a change in someone's behavior and what you think might have caused it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a situation where you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you observed an interesting human behavior and tried to understand the motivations behind it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their feelings or behaviors, and how did that impact your interest in studying human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in studying the mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when you helped someone understand their feelings or behaviors, and how did that experience impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you observed human behavior that intrigued you, and how did you try to understand the motivations behind it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you observed human behavior that sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when you helped someone understand their feelings or behaviors, and how did that experience impact your curiosity about the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you observed human behavior, and how did that spark your curiosity about the mind or behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you observed or influenced someone's behavior, and how did that spark your curiosity about the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their feelings or behaviors, and how did that impact your interest in the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when you helped someone understand their thoughts or feelings, and how did that experience shape your curiosity about human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when observing human behavior sparked your curiosity, and how did you explore or reflect on it afterwards?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience spark your curiosity about human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you observed human behavior, and how it sparked your curiosity about the mind or behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when you helped someone understand their feelings or behaviors, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you observed an interesting human behavior and tried to understand the motivations behind it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a time when you observed or influenced a change in someone's behavior, and what sparked your curiosity about the underlying reasons?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you observed human behavior that sparked your curiosity, and how you think understanding it could impact your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you observed human behavior that intrigued you, and how you think understanding it deeper could impact your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying the mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when you helped someone understand their feelings or behaviors, and what did you learn from that experience about human motivations?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you observed human behavior that intrigued you, and how did it spark your curiosity about the mind or behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you observed or influenced human behavior, and how did that spark your curiosity about the mind's complexities?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their feelings or behaviors, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their feelings or behaviors, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when observing human behavior sparked your curiosity, and how did you explore or learn more about it afterwards?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you observed human behavior, and how did that spark your curiosity about the mind or behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where understanding someone's behavior or motivations helped you navigate a challenging situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  }
]