[
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology solving a real-world business problem, and how did that spark your curiosity to explore this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative decision-making, and how did this impact your outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you combined logical problem-solving with creative thinking to achieve a goal, and why did it excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creative problem-solving, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem, and how that experience sparked your curiosity about its business applications?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you saw technology transforming a business, and how did that inspire your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did that impact your interest in pursuing a tech-driven business career?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance logical problem-solving with creative decision-making, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Imagine merging tech innovations with business strategies - how do you see yourself contributing to or benefiting from such a fusion in your future endeavors?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did this blend impact the outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did that impact your interest in future career paths?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you realized combining technology with business strategies could solve a real-world problem, and how did that inspire you?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you realized combining technology and business strategies could solve a real-world problem, and how did that inspire you?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did that impact your interest in tech-driven business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how it sparked your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical thinking with creativity to solve a problem, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology improving a business process, and how did that inspire your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and how did that excite you about future opportunities?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and how did that impact your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative business thinking, and how did that spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-world problem, and how did that experience spark your curiosity about its business applications?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology solving a business problem, and how it sparked your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did that spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and what excited you about that experience?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance creative problem-solving with analytical thinking, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you saw technology solve a real-world business problem, and how that inspired you to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology transforming a business or daily life - what excited you about that change?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance logical problem-solving with creative decision-making, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you saw technology solving a real-world problem, and how that sparked your curiosity about its business applications?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative decision-making, and how did this blend shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative decision-making, and how did that impact the outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical and creative skills to solve a problem, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Imagine you're launching a tech startup - what excites you more: developing the software or strategizing its market entry, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem, and how that experience sparked your curiosity about its business applications?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did that impact your interest in pursuing a field that bridges technology and business?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact your interest in pursuing a tech-driven business career?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did that impact your decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did that impact your interest in pursuing a field that integrates technology and business?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you combined analytical skills with creative problem-solving, and how did this experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solving a real-world business problem, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology transforming a business, and how did that spark your curiosity about blending tech and commerce?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did this blend spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did that impact your interest in tech-driven business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solving a real-world problem, and how that inspired you to pursue a career blending business and tech?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solving a real-world business problem, and how did that spark your curiosity about integrating tech and commerce?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creative problem-solving, and how did that spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you saw technology transforming a business or daily life, and how it sparked your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did that impact your decision to pursue a tech-driven business career?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did that impact your interest in tech-driven business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you saw technology solving a real-world business problem, and how that sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical and creative skills to solve a problem, and how did that impact your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process that interests you?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative decision-making, and how did that shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you saw technology transforming a business or daily life - what excited you about that change?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did that spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did that impact your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did this blend spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology solving a real-world business problem, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creative problem-solving, and how it sparked your curiosity for future career paths?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did this spark your curiosity about blending technology and business?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance analytical problem-solving with creative decision-making, and how did that experience shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process that interests you?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a problem or improve a process, and how that experience sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience spark your curiosity about its business applications?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem, and how this experience sparked your curiosity about its business applications?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative business thinking, and how did that experience spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solving a real-world business problem, and how did that spark your curiosity about blending these two fields?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did that impact your interest in tech-driven business solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology solving a real-world problem, and how that sparked your curiosity about its role in business?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process that interests you?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative business thinking, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process that also had a business impact?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solve a real-world problem, and how did that moment spark your curiosity about blending tech and business?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology transforming a business, and how did that spark your curiosity about blending tech and commerce?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology solving a real-world business problem, and how it sparked your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you saw technology solve a real-world problem, and how that sparked your curiosity about its business applications?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did that impact your goals or interests?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you realized combining technology with business strategies could solve a real-world problem, and how did that excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a personal or team goal?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical thinking with creativity to solve a problem, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative decision-making, and how did that impact the outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solving a real-world business problem, and how it sparked your curiosity to explore this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process that interests you?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology solving a real-world business problem, and how it sparked your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you combined analytical skills with creative problem-solving, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology solving a real-world business problem, and how it sparked your curiosity about integrating tech and commerce?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology solving a real-world business problem, and how it sparked your curiosity about integrating tech and commerce?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Imagine launching a tech startup - how would you balance creating innovative software with understanding market demands to drive success?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology transforming a business or daily life, and how did that spark your curiosity to explore this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a problem or improve a process, and how that experience sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative decision-making, and how did this shape your aspirations for future studies or career?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in blending tech and business?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-world problem or improve a process, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical thinking with creativity to solve a problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical thinking with creativity to solve a problem, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your approach to innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-world problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical thinking with creativity to solve a problem, and how did this experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance logical problem-solving with creative thinking, and how did you adapt to achieve a successful outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creativity to address a challenge, and how did you adapt when initial approaches failed?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you used technology to solve a real-life problem, and how did that impact your understanding of its business potential?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance logical problem-solving with creative decision-making, and how did you approach this blend?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively solved a problem by combining analytical thinking with practical application?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you creatively used technology to solve a problem or improve a process?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you creatively solved a problem by combining logical thinking with an understanding of how people make decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance logical problem-solving with creative decision-making, and how did you approach this blend?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you identified a problem and brainstormed both technical and business-focused solutions, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you balanced analytical thinking with creativity to solve a problem, and how did this shape your approach to innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you balanced logical problem-solving with creative thinking - how did you approach this blend?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creativity to achieve a goal, and how did this experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world issue or opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance technical and non-technical aspects to achieve a goal, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with strategic decision-making, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a challenge, and how did you adapt to any unexpected outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance logical problem-solving with creative decision-making, and how did you approach this challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a challenge, and how did you adapt to its outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical thinking with creativity to solve a real-world problem, and how did you adapt when faced with unexpected challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creativity to address a challenge, and how did you adapt when initial approaches failed?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a goal, and how did this experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance logical problem-solving with creative decision-making, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance analytical and creative skills to solve a problem, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a personal or team goal, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem, and how you think this skill will benefit your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in blending business and tech?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a challenge, and how did this experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you balanced analytical thinking with creative problem-solving, and how did this experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to balance logical problem-solving with creative decision-making, and how did that experience shape your skills?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance technical problem-solving with creative, business-minded thinking, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you creatively solved a problem using technology, and how did this impact your approach to achieving goals?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did you balance technical and non-technical considerations?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world challenge, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did this experience shape your interest in integrating tech with business?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a challenge, and how did you measure its success?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to balance analytical problem-solving with creative decision-making, and how did you adapt to any challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a problem or improve a process in a school project or personal initiative?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interest in blending business and tech?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you identified a problem and imagined a tech-based solution to improve a process or product?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance analytical problem-solving with creative decision-making, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a personal or team goal, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical and creative skills to solve a problem, and how did this experience shape your career interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world challenge or opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical thinking with creativity to solve a problem, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you creatively solved a problem using technology, and how did this impact the outcome or your learning?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world challenge or opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you creatively solved a problem by combining logical thinking with practical application?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in blending business and tech?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem, and what skills did you develop through this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in blending tech and business?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical thinking with creativity to solve a problem, and how did you adapt to any unexpected challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical thinking with creativity to solve a problem, and how did this experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance creative problem-solving with analytical thinking, and how did you navigate that situation?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in blending tech with business strategies?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance technical problem-solving with creative decision-making, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem, and how you think this skill will benefit your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you balanced logical problem-solving with creative thinking, and how did that experience shape your approach to innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a problem or improve a process in a team or personal project?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical thinking with creativity to solve a problem, and how did you adapt when initial approaches failed?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-world problem or improve a process, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you combined logical problem-solving with creative thinking to achieve a personal or team goal, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you used technology to solve a real-life problem, and how did that experience shape your approach to innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance creative problem-solving with logical analysis, and how did you adapt to find a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what skills did you develop through this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world challenge, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did this experience shape your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you balanced analytical thinking with creative problem-solving, and how did this experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with creative, business-oriented thinking, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical thinking with creativity to solve a problem, and how did you balance both approaches?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance analytical and creative problem-solving, and how did you adapt to benefit from both approaches?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through how you would leverage technology to solve a common business problem in a field that interests you?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and how did you adapt when faced with unexpected challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with understanding user needs, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you used technology to solve a real-life problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you balanced analytical thinking with creativity to solve a problem, and how did you adapt to any unexpected challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you combined logical problem-solving with creative thinking to achieve a goal or improve a process?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem, and how did that experience shape your career interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical problem-solving with creative decision-making, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical thinking with creative problem-solving, and how did that shape your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world issue or opportunity?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did this impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a personal or team goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did this impact your decision-making process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical and creative skills to solve a problem, and how did that impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance analytical and creative skills to solve a problem, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a goal, and how did this experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did this impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creativity to address a real-world challenge, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem or complete a project that interested you?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did this impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a goal or solve a real-world problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a personal or team goal, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative decision-making, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world challenge or opportunity?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem, and how did that impact your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creative problem-solving, and how did this experience shape your interest in integrating technology and business?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did this impact your interest in tech-driven business solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical thinking with creative problem-solving, and how did that shape your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact your decision-making or outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this shape your approach to innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did this impact your approach to innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a goal or solve a real-world problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creativity to achieve a goal, and how did this impact your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical and creative skills, and how did that shape your approach to problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creativity to address a real-world issue or opportunity?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did that impact your approach to innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creativity to achieve a goal, and how did this impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did this impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did this impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact your decision-making or outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creative problem-solving, and how did this experience shape your interest in integrating technology with business?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did you adapt to any challenges that arose?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did this impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process in a group project or personal endeavor?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creativity to address a real-world challenge, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did this impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did this impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical thinking with creativity to solve a problem, and how did this experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process in a team or personal project?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you balanced analytical and creative skills to solve a problem or complete a project?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did it impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a goal or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical and creative problem-solving, and how did you adapt to benefit from both approaches?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical thinking with creativity to solve a problem, and how did this experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving to achieve a goal, and how did you adapt to any challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world challenge or opportunity?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solve a real-world problem, and how that inspired your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process that interests you?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance creative problem-solving with analytical thinking, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you saw technology solving a real-world business problem, and how it sparked your curiosity about the intersection of these fields?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you saw technology transforming a business or daily life, and how did that spark your curiosity about its potential?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and how did that feel?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did that impact your goals or aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creative problem-solving, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical thinking with creativity to solve a problem, and how did that impact your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Imagine launching a tech startup - what excites you more, the business strategy or the coding aspect, and how do you see yourself contributing?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance logical problem-solving with creative decision-making, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology transforming a business or daily life - how did that inspire you to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solving a real-world business problem, and how did that spark your curiosity about combining these fields?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did that impact your decision-making or outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did that spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this blend spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you combined analytical skills with creative problem-solving, and how did this experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what sparked your curiosity in that moment?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Imagine you're launching a tech startup - how would you balance creative business strategies with innovative technology solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a goal, and how did that experience inspire your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you combined analytical skills with creativity to solve a problem, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Imagine combining technology and business strategy to solve real-world problems - what excites you most about integrating these two fields in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did this spark your curiosity for innovative solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did that spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance analytical problem-solving with creative decision-making, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative decision-making, and how did that impact your outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical thinking with creative problem-solving, and how did this experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative business thinking, and how did that spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical problem-solving with creative decision-making, and how did you enjoy the process?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did that spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative decision-making, and how did this blend spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance analytical problem-solving with creative business thinking, and what excited you about that experience?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solve a real-world business problem, and how did that inspire your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did that impact your decision to pursue a tech-driven business career?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical thinking with creativity to solve a problem, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did that impact your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology transforming a business, and how did that spark your curiosity to explore this intersection further?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance analytical problem-solving with creative decision-making, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solving a real-world problem, and how did that spark your curiosity about its business applications?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did that spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you saw technology solving a real-world problem, and how that inspired your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you realized combining technology with business strategies could solve a real-world problem, and why it excited you?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology solving a real-world business problem, and how it sparked your curiosity to explore this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative decision-making, and how did this blend spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical thinking with creative problem-solving, and how did that spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solving a real-world business problem, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process that interests you?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology solving a real-world problem, and how that sparked your curiosity about its role in business?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did that spark your curiosity about integrating technology with business strategy?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Imagine running a tech startup - what excites you most about leveraging technology to drive business innovation and growth?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you saw technology transforming a business, and how did that inspire your career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you saw technology solving a real-world problem, and how that inspired your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solving a real-world business problem, and how did that spark your curiosity about its potential?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did that impact your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solving a real-world business problem, and how did that spark your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative decision-making, and how did that spark your curiosity about integrating technology and business principles?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you saw technology transforming a business or daily life - what excited you about that change?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience spark your curiosity about its potential in business?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you used technology to solve a real-world problem or improve a process, and why did it excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did that impact your decision to pursue a tech-driven business career?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology transforming a business, and how did that inspire your career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and how did that impact your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance analytical problem-solving with creative decision-making, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this blend spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical thinking with creative problem-solving, and how did that spark your curiosity for future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did that spark your curiosity about integrating technology and business strategies?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance creative problem-solving with analytical thinking, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology transforming a business, and how that sparked your curiosity about integrating tech and commerce?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solving a real-world business problem, and how did that spark your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology improving a business, and how did that spark your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you used technology to solve a real-life problem or improve a process, and how did that experience inspire you?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and what sparked your curiosity in that moment?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you realized how technology could transform a business or daily life, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative business thinking, and how did that impact your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Imagine merging tech solutions with business strategies - what excites you about leveraging technology to drive innovative business ideas in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process, and what sparked your curiosity in that moment?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you used technology to solve a problem or improve a process, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process, and why it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did that impact your interest in pursuing a tech-driven business career?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you saw technology solving a real-world business problem, and how it sparked your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a moment when you saw technology solve a real-life business problem, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did that impact the outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did that impact your interest in pursuing a field that bridges technology and business?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you saw technology solving a real-world problem, and how it sparked your curiosity about blending business strategy with tech innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance analytical problem-solving with creative decision-making, and what did you enjoy most about it?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Imagine merging tech innovation with business strategy - what excites you about leveraging technology to drive business solutions in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and how did that spark your curiosity about integrating technology and business principles in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance analytical problem-solving with creative decision-making, and how did you approach this challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your approach to innovative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you balanced analytical problem-solving with creative decision-making, and how did this experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a challenge, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical thinking with creativity to solve a problem, and how did this experience shape your interest in pursuing a field that integrates technology and business?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through how you would leverage technology to innovate a simple business process that you encounter daily, like managing school club activities?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical thinking with creativity to solve a problem, and how did this experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-world problem, and how did that experience shape your interest in innovative business solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you used technology to solve a real-life problem, and what skills did you develop through that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical thinking with creativity to solve a problem, and how did you adapt to any unexpected challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world challenge, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical thinking with creativity to solve a problem, and how did this experience shape your approach to innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creativity to address a real-world issue, and how did you adapt to any challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance logical problem-solving with creative decision-making, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance logical problem-solving with creative decision-making, and how did you approach this blend?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you combined logical problem-solving with creative thinking to address a real-world challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively solved a problem using both logical reasoning and an understanding of people's needs?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical thinking with creativity to solve a problem or improve a process?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creativity to address a real-world challenge, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you creatively solved a problem using both technical and business-minded approaches, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in blending business and tech?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did this experience shape your interest in blending business and tech?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you balanced logical problem-solving with creative decision-making, and how did this experience shape your approach to innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a goal, and how did this experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance technical and creative aspects to solve a problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you creatively solved a problem using both logical analysis and an understanding of human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did you balance technical and creative aspects?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you balanced analytical and creative skills to solve a problem, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you identified a problem and thought of a creative, tech-driven solution to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in blending business strategy with tech solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world challenge or opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did this experience shape your interest in merging tech and business?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did this experience shape your approach to innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in blending tech and business?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you used technology to solve a real-life problem, and how did that experience shape your approach to innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in blending tech with business strategies?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance analytical thinking with creative problem-solving, and how did you approach this challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you balanced analytical thinking with creativity to solve a problem, and how did you adapt to any unexpected challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world challenge, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your approach to innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you creatively solved a problem using both technical and business-minded approaches?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you identified a problem, and how you might use technology to create a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to balance analytical problem-solving with creative decision-making, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what skills did you develop through this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your approach to innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance analytical and creative thinking to solve a problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to balance analytical and creative problem-solving, and how did you adapt to any unexpected challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you identified a problem and brainstormed both technical and business-driven solutions, and what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you combined logical problem-solving with creative thinking to achieve a personal or team goal?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you identified a problem and used technology to propose a creative solution, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance creative problem-solving with analytical thinking, and how did you adapt to find a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a challenge, and how did you measure its success?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world challenge or opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a personal or team goal, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance logical problem-solving with creative decision-making, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance logical problem-solving with creative decision-making, and how did you approach this blend?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in merging tech and business?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance logical problem-solving with creative thinking, and how did you adapt to achieve your goal?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through how you would leverage technology to solve a real-world business problem, and what skills do you think are essential for this?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in blending tech and business?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what skills did you apply?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in blending business and tech?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a goal, and how did this experience shape your skills?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a challenge, and how did you adapt to changes along the way?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world challenge or opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a challenge, and how did you adapt to its outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a goal, and how did this experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance logical problem-solving with creative thinking, and how did you adapt to achieve your goal?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance logical problem-solving with creative thinking, and how did you adapt to achieve a successful outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you combined logical problem-solving with creative thinking to address a real-world challenge or opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in blending business and tech?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance logical problem-solving with creative decision-making, and how did you adapt to achieve your goal?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creativity to achieve a goal, and how did this experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creativity to address a real-world challenge, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a personal or team goal, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you walk me through a time when you balanced analytical thinking with creative problem-solving, and how did this experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical thinking with creativity to solve a problem, and how did this experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance analytical thinking with creative problem-solving, and how did you adapt to any unexpected challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with creative decision-making, and how did you adapt to achieve your goal?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a real-life problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance creative problem-solving with analytical thinking, and how did you adapt to achieve your goal?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance technical and creative aspects of a project - how did you ensure both succeeded?",
    "criterion": "Skills"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical problem-solving with creative decision-making, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem, and how did this experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical problem-solving with creative decision-making, and how did you approach this blend?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creative problem-solving, and how did this experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance logical problem-solving with creative decision-making, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you balanced analytical thinking with creativity to solve a problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical problem-solving with creative decision-making, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to address a real-world challenge or opportunity?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did this impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical problem-solving with creative decision-making, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did this impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical problem-solving with creative decision-making, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you balanced analytical problem-solving with creative thinking, and how did this shape your approach to innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did it impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a goal, and how did this experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creativity to address a real-world challenge, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did this impact your approach to innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem or achieve a goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did this impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal or help others?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you used technology to solve a real-world problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and how did this impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process in a team or personal project?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creativity to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did that impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did that impact your approach to innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creativity to address a real-world issue or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a real-world problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical and creative problem-solving, and how did that shape your approach to innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creative problem-solving, and how did this experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this shape your interest in integrating technology with business?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical problem-solving with creative thinking to achieve a goal or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a goal or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creative problem-solving, and how did this impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical thinking with creative problem-solving, and how did that shape your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a personal or team goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined logical problem-solving with creative thinking to achieve a personal or team goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creative problem-solving, and how did this experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did it impact your interest in tech-driven business solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a real-world problem, and how did it shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem, and how did this experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance analytical problem-solving with creative decision-making, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical thinking with creativity to solve a problem, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creativity to solve a problem, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you balanced analytical thinking with creative problem-solving, and how did this shape your approach to innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you used technology to solve a real-world problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem, and how did that impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical skills with creativity to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you describe a time when you combined analytical skills with creative problem-solving, and how did this experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you combined analytical thinking with creativity to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Business and Computing",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance logical problem-solving with creative decision-making, and what did you learn from it?",
    "criterion": "Experiences"
  }
]