[
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you observed a process that transformed raw materials into something useful, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience or hobby where you enjoyed solving problems related to transforming raw materials into something useful, and why it fascinated you?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you saw science being used to solve a real-world problem, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity about future applications?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you found a real-world problem involving materials or processes fascinating, and how you'd approach solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you observed a process that transformed raw materials into something useful - what excited you about it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that spark your curiosity for more?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw science solve a real-world problem, and how did that spark your curiosity about applying chemistry to everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you observed a process that transformed raw materials into something useful, and what sparked your curiosity about it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a real-life problem or everyday situation where you've seen chemistry being used to create practical solutions, and how did that inspire you?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Have you ever thought about how everyday products are made, and would you enjoy designing processes to create innovative solutions for real-world problems?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a moment when you saw science solve a real-life problem, and how that sparked your curiosity about applying chemistry to create innovative solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw science being used to solve a real-world problem, and how it sparked your curiosity about applying chemistry in practical ways?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you observed a process involving chemical transformations, and what sparked your curiosity about its underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about how everyday products are developed or manufactured?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw science being used to solve a real-world problem, and how it sparked your curiosity about pursuing a field that combines chemistry and engineering?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a moment when you saw how chemistry could solve a real-world problem, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an everyday problem you've observed that involves transforming raw materials into something useful, and how you'd approach solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an example from your life where you enjoyed solving a problem involving materials or processes, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an example of how you've seen chemistry solve a real-world problem, and how that inspired your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Have you ever been fascinated by how everyday products are made or how to solve environmental issues through innovative processes?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving to transform raw materials into something useful, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you saw science solve a real-world problem, and how did that spark your curiosity about its practical applications?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you observed a process that transformed raw materials into something useful, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity for future applications?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw science solve a real-life problem, and how it sparked your curiosity about applying scientific principles to create innovative solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity about future applications?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an everyday problem you've observed that involves transforming raw materials into something useful, and how you'd approach solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience or hobby where you enjoyed solving problems related to transforming raw materials into something useful?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you were fascinated by how everyday products are made, and how that sparked your curiosity about the processes behind them?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share a moment when you saw how chemistry solves real-world problems, and how did that spark your curiosity about its applications?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you observed a process that transformed raw materials into something useful, and how did that spark your curiosity about the science behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity for the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new or improve a process?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw science solve a real-world problem, and how it sparked your curiosity about designing solutions for everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about transforming raw materials into everyday products, and how might this shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a moment when you saw science solve a real-world problem, and how did that inspire your curiosity about designing solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an everyday problem or process that fascinates you, and how you think the application of science and engineering principles could improve it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you saw science solve a real-world problem, and how did that spark your curiosity about designing solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a moment when you saw science solve a real-world problem, and how it sparked your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a moment when you were fascinated by how everyday products are made or transformed, and how might this curiosity guide your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw science solve a real-world problem, and how did that spark your curiosity about its applications?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an everyday problem you've observed that involves transforming raw materials into something useful, and how you'd approach solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about transforming raw materials into everyday products, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving to create something new, and how did that spark your curiosity about transforming raw materials into everyday products?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw how chemistry or materials impacted daily life, sparking your curiosity to innovate solutions for real-world challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a moment when you saw how chemistry could solve a real-world problem, and how that inspired your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw science solve a real-world problem, and how it sparked your curiosity to pursue similar challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience or hobby where you enjoyed solving problems related to transforming raw materials into something useful, and why it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience or hobby where you enjoyed solving problems related to transforming raw materials into something useful, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience or hobby where you enjoyed solving a problem related to transforming raw materials into something useful?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity for the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you saw science solve a real-world problem, and how did that moment spark your curiosity about applying chemistry to create practical solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a real-life problem or everyday situation where you think the principles of transforming raw materials into useful products could make a significant impact?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new or improve a process?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about how everyday materials are transformed or created, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new or improve a process, and how did that excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a moment when you saw science solve a real-life problem, and how it sparked your curiosity about its practical applications?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an everyday problem you've observed that involves transforming raw materials into useful products, and how you'd approach solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw science solve a real-world problem, and how that sparked your curiosity to pursue a field that transforms raw materials into everyday solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you found a complex problem involving materials or processes fascinating, and how you'd approach solving it in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you observed a process that transformed raw materials into something useful, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you were fascinated by how everyday products are made, and how you think you could contribute to creating innovative solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you observed a process that transformed raw materials into something useful, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an example of how you've applied problem-solving skills to improve a process or product that fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an everyday problem you'd enjoy solving using science, and how you think the process of designing a solution excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw science solve a real-world problem, and how did that spark your curiosity about applying scientific principles to create practical solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw science solve a real-world problem, and how did that spark your curiosity about its applications?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did it spark your curiosity about transforming raw materials into everyday products?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share a moment when you were fascinated by how everyday products are made, and how might that curiosity shape your future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an example of how you've seen chemistry solve a real-world problem, and how that inspires your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity about future applications?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an everyday problem you've observed that involves transforming raw materials into something useful, and how you'd approach solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you observed a process that fascinated you, and how understanding its inner workings might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you transformed raw materials into something useful, and how did that experience spark your curiosity about the process?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a moment when you saw science solve a real-world problem, and how it sparked your curiosity about applying chemistry to everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you observed a process that transformed raw materials into something useful, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a moment when you saw science solve a real-world problem, and how that sparked your curiosity to pursue similar challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a moment when you saw science solve a real-world problem, and how did that spark your curiosity about applying chemistry to everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a moment when you saw science solve a real-world problem, and how it sparked your curiosity to create innovative solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a moment when you saw science solve a real-world problem, and how it sparked your curiosity about designing solutions for everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an everyday problem you've observed that involves transforming raw materials into useful products, and how you think it could be solved?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you combined science and problem-solving to create something new, and how did that spark your curiosity about future applications?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw science solve a real-world problem, and how it sparked your curiosity to create similar solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a real-life problem or everyday process that involves transforming raw materials, and why improving it excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw science solve a real-life problem, and how it sparked your curiosity about designing solutions for everyday challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you saw how chemistry or materials impacted daily life, sparking your curiosity to learn more about how things are transformed?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a moment when you saw science solve a real-life problem, and how did that spark your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you saw science solve a real-world problem, and how did that spark your curiosity about applying chemistry in practical ways?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share a moment when you saw how chemistry solves real-world problems, and how that sparked your curiosity about its applications?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an everyday problem you've observed that involves transforming raw materials into useful products, and how you'd approach solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you were fascinated by how everyday products are made, and how might studying the science behind these processes excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Have you ever been fascinated by how everyday products are made or how to solve environmental issues through innovative processes?",
    "criterion": "Interests"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you had to troubleshoot a complex problem, like balancing multiple variables or optimizing a process, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied scientific principles to solve a real-life problem, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to troubleshoot a complex problem, and how your analytical approach might apply to designing sustainable solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied scientific principles to solve a real-world problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied scientific principles to solve a real-life problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process or improve efficiency, and how did you measure success?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you solved a complex problem using a systematic approach, and how did that experience shape your interest in applying science to real-world solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-life problem, and how did that experience shape your interest in this field?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to troubleshoot a problem with limited information, and how did you apply logical thinking to resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to troubleshoot a problem without a clear solution - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process, and how did you balance safety with efficiency in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical thinking to solve a complex problem, and how did you adapt when your initial approach failed?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical thinking to solve a complex problem, and how did you adapt when your initial approach failed?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you had to troubleshoot a complex problem, and how your analytical approach helped you find a creative solution?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with combining different substances or materials, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you had to troubleshoot a complex problem, and how your analytical approach might help you design innovative solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to troubleshoot a complex problem with limited information, and how did you adapt?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process or solve a complex issue in a science-related project?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you solved a complex problem using a systematic approach, and how did that experience shape your interest in applying science to real-world challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to troubleshoot a complex problem, like a failed experiment or project - what was your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach designing a sustainable process to convert waste into a valuable product, highlighting your problem-solving skills?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied problem-solving skills to optimize a process or improve efficiency in a project or daily life?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to troubleshoot a complex problem, like a failed experiment, and how you applied analytical thinking to resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical problem-solving to understand or improve a process in your daily life or studies?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to overcome a challenge, and how did that experience shape your interest in designing solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to troubleshoot a complex problem, and how you applied logical thinking to resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to troubleshoot a complex problem, like optimizing a process or resolving an unexpected outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process or improve efficiency in a project or daily life?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical problem-solving to a complex, hands-on challenge, and what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you solved a problem using a systematic approach, and how did that experience shape your interest in applying science to real-world challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied scientific principles to solve a real-life problem, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied problem-solving skills to optimize a process or overcome a challenge in a science-related project?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied problem-solving skills to optimize a process or solve a complex issue?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process or improve efficiency in a project or daily life?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process, and how did you measure its success?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process or overcome a challenge, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process or solve a complex issue in a science-related?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with mixing different substances or building a simple machine, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you solved a complex problem using both logical reasoning and creativity?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to design or improve a process, and how did you balance safety with efficiency?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical thinking to solve a complex problem, and how did you adapt when initial solutions failed?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process or improve efficiency in a project or daily life?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem in a laboratory setting, emphasizing your analytical and troubleshooting skills?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied problem-solving skills to optimize a process or improve efficiency in a project or daily life?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you had to troubleshoot a complex problem, and how did you apply analytical thinking to resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied scientific principles to solve a real-life problem, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to understand or improve a process, and how did you adapt when things didn't go as planned?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a real-life problem, like purifying water for a rural community, using scientific principles?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you had to troubleshoot a complex problem, and how your analytical approach might help you design safer, more efficient industrial processes?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you had to troubleshoot a complex problem, and how did you apply analytical thinking to resolve it effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you had to troubleshoot a complex problem, and how did you apply analytical thinking to resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process, and how did you measure its success?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to design or optimize a process, and how did you ensure its safety and efficiency?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to troubleshoot a complex problem, and how your analytical approach helped you find a creative solution?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you solved a complex problem using both analytical and creative thinking, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with mixing different substances, and how would you apply that curiosity to solve real-world problems?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process or improve efficiency in a project or daily life?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied scientific principles to solve a real-life problem, and how did that experience shape your approach to innovative thinking?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with combining different substances or materials, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process or solve an everyday problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-life problem, and how did that experience shape your interest in pursuing a field that combines chemistry and engineering?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied problem-solving skills to optimize a process or system in your daily life or studies?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied scientific principles to solve a real-life problem, and how did that experience shape your curiosity for innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach solving a complex problem involving multiple variables, like optimizing a process to reduce waste?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you solved a complex problem using a systematic approach, and how did you adapt when initial solutions failed?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you had to troubleshoot a complex problem, and how your analytical approach might help you design innovative solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process, and how did you measure its success?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you had to troubleshoot a problem using analytical thinking, and how did you apply scientific principles to resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to troubleshoot a complex problem, like optimizing a process or resolving an unexpected outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process, and how did you measure its success?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you had to troubleshoot a problem using logical steps, and how did that experience shape your approach to solving challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you had to troubleshoot a complex problem, like resolving an unexpected outcome in a science experiment?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical problem-solving to a complex, hands-on challenge, and how did you adapt when initial approaches failed?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical thinking to solve a complex problem, and how did that experience shape your approach to tackling challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-world problem, and how did that experience shape your curiosity for process innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with combining different substances or materials, and what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied logical problem-solving to a complex challenge, and how did you adapt your approach when initial solutions failed?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with mixing different substances or building something, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you solved a complex problem using a systematic approach, and how did that experience shape your interest in applying science to real-world solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-life problem, and how did that experience shape your interest in pursuing a field that combines chemistry and engineering?",
    "criterion": "Skills"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your interest in pursuing this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you combined science and problem-solving to address a real-world challenge, and what sparked your curiosity in this approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did it spark your curiosity about process design?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that shape your interest in pursuing a field that transforms raw materials into everyday products?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with mixing substances or designing a simple process to solve a problem, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or improve a process, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your interest in engineering?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that impact your interest in pursuing a field that transforms raw materials into everyday products?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Have you ever designed or optimized a process to solve a real-world problem, and how did you apply scientific principles to achieve your goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Have you ever experimented with transforming raw materials into something useful, and how did that experience shape your curiosity about designing processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-life problem, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you observed a process involving chemical reactions or material transformations, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your interest in pursuing related fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with combining different substances or materials, and what did you learn from the process?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or optimize a process, and how did that impact your interest in STEM fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that impact your interest in engineering?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or optimize a process, and how did that impact your interest in STEM fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with mixing substances or observed a chemical reaction - what sparked your curiosity about the process?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or improve a process, and how did that impact your interest in pursuing a field that transforms raw materials into everyday products?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did it spark your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with mixing substances or designing a process to solve a real-life problem, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Have you ever designed or optimized a process to solve a real-world problem, and how did you apply scientific principles to achieve your goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or improve a process, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your interest in engineering?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or optimize a process, and how did that impact your interest in pursuing a field that transforms raw materials into valuable products?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-world problem, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-world problem, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or improve a process, and how did that impact your interest in pursuing a field that transforms raw materials into everyday products?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or improve a process, and how did that impact your interest in STEM fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that impact your interest in pursuing a field that transforms raw materials into everyday products?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your interest in pursuing a field that transforms raw materials into everyday products?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that spark your interest in further exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you combined science and problem-solving to create something new or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with mixing substances or observed a chemical reaction, and what sparked your curiosity in that moment?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-life problem, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-life problem, and how did that experience shape your interest in pursuing a field that transforms raw materials into everyday products?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or improve a process, and how did that impact your interest in pursuing a field that transforms raw materials into everyday products?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did it spark your interest in pursuing a field that transforms raw materials into everyday products?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that impact your interest in pursuing a field that transforms raw materials into everyday products?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or optimize a process, and how did that impact your interest in STEM fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-life problem, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-world problem, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you combined science and problem-solving to create something new or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-world problem, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with combining different substances or materials, and what sparked your curiosity about how they interact?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Have you ever designed or optimized a process to solve a real-world problem, and how did you apply scientific principles to achieve your goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you combined science and problem-solving to create something new or improve a process?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-world problem, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you combined science and problem-solving to create something new or improve an everyday process?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied problem-solving skills to optimize a process or improve efficiency in a project or activity?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did it spark your curiosity about process design?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-life problem, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-world problem, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Have you ever designed or optimized a process to solve a real-world problem, and if so, what inspired your approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Have you ever designed or optimized a process to solve a real-world problem, and if so, what inspired your approach to finding a solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with mixing substances or designed a simple process to solve a problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you combined science and problem-solving to create something new or improve a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your interest in engineering solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or improve a process, and how did that impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you applied scientific principles to solve a real-world problem, and how did that experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did it spark your interest in engineering solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you combined science and problem-solving to address a real-world issue, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied problem-solving skills to design or optimize a process, and how did that impact your interest in STEM fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with mixing substances or observed a chemical reaction, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemical Engineering",
    "school": "NUS",
    "question": "Can you describe a time when you experimented with combining different substances or materials, and what sparked your curiosity about the process?",
    "criterion": "Experiences"
  }
]