[
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how exploring it further could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the cultural differences between Chinese communities worldwide, and how might exploring these diversities shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how do you see this interest influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience that sparked your curiosity about Chinese culture, and how might exploring this further enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture or language sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience or encounter that sparked your curiosity about Chinese culture, language, or history, and how might exploring these interests shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see exploring this further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share a personal experience or encounter that sparked your curiosity about Chinese culture, language, or history, and how do you see this interest evolving?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Chinese tradition, language, or historical event that you'd like to explore in-depth and share with others?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever explored Chinese literature, history, or culture outside of school? How might deepening this exploration shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an aspect of Chinese culture, history, or society that fascinates you, and how exploring it further could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how might exploring it further shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a particular aspect of Chinese culture or history that you'd like to explore deeper in your future academic pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience or encounter that sparked your curiosity about Chinese culture, and how might exploring this further shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you explored how understanding Chinese culture and language could shape your global perspectives or career opportunities in a connected world?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how might exploring it further shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about Chinese culture or language sparked your curiosity, and how might this continue to inspire you in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share how exploring the rich cultural heritage and contemporary dynamics of China might shape your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the cultural nuances of Chinese traditions and how they shape global perspectives, inspiring you to explore further?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share a moment when you discovered something fascinating about Chinese culture, and how do you see this curiosity shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever explored Chinese literature, history, or culture outside of school, and how do you think these experiences might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how might exploring this further shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever encountered a moment where understanding Chinese culture or language helped you connect with others, and how did that experience shape your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about Chinese culture or language sparked your curiosity, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how ancient Chinese philosophies influence modern societal values, and how might exploring this intersection shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever found yourself fascinated by the nuances of Chinese culture or language, and how might exploring these interests shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about Chinese culture, language, or history, and how might exploring this further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about Chinese culture or history sparked your curiosity, and how do you see this fascination shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how do you see this fascination shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, culture, or history of China might shape your future goals or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an aspect of Chinese culture, history, or society that fascinates you and how exploring it further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture or language sparked your curiosity, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how Chinese language, history, or culture influences your own identity or global connections?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by how Chinese culture influences global trends, and how might exploring this intersection shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, culture, or history of China might enrich your personal growth or future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, language, or history, and how do you see this influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you explored any aspects of Chinese culture, history, or language that sparked your curiosity and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the cultural nuances of Chinese communities, and how might exploring these interests shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever found yourself fascinated by Chinese culture, language, or history, and how do you see exploring these aspects shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience that sparked your curiosity about Chinese culture, and how might exploring it further shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the diversity of Chinese cultures or languages, and how might exploring these interests shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Reflecting on your experiences, how do you think exploring the language, history, and culture of China could enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever encountered a moment where understanding Chinese culture helped you connect with others, and how might exploring this further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share how exploring the rich history, culture, and language of China might shape your global perspective or career aspirations in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see this interest shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how might exploring it further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the cultural nuances behind Chinese traditions or historical events that continue to influence modern society?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture or language sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you explored how understanding Chinese culture and language could enrich your future career or personal relationships in a globalized world?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever found yourself fascinated by the diversity of Chinese cultures or languages, and how might exploring these interests shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the rich cultural heritage or contemporary developments of a specific Chinese-speaking community, and how might exploring this interest shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience or encounter that sparked your curiosity about Chinese culture, and how might exploring this further shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the cultural nuances of China, and how might exploring its history and society enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how exploring it further might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience or encounter that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share how exploring the language, culture, or history of China might shape your future aspirations or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever explored Chinese literature, history, or culture outside of school, and how might these interests shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience or encounter that sparked your curiosity about Chinese culture, and how might exploring it further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, language, or history, and how do you see this influencing your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a particular aspect of Chinese culture or history, and how do you think exploring this further could enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how might exploring this further enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about Chinese culture or history sparked your curiosity, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a particular aspect of Chinese culture or history that you'd like to explore in-depth, and how might this knowledge shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how do you see exploring this interest shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how might exploring this further enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you explored any aspects of Chinese culture, history, or language that you believe could enrich your future career or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about Chinese culture or language sparked your curiosity, and how do you see this passion influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how understanding China's rich history and culture can help you navigate our increasingly globalized world?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about Chinese culture or language sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever found yourself drawn to understanding the nuances of Chinese culture or language, and how might exploring these interests shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by Chinese culture, and how do you think exploring its history and language could enrich your personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, history, or culture of China might enrich your personal growth or future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Chinese cultural practice or historical event that sparked your curiosity to learn more about its origins and impact?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see this interest shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about Chinese culture or language sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Chinese tradition, historical event, or cultural practice that sparked your curiosity to learn more about its origins and impact?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this continue to inspire your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about Chinese culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience where exploring a different culture or language challenged your assumptions, and how did that shape your interests or goals?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a different culture, like Chinese traditions, has influenced your perspective or decision-making in daily life?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "How do you think studying the evolution of Chinese languages and cultures can enrich your understanding of modern societal dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a time when exploring a different culture, such as through language, history, or traditions, sparked your curiosity, and how did you pursue it?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture or language challenged your perspectives, and how did that shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language challenged your assumptions, and how did that shape your perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience where exploring a foreign culture, like through language, history, or media, challenged your assumptions and broadened your perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, perhaps through language or traditions, sparked your curiosity or challenged your perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language challenged your assumptions, and how did that shape your interests or goals?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding Chinese culture or language helped you navigate a challenging situation or connect with someone from a different background?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language challenged your perspectives, and how did that shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an example of how understanding Chinese culture or language has helped you navigate a challenging social or academic situation?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture or language challenged your assumptions, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when exploring Chinese culture or language sparked your curiosity, and how do you see this interest shaping your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, culture, or history of a civilization like China's might enrich your personal growth or future career paths?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when understanding Chinese culture or language helped you navigate a challenging situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when understanding Chinese culture or language helped you navigate a challenging situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when understanding Chinese culture or language helped you connect with others or solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when exploring Chinese culture or language sparked your curiosity, and how do you think this interest could shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language broadened your perspective, and how might this curiosity benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share how exploring China's rich cultural heritage might shape your global perspectives or career aspirations in a rapidly changing world?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding Chinese culture or language helped you navigate a challenging situation or connect with others?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, history, or culture of a region like China has influenced your personal growth or career aspirations so far?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture, like Chinese traditions, helped you better understand your own values or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language challenged your assumptions, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, perhaps through language or traditions, sparked your curiosity and shaped your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture helped you navigate a challenging social situation, and how did you apply those lessons?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, perhaps through language or traditions, broadened your perspective or sparked personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did you delve deeper into it?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding a different culture helped you navigate a challenging situation, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "How do you think learning a new language like Mandarin could shape your worldview or enhance your career opportunities in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture or language challenged your assumptions, and how did that shape your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Chinese cultural practice or historical event sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding a different culture, perhaps through language or traditions, helped you navigate a challenging social or academic situation?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, perhaps through language, literature, or history, inspired a new perspective in you?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding Chinese culture or language helped you navigate a challenging situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience where understanding a different culture, particularly one related to East Asia, helped you navigate a challenging social or academic situation?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding a different culture or language helped you navigate a challenging situation, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how you pursued that interest further?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when understanding a different culture or language helped you connect with others, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "How do you think studying the evolution of Chinese language and culture can influence your perspective on global interactions in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language challenged your assumptions, and how did that shape your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when exploring Chinese culture or language sparked your curiosity, and how do you see this interest shaping your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding a different culture, perhaps through language or traditions, helped you connect with someone or solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "How do you think understanding Chinese culture and language can influence your interactions in a globalized, multicultural society and inform your future career choices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when understanding a different culture or language helped you navigate a challenging situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding a different culture, like Chinese traditions, helped you navigate a challenging social or academic situation?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when exploring a different culture or language sparked your curiosity, and how did you pursue that interest further?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when understanding a different culture helped you navigate a challenging situation, and how did that experience shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when exploring a foreign culture, like through a book or film, challenged your assumptions and broadened your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when exploring Chinese culture or language sparked your curiosity, and how you think this passion could shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language challenged your assumptions, and how did you adapt to this new perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language challenged your assumptions, and how did that shape your interests or goals?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, perhaps through language or traditions, broadened your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "How do you think studying the evolution of Chinese language and culture can enrich your perspective in an increasingly globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding a different culture or language helped you navigate a challenging situation, and how did you adapt?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when understanding Chinese culture or language helped you navigate a challenging situation, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, perhaps through language or traditions, sparked your curiosity and influenced your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, like Chinese traditions, helped you adapt or grow in a new environment?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an example of how learning about a different culture, like Chinese traditions, has broadened your perspective or influenced your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding Chinese culture or language helped you navigate a challenging situation or connect with others?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture, perhaps through language or traditions, sparked your curiosity and shaped your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when understanding a different cultural perspective, particularly from East Asia, helped you navigate a challenging situation or conversation?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture helped you navigate a challenging situation, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding a different culture or language helped you navigate a challenging situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, like Chinese traditions, helped you adapt or innovate in a personal or team project?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an example of how understanding Chinese culture or language has influenced your perspective or interactions, and how might you apply this in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience where learning about a different culture or language challenged your perspectives, and how did you adapt?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience where understanding a different culture, like Chinese traditions, helped you navigate a challenging social or academic situation?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, like Chinese traditions, helped you navigate a social or academic challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language challenged your assumptions, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share how exploring Chinese language, history, or culture has influenced your perspective on global issues or your own identity?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language challenged your perspectives, and how did that shape your interests or goals?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language challenged your perspectives, and how did you adapt to this new understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture or language challenged your assumptions, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language challenged your assumptions, and how did that shape your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring Chinese culture, history, or language has broadened your perspective, and how might this continue to shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share how exploring a foreign language and culture, like Chinese, might shape your worldview or career path in a globalized society?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a foreign culture, like through language or history, has broadened your perspective or influenced your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share how exploring a foreign language and culture, like Chinese, might shape your worldview and influence your future interactions in a globalized society?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding Chinese culture or language helped you navigate a challenging situation or connect with others?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a time when exploring a cultural difference or historical event sparked your curiosity, and how did you pursue that interest further?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding Chinese culture or language helped you navigate a challenging situation, and how did you apply that knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an example of how understanding a different culture, like Chinese traditions, has influenced your perspective or decision-making in a personal or academic?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding a different culture or language helped you navigate a challenging situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture or language challenged your assumptions, and how did that shape your worldview?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when exploring Chinese culture or language sparked your curiosity, and how do you think this passion could shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, perhaps through language or traditions, broadened your perspective, and how might this skill benefit your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture or language challenged your assumptions, and how did that shape your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language challenged your assumptions, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding a different culture or language helped you navigate a challenging situation or connect with someone new?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "How do you think understanding the evolution of Chinese language and culture can shape your perspective in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a different culture or language challenged your assumptions, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how you deepened that interest?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, culture, or history of a civilization like China's might shape your global perspectives or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding a different culture or language helped you navigate a challenging situation, and how did you adapt?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where understanding a different culture, like Chinese traditions, helped you navigate a social or academic challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an example of how understanding Chinese culture or language has helped you navigate a challenging situation or connect with others?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Chinese tradition or historical event helped you better understand a contemporary issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Could you share an experience where learning about a different culture, perhaps through language or traditions, sparked your curiosity or challenged your perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you engaged in any activities, such as language learning, cultural events, or community projects, that sparked your curiosity about Chinese culture or society?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this continue to inspire your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this continue to inspire you?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture, language, or historical perspective sparked your curiosity and influenced your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese language, culture, or history sparked your curiosity, and how might this continue to inspire you?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this continue to inspire your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever engaged with Chinese culture, language, or history in a way that sparked your curiosity about its broader societal implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever participated in or initiated a cultural event that deepened your understanding of Chinese heritage, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you explored Chinese culture, language, or history through travel, reading, or projects, and how might these experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion influence your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion influence your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you engaged in any activities or experiences that sparked your curiosity about Chinese culture, language, or history, and how did they impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you explored Chinese culture, language, or history through travel, school projects, or personal interests that sparked your curiosity about its global impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you engaged in activities or projects that deepened your understanding of Chinese culture, language, or history, and how did they inspire you?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this continue to inspire you in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity and how it might shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this continue to inspire you?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you explored Chinese culture, language, or history in ways that sparked your curiosity, and how might these experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how do you see this interest shaping your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you explored Chinese culture, language, or history through travel, reading, or projects, and how might these experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you explored Chinese culture, language, or history through travel, reading, or community involvement that sparked your curiosity for deeper academic exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion influence your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you explored Chinese culture, language, or history through travel, reading, or community activities that sparked your curiosity about its global influence?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how do you see this influencing your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how it might shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever explored Chinese culture, language, or history through personal projects, travel, or family traditions that sparked your curiosity for deeper learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or language sparked your curiosity, and how do you see this shaping your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you engaged in any activities or experiences that sparked your curiosity about Chinese culture, language, or history, and how might these shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you engaged in activities or projects that sparked your curiosity about Chinese culture, language, or history, and how did these experiences shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you engaged in any activities or projects that deepened your understanding of Chinese culture, language, or history, and how did they inspire you?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity and shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you explored Chinese culture, language, or history in ways that sparked your curiosity, and how might these experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how it relates to your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this continue to inspire you?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese language, culture, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture, language, or historical topic sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you ever engaged with Chinese culture, language, or history in a way that sparked your curiosity about its broader impact on society?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this continue to inspire you?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you engaged with Chinese language, literature, or culture through travel, family, or self-study that sparked your curiosity about its global impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you engaged in any activities or projects that sparked your curiosity about Chinese culture, language, or history, and how did they impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this continue to inspire you in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture, language, or historical perspective sparked your curiosity and shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion influence your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you explored Chinese culture, language, or history in ways that sparked your curiosity, and how might these experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a language, culture, or historical event sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this continue to inspire you?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this continue to inspire your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this continue to inspire your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this continue to inspire you?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture, language, or historical perspective sparked your curiosity, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion influence your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how do you see this shaping your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how do you see this shaping your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion influence your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture, language, or historical event sparked your curiosity, and how it might shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture, language, or historical topic sparked your curiosity, and how might that relate to your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you explored Chinese culture, language, or history through travel, school projects, or personal interests that sparked your curiosity about its broader implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Chinese culture, language, or history sparked your curiosity, and how might this passion influence your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did you delve deeper into it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Have you engaged with Chinese culture, language, or history in ways that sparked curiosity about its broader impact on societies or your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture, language, or historical perspective sparked your curiosity and influenced your goals?",
    "criterion": "Experiences"
  }
]