[
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever observed how people make daily choices and wondered how those decisions impact broader societal outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding how people make choices or how resources are allocated sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever analyzed everyday life decisions or global events through the lens of costs, benefits, and incentives, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever observed how people make daily choices, and how would studying these decisions impact your understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever noticed how everyday decisions, like buying your favorite snack, involve trade-offs, and how does that spark your curiosity about studying these choices?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of scarcity or trade-offs, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed a problem related to scarcity, choice, or decision-making, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions could impact your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've noticed how people make choices, and how understanding those decisions might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you observed the impact of scarcity or decision-making, and how it sparked your curiosity about understanding human behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've noticed how people make choices, and how understanding those decisions could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed how people make choices, and how exploring the 'why' behind these decisions excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share a recent experience where you observed how people make choices, and how it sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how understanding how people make choices or how resources are allocated has sparked your curiosity in everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how observing everyday life, like how people make choices, has sparked your curiosity about the world's economic systems?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've noticed how people make choices, and how exploring the 'why' behind these decisions excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your daily life where understanding how people make choices or how resources are allocated sparked your curiosity about studying economics?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've noticed how resources are allocated, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed the impact of scarcity or decision-making, and how it sparked your curiosity about understanding such phenomena?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've noticed supply and demand in action, and how it sparked your curiosity about understanding markets better?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed a trade-off between choices, and how did that spark your curiosity about decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about the underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of scarcity or trade-offs, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about how markets function?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your daily life where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how did that spark your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life or current events, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've noticed how people make choices, and how understanding those decisions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about decision-making in a global?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you observed the impact of supply and demand, and how it sparked your curiosity about understanding market dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how did that spark your curiosity about its broader implications?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how resources were allocated, and how it sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how did that spark your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about how markets function?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about decision-making in a global?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Could you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about understanding market behaviors?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever observed how people make daily choices and wondered how those decisions impact the world, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding the 'why' behind these decisions fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share a current event or personal experience that sparked your curiosity about how societies allocate resources or make financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Could you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to explore this field further?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever analyzed everyday situations, like pricing strategies at your favorite store, through an economic lens, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your daily life where you observed how people make choices, and how it sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you observed how people make choices, and how it sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where understanding how people make choices or how resources are allocated sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about the subject?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed a trade-off between costs and benefits, and how it sparked your curiosity about decision-making in life?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about the subject?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you observed the impact of scarcity or decision-making, and how it sparked your curiosity about human behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding the 'why' behind these decisions fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share a real-life situation where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever analyzed everyday decisions, like how people spend money or make choices, and wondered how they impact society?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of scarcity or trade-offs, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed supply and demand at play, and how did that spark your curiosity about how markets function?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where understanding how people make choices or how resources are allocated sparked your curiosity, and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about understanding such economic principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding how people make choices or how resources are allocated sparked your curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever analyzed everyday situations, like pricing strategies at your favorite store, and wondered about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where understanding how people make choices or how resources are allocated sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how did that spark your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you noticed the impact of scarcity or trade-offs, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed a problem related to resource allocation, and how it sparked your curiosity about understanding decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how did that spark your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed the impact of scarcity or trade-offs, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you observed the impact of supply and demand, and how did it spark your curiosity about the underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed how people make choices, and how understanding those decisions sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding the 'why' behind these decisions excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about how markets function?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles shaping everyday decisions, and how exploring this further excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share a real-life situation where you observed supply and demand in action, and how it sparked your curiosity about decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about how markets function?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions could impact your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how observing everyday life, like family budgeting or global events, has sparked your curiosity about how societies allocate resources?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where understanding how people make choices or how resources are allocated sparked your curiosity, and why it fascinated you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic principles could help you make better decisions in your daily life or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you noticed how people's choices or resources affected outcomes, sparking your curiosity to understand these dynamics better?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life or current events?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you observed the impact of scarcity or decision-making, and how it sparked your curiosity about understanding such phenomena?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your daily life where you noticed how people make choices, and how understanding those decisions could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share a moment when you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Could you share an example of how observing everyday life, like how people make choices, has sparked your curiosity about the world's resource allocation?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about decision-making in life?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever observed how people make daily choices, and how those decisions impact the world around them, sparking your curiosity to explore why?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical reasoning to solve it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice, and how you weighed the potential costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand, and how you think it impacted decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market transaction, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and how did that spark your curiosity in understanding decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, and how did you break it down?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, to demonstrate your critical thinking and decision-making skills?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand, and how you think it impacted people's choices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed the costs and benefits of a personal decision, and how did that influence your choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding between two options, and how you weighed the pros and cons?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand, and how did it influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, to understand its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, using logical reasoning and data?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice with limited resources, and how did you weigh the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed the trade-offs of a personal decision, and how did that experience shape your understanding of decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, to understand the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand, and how did it spark your curiosity about decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to make a difficult choice, and how did you weigh the potential costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how would you analyze its impact?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like deciding how to allocate your monthly allowance, and how did you weigh the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a real-world issue, like inflation or unemployment, and how you think studying economics could help you better understand such challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it spark your curiosity about economic principles?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to make a difficult choice involving trade-offs, and how did you weigh the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and considered the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it influence your understanding of decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice involving trade-offs, and how did you weigh the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and considered the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market or a social issue, to understand the underlying incentives or trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the potential impact of a new government policy on your local community's daily lives?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand, and how you think it impacted people's decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it spark your curiosity about economic principles?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed a real-world problem, like scarcity or decision-making, and how you think economic principles could be applied to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market transaction, to understand the motivations and decision-making behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a real-world problem, like a market trend or policy change, and how you approached understanding its impact?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market transaction, to understand the motivations behind people's choices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like managing your allowance, to make a more informed decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, using logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a price change, and predicted how it might impact people's behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the potential impact of a new government policy on everyday life, using only the resources you have?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand in action, and how did it influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your life where you had to make a difficult choice, and how you weighed the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice, and how you weighed the potential costs and benefits involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed the impact of a everyday decision, like choosing a part-time job, on your finances or time?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how would you analyze its impact?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like a price change, and considered how it might impact people's behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand, and how did it influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, and applied logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed the impact of a everyday decision, like choosing a part-time job, on your personal 'economy'?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a budget, and how you weighed the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice, and how you weighed the potential costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday situation, like managing your allowance, and applied logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the impact of a new government policy on everyday life, using only the resources you have as a student?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like deciding on a budget, and how you weighed the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it spark your curiosity about decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you had to make a difficult choice, and how did you weigh the pros and cons of each option?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand, and how did it influence your understanding of decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market or a personal decision, using logical reasoning to understand the underlying motivations or outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, and how did you break it down?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your life where you had to make a difficult choice, and how did weighing the pros and cons influence your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, to understand the underlying trade-offs and decision-making processes involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and what insights did you gain from it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a choice with limited resources, and how you balanced competing priorities?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market transaction, to understand the motivations or decisions behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the potential impact of a new public policy on your local community's economy?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, to inform a decision or opinion?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a real-world problem, like a market trend or policy change, to understand its broader impact?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and considered the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand in action, and how would you analyze its impact?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it spark your curiosity about decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to make a difficult choice, and how did you weigh the potential costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, to inform a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market transaction, to understand the motivations behind people's choices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it spark your curiosity about decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your daily life where you had to weigh the costs and benefits of a decision, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to weigh the pros and cons of a decision, and how did that influence your choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to make a difficult choice, and how did you weigh the potential costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed a problem by weighing the costs and benefits, and how did this experience shape your decision-making approach?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice with limited resources, and how you balanced competing priorities?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed the costs and benefits of a personal decision, and how did that influence your choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand, and how did it influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a real-world issue, like a market trend or policy change, to understand its broader impact?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical reasoning to find a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the motivations behind people's choices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a real-world problem, like a market trend or social issue, to better understand its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to make a difficult choice with limited resources, and how did that experience shape your decision-making approach?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding between two options, and how you weighed the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, and how you formed an opinion about it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction or a personal purchase, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the motivations of the people involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a real-world problem, like a market trend or personal finance decision, to understand the underlying motivations or incentives?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed the costs and benefits of a personal decision, and how did that influence your choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed scarcity or trade-offs in your daily life, and how you've made a decision in that situation?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical thinking to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market transaction or a personal decision, to understand the underlying incentives or trade-offs at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the potential consequences of a new tax policy on everyday consumer behavior, using examples from your own experiences?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, and how did you apply logical reasoning to find a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how did that spark your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy, and explain how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the forces driving those decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed or experienced the impact of scarcity or trade-offs, and how it influenced your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how did that spark your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices with limited resources, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices or how resources are allocated, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people make choices, and how that sparked your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about global systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about its broader impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices with limited resources, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how did that spark your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of decision-making on resource allocation in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy change, and explain how it sparked your curiosity about decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that influence your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices or allocate resources, and how did that spark your curiosity about understanding decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed how people make choices or observed patterns in everyday life, sparking your curiosity about human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of economic principles in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices, and how did that spark your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the underlying reasons?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices with limited resources, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that influence your understanding of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that insight spark your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices with limited resources, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of economic principles in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people make choices with limited resources, and how did that influence your understanding of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world of resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how did that spark your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy change, and explain how it sparked your curiosity about how societies allocate resources?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how did that spark your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people made choices with limited resources, and how did that influence your curiosity about decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world problem, like a market trend or social issue, and how it sparked your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that influence your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices, and how that insight might shape your future decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices, and how did that spark your curiosity about human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices, and how did that shape your understanding of decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices, and how that insight might shape your future decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices or decisions, and how did that spark your curiosity about understanding human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of economic decisions in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices or allocate resources, and how did that spark your curiosity about understanding these decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world problem, like a market trend or policy decision, and how it sparked your curiosity about how societies allocate resources?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make decisions, and how did that spark your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about its broader impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices or observed the impact of scarcity, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life situation where resources were scarce, and how you think it was resolved?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about global systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people make choices, and how that sparked your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever analyzed everyday situations, like how people make choices or how resources are allocated, and found them intriguing?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding how people make choices or how resources are allocated sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed a problem related to resource allocation, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you observed the impact of scarcity or decision-making, and how it sparked your curiosity about understanding such phenomena?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about decision-making in a global?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever observed how people make daily choices and wondered how these decisions impact the world around us?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever observed how people make daily choices, and how would studying the principles behind these decisions impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where understanding how people make choices or how resources are allocated sparked your curiosity, and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where understanding how people make choices or how resources are allocated sparked your curiosity, and why it fascinated you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed a problem related to scarcity or decision-making, and how it sparked your curiosity about understanding human behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you noticed how people make choices, and how that sparked your curiosity about understanding decision-making patterns?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've noticed the impact of scarcity or trade-offs, and how it sparked your curiosity about understanding such phenomena?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed a problem related to resource allocation, and how it sparked your curiosity about underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how observing everyday life, like how people make choices, has sparked your curiosity about the world's resource allocation?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about the subject?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about understanding economic principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you noticed the impact of supply and demand, and how it sparked your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you observed how people make choices with limited resources, and why it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed a trade-off between costs and benefits, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how resources were allocated, and how did that spark your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how resources were allocated, and how it sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you noticed how people make choices, and how understanding those decisions sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about the subject?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share a moment when you observed how people make choices, and how it sparked your curiosity about the world's resource allocation?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share a recent experience where you noticed how people make choices, and how understanding those decisions sparked your curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Could you share an everyday situation where you've observed how people make choices, and how understanding the 'why' behind these decisions excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you noticed how people make choices with limited resources, and why that observation sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where understanding how people make choices or how resources are allocated sparked your curiosity, and why it fascinated you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where understanding how people make choices or how resources are allocated sparked your curiosity about studying this field?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about understanding economic principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed a problem related to resource allocation, and how it sparked your curiosity about understanding decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Could you share an example of how observing everyday life, like a market transaction or a policy change, sparked your curiosity about how societies allocate resources?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've noticed the impact of supply and demand, and how it sparked your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of scarcity or trade-offs, and how it sparked your curiosity about understanding these dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people make choices, and how understanding the 'why' behind those decisions sparked your curiosity about human behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about how markets function?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed how people make choices, and how exploring the 'why' behind these decisions excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've noticed the impact of scarcity or trade-offs, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share a real-life situation where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how did that spark your curiosity about how markets work?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share a real-life situation where you observed the impact of scarcity or decision-making, and how it sparked your curiosity about the underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about how markets function?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed a problem related to resource allocation, and how would you approach solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever observed how people make daily choices, and are you curious to learn how these decisions impact societies and global markets?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about decision-making in a global?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding how people make choices or how resources are allocated sparked your curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, sparking your curiosity to explore this field further?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you observed how people make choices, and how understanding the 'why' behind these decisions sparks your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed a problem related to scarcity or decision-making, and how it sparked your curiosity about understanding human choices?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your life where you noticed how people make choices, and how understanding those decisions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've noticed the impact of supply and demand, and how it sparked your curiosity about understanding such economic principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you observed the impact of supply and demand, and how it sparked your curiosity about how markets function?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you observed supply and demand in action, and how did that spark your curiosity about decision-making in everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how observing everyday life, like spending habits or market trends, has sparked your curiosity to understand decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever observed how people make daily choices and wondered how those decisions impact the world around them?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your daily life where you noticed how people make choices, and how understanding those decisions might shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, and how exploring this further excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where understanding how people make choices or how resources are allocated sparked your curiosity, and why it fascinated you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about understanding such economic principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share a real-life situation where you observed how people make choices with limited resources, and how did that spark your curiosity about the subject?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about decision-making in a global?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of scarcity or decision-making, and how it sparked your curiosity about understanding human behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed supply and demand in action, and how it sparked your curiosity about decision-making in a global?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your life or observations where understanding how people make choices or how resources are allocated sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've observed the impact of scarcity or decision-making, and how it sparked your curiosity about the subject?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Could you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about understanding such economic principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Could you share an everyday situation where you've observed supply and demand in action, and how did that spark your curiosity about how markets function?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you observed a connection between choices people make and the consequences that follow, sparking your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life or current events, sparking your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've noticed the impact of scarcity or trade-offs, and how it sparked your curiosity about understanding these dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life or current events, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your daily life where you observed a problem related to resource allocation, and how you think it could be improved?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about understanding market behaviors?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you noticed how people make choices, and how understanding those decisions could impact your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of supply and demand, and how it sparked your curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share a current event or personal experience that sparked your curiosity about how people make choices or how resources are allocated?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've noticed the impact of supply and demand, and how it sparked your curiosity about understanding such economic principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, and how exploring these concepts further excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a real-life situation where understanding how people make choices or how resources are allocated sparked your curiosity, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed the impact of scarcity or trade-offs, and how it sparked your curiosity about understanding such phenomena?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Have you ever observed how people make daily choices, and how those choices impact the world around them?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share a recent experience where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you noticed how people make choices, and how understanding those decisions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an everyday situation where you've noticed the impact of supply and demand, and how did that spark your curiosity about understanding market behaviors?",
    "criterion": "Interests"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed the costs and benefits of a personal decision, and how did that experience shape your understanding of decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, using logical reasoning and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've analyzed a real-world problem, like a market trend or personal financial decision, to make a more informed choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, to understand its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed the costs and benefits of a personal decision, and how did that influence your choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, to understand how people make choices with limited resources?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice with limited resources, and how did you weigh the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding how to spend your allowance, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like deciding on a purchase, using logical reasoning and what insights did you gain?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed supply and demand in action, and how might understanding this concept influence your future decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your life where you had to weigh the costs and benefits of a decision, and how did that influence your choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand, and how did it influence your decision-making or perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you had to make a difficult choice with limited resources, and how you weighed the pros and cons?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice involving trade-offs, and how you weighed the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like managing your allowance, to understand the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to make a difficult choice, and how did you weigh the potential costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to make a difficult choice involving trade-offs, and how did you weigh the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you had to make a difficult choice involving trade-offs, and how did you weigh the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice with limited resources, and how you weighed the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a real-world problem, like a market trend or social issue, and explain how you broke it down?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the potential impact of a new government policy on everyday people's lives and the economy?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to make a difficult choice, and how did you weigh the pros and cons?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market or a social issue, and how did that spark your curiosity about human decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like deciding on a purchase, and how you weighed the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, and how you made a decision to optimize the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a decision with limited resources, and how did you weigh the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed the impact of a everyday decision, like choosing a part-time job, on your personal 'economy'?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed scarcity or trade-offs in your daily life, and how would you analyze it using basic economic principles?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical thinking to find a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed the impact of a decision on resources, and how did that shape your understanding of trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, and considered the trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, and how did you break it down to understand its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you had to make a difficult choice with limited resources, and how did you weigh the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life or community, and how did that spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market or a social issue, to understand the incentives or trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to make a difficult choice with limited resources, and how did you weigh the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of scarcity or trade-offs, and how would you analyze the situation using economic thinking?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it spark your curiosity about decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-world problem, like inflation or unemployment, and how you think it could be addressed?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to make a difficult decision with limited resources, and how did you weigh the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, using logical reasoning and data?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, to inform a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, using logical reasoning and weighing trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical reasoning to find a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like a price change, and what insights did you gain from it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden price hike on consumer behavior in your local community?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice, and how you weighed the potential costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, using logical reasoning and what insights did you gain?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a real-world problem, like a market trend or social issue, to understand its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand, and how did it spark your curiosity about decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like managing your allowance, to make a more informed decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed the impact of a decision on resources, and how did that influence your understanding of trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity in your daily life, and how you'd approach solving it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice with limited resources, and how did you weigh the pros and cons?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a price change or a market trend, to predict human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding between two options, and how you weighed the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your life where you had to make a choice with limited resources, and how did you weigh the pros and cons?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed the impact of a everyday decision, like choosing a part-time job, and considered how broader economic factors influenced your choice?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the potential impact of a new government policy on your local community's spending habits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed a real-life example of supply and demand in action, and how did it spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice, and how you weighed the potential costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the motivations behind people's choices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, and what insights did you gain?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and applied logical reasoning to find a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a decision with limited resources, and how you weighed the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice with limited resources, and how did you weigh the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, and how you applied logical reasoning to make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice involving limited resources, and how did you weigh the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a complex issue, like a social problem or market trend, to understand its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you noticed how people's choices affect outcomes, and how you'd analyze this situation to predict future behaviors?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to weigh the costs and benefits of a decision, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a difficult choice with limited resources, and how did you weigh the trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've applied logical reasoning to understand a real-world issue, and how it sparked your curiosity about human decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like deciding on a purchase, using logical reasoning and what insights did you gain?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you had to make a difficult choice, and how you weighed the pros and cons of each option?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your daily life where you observed a trade-off between cost and benefit, and how you would analyze it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday problem, like managing your allowance, and applied logical reasoning to make a better decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the motivations behind people's choices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed the trade-offs between two everyday choices, and how did that decision impact your understanding of resource allocation?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you had to make a difficult choice, and how did you weigh the costs and benefits of your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your daily life where you had to make a choice involving trade-offs, and how did you decide?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday situation, like a market transaction, to understand the underlying motivations or incentives at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to make a difficult decision involving trade-offs, and how did you weigh the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market or a personal decision, using logical reasoning to understand the underlying incentives?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your life where you had to make a difficult choice, and how did you weigh the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example from your life where you observed a problem related to resource allocation, and how would you approach solving it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a everyday problem, like managing your allowance, to understand the underlying decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a everyday situation, like a market or a personal decision, to understand the incentives or trade-offs involved?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles at play in your daily life, and how that sparked your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you had to make a difficult choice involving trade-offs, and how did you analyze the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices or resources are allocated, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand, and how it sparked your curiosity about decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about understanding decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world problem, such as a market trend or social issue, and how it sparked your curiosity about understanding human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed the impact of a real-world event on people's behavior or financial decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how did that spark your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how did that spark your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people made choices about scarce resources, and how did that influence your curiosity about human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a real-world problem, like a market trend or policy change, and how it sparked your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life situation involving trade-offs or resource allocation, and how it sparked your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that influence your curiosity about decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of economic principles in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to make a choice with limited resources, and how did that experience shape your decision-making approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people made choices with limited resources, and how did that spark your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity, choice, or trade-offs in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about understanding decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices or resources are allocated, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that influence your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed or experienced a real-world problem that made you curious about how societies allocate resources?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life example of supply and demand in action, and how did it spark your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity, choice, or incentives in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the forces driving those decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people make choices, and how that sparked your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity, choice, or trade-offs in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that spark your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a real-world issue, such as a market trend or policy change, and how it sparked your curiosity about human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how did that spark your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how did that spark your curiosity about the factors influencing decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of economic principles in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people made choices with limited resources, and how did that spark your curiosity about decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that spark your curiosity about everyday decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life situation where resources were scarce, and how you think it was resolved?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy, and explain how it sparked your curiosity about how societies allocate resources?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people made choices with limited resources, and how did that influence your curiosity about decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed how people make choices or observed patterns in everyday life that sparked your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a real-world problem, like a market trend or policy, and how it sparked your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how resources were allocated, and how did that influence your understanding of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices with limited resources, and how did that spark your curiosity about everyday decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the underlying reasons?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how resources were allocated or decisions were made, and how that sparked your curiosity about understanding these processes better?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how resources were allocated, and how did that influence your understanding of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices or allocate resources, and how that sparked your curiosity about understanding decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed the impact of a real-world event on people's choices or resources, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of economic decisions in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed or experienced the impact of scarcity or decision-making in your daily life or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices or resources are allocated, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices or observed the impact of scarcity, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices with limited resources, and how did that influence your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices, and how that insight might shape your future decisions or career?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed a real-world issue, like a market trend or policy change, and how it sparked your curiosity about human decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you observed how people make choices, and how that sparked your curiosity about the underlying decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices, and how that insight might shape your future decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed a real-world issue, like a market trend or policy change, and explain how it sparked your curiosity about decision-making or resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you share an experience where you observed how people make choices, and how that sparked your curiosity about the forces driving decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed how people make choices, and how that experience sparked your curiosity about the world's resource allocation?",
    "criterion": "Experiences"
  }
]