[
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how this relates to your own future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Reflecting on your future goals, how do you think understanding property markets and economic trends could shape your career choices or personal investment decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how this relates to your own future goals or interests?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an example of how understanding property markets or housing trends might influence your future career choices or personal financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience or observation that sparked your curiosity about how property markets shape our cities or economies?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how property values or housing markets impact people's lives, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how people make decisions about spaces or properties, and what sparked your curiosity about those choices?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share how understanding property markets and economic trends might shape your future career goals or daily decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how that relates to your own future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how people make decisions about buying, selling, or renting properties, and how those choices impact our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how property or location impacted everyday life, sparking your curiosity about its economic influences?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how property values or housing markets impact people's lives, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how people or businesses make location choices, and how that sparked your curiosity about the economic factors at play?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how property markets shape city development, and how that might influence your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever thought about how people make decisions about buying or renting homes, and how this impacts city development?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you observed how property values or housing markets impact people's lives, and why it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how property values or housing markets impact everyday life, and how you might influence these dynamics in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and what drives those choices in your community?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how property values or housing markets impact daily life, sparking your curiosity in this area?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how people make decisions about buying, selling, or renting properties, and how this impacts our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how that relates to your own future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever thought about how people make decisions about buying or renting homes, and how that relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Could you share how understanding property markets or housing trends might shape your future career choices or personal investment decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting properties, and how this relates to your future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how people make decisions about buying, selling, or renting properties, and what factors influence these choices in your community?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Imagine designing a dream city - how would you balance housing affordability with profitability, and what sparks your curiosity about this kind of decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and what sparks your curiosity about these kinds of economic choices?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're planning a dream city - how would you balance economic growth with affordable housing, and why does this challenge excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how property values or housing markets impacted people's lives, sparking your curiosity in this area?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience where you noticed how property or location impacted people's lives, sparking your curiosity in this connection?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and does exploring the economic factors behind these choices intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Could you share an example of how you've observed property markets or housing trends impacting daily life, and why does this intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how people make decisions about spaces or properties, and how that sparked your curiosity about the subject?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how property values or housing markets impacted people's lives, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how property values or housing markets impact people's lives, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see yourself applying economic principles to make informed decisions about property, spaces, or urban development?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how people make decisions about buying, selling, or renting properties, and how these choices impact individuals and communities?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how property values or housing markets impact everyday life, and how understanding these dynamics could shape your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how the value of a property is determined, and would exploring the economic forces behind such decisions excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and how this relates to your own future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience where you noticed how property values or housing markets impact daily life, sparking your curiosity about their underlying economic drivers?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how property values or housing markets impacted your community, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and what sparks your curiosity about the forces shaping housing markets?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Could you share how understanding property markets and economic trends might shape your future career or daily decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how property values or housing markets impact everyday life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're planning a city's future - how would you balance economic growth with the need for affordable housing, and why does this challenge excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience where you noticed how property values or housing markets impact people's lives, sparking your curiosity in this area?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how property markets or housing policies impacted your community, sparking your curiosity about their economic influences?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how property markets shape city life, and how would you contribute to making urban spaces more livable and sustainable?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience where you observed how people make choices about spaces or properties, and how that sparked your curiosity about the underlying decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience or observation that sparked your curiosity about how people make decisions about spaces, homes, or properties?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever thought about how people make decisions about buying, selling, or renting properties, and how those choices impact our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever thought about how people make decisions about buying, selling, or renting properties, and how that impacts our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how that relates to your own future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and how this impacts communities and economies?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how property or location impacted people's lives, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience or observation that sparked your curiosity about how property markets influence economic growth or personal wealth?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how property values or housing markets impact everyday life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how property markets shape cities, and how would you contribute to making urban spaces more livable?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how this relates to your own future goals or daily life?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you noticed how people's living or working spaces influenced their behavior, and how that sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting properties, and how this relates to your own future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how that relates to your own future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how this relates to your own future goals or aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how this relates to your own future aspirations in advising on property investments?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see understanding property markets and economic trends impacting your career choices or personal investment decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how property markets shape our cities, and how would you contribute to making urban spaces more livable?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an example of how observing property trends or living situations has sparked your curiosity about how people make decisions regarding land and housing?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience where you observed how property values or housing markets impacted everyday life, sparking your curiosity in this area?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and does that fascinate you to learn more about the underlying economic principles?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how this relates to your own future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience where you observed how property values or housing markets impact everyday life, sparking your curiosity in this area?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a moment when you realized how people's decisions about property or housing impacted their lives or communities, sparking your curiosity in this area?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how people or businesses made decisions about property or spaces, and what sparked your curiosity about those choices?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how people make decisions about spaces, homes, or properties, and what intrigued you about those choices?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting properties, and how this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how people make decisions about buying, selling, or renting properties, and what factors influence those choices in your community?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you observed how people make decisions about spaces, homes, or properties, and why it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you observed how people or businesses make decisions about space, and why it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see understanding property markets and economic trends shaping your career goals or personal decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share how understanding property markets and economic trends might shape your future career or personal investment decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where understanding how people make decisions about homes or land sparked your curiosity, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how this relates to your future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever thought about how people make decisions when buying or renting homes, and how that impacts city development?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how property or location impacted people's lives, sparking your curiosity about its economic influences?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how property values or housing markets impacted everyday life, sparking your curiosity in this area?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you've observed how property values or housing markets impact people's lives, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you observed how property values or housing markets impact people's lives, and why did that fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience or observation that sparked your curiosity about how property markets shape our cities or economies?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see understanding property markets and economic trends shaping your career or personal investment decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how that relates to your own future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience where you noticed how property values or housing markets impacted people's lives, sparking your curiosity in this area?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share how understanding property markets and economic trends might shape your future career or personal goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Could you share how understanding property markets or urban development might shape your future career goals or personal passions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between buying versus renting a home in a rapidly growing city like Singapore?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a new public transport line on local housing prices in your neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed how people make choices about living spaces, and how that experience sparked your curiosity about market dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed how people make decisions about valuable resources, and how that insight might shape your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed how changes in your neighborhood, like new shops or housing, might impact local living costs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how location or market trends influence property values, and how would you apply such insights in a future career?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed how changes in your neighborhood, like new shops or housing, might impact local residents?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when deciding where to live?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how location affects property prices in your neighborhood, and how would you apply such observations to make informed decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed how people make decisions about spaces, like homes or shops, and how that impacts communities?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, cost, and lifestyle when choosing a first apartment?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and amenities when deciding where to live, and what insights you'd apply to future housing markets?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when deciding where to live in a city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between investing in a sustainable community project versus a high-rise luxury development?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed how people make decisions about spaces or resources, and what insights did you gain from it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you noticed how the value of a property might be influenced by its location or surroundings?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when deciding where to live in a new city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed how people make decisions about spaces or resources, and what insights did you gain from it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed how changes in your neighborhood, like new shops or housing, impacted local living costs or quality of life?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when deciding where to live in a new city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a new public transportation system on local property values in your neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when choosing your first independent living space?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and amenities when deciding where to live, and why?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed how people make decisions about valuable resources, and how that insight could inform property market trends?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how location affects property prices? How would you approach researching and advising on a friend's first home purchase?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed how people make choices about where to live, and how you think this relates to your future career goals?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when choosing a first home in a bustling city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between developing a green park versus building a commercial mall in a bustling city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed how changes in your neighborhood, like new developments, might impact local businesses or residents?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed how people make choices about spaces, and how that insight could inform property decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how housing markets impact local communities, and how would you balance economic growth with affordable housing needs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when advising a friend on their first home purchase?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how a new public transport line might impact property values in a neighborhood, and how would you approach this analysis?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when deciding where to live in a new city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, cost, and lifestyle when deciding where to live in a city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between investing in a sustainable community project versus a luxury housing development?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you observed how people make choices about living spaces, and how you think those choices impact the community?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed how people make choices about where to live, and how that impacts city development?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, cost, and lifestyle when choosing a first apartment, and what this reveals about your decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between investing in a sustainable community project versus a luxury housing development?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when choosing your first rental apartment?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when choosing a neighborhood to live in?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between investing in a sustainable community project versus a luxury housing development?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you've observed how property values or housing markets impact daily life, and how would you analyze this observation?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when deciding where to live in a new city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed how changes in supply and demand might impact property values in a neighborhood you're familiar with?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed how changes in supply and demand might impact a local neighborhood's property values?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between buying versus renting a home in a city with rising property prices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you've observed how people make decisions about spaces, like choosing a home or a favorite hangout spot?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between buying versus renting a home in a rapidly growing city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between investing in a new shopping mall versus a residential complex in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how people make choices about living spaces, and how would you analyze those decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed how people make choices about where to live, and how that impacts local communities?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when choosing a first home in a competitive market?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you had to make a tough decision involving trade-offs, and how did you weigh the costs and benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between buying versus renting a home in a rapidly growing city like Singapore?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between developing a green park versus building a commercial complex in a bustling city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed how changes in your neighborhood, like new shops or housing, might impact local living costs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when deciding where to live?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when choosing a first home in a competitive market?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you observed how property values or housing markets impact everyday life, and how would you analyze this observation?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a new public transport line on local housing prices in your neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when advising a friend on their first apartment purchase?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and amenities when choosing your first apartment?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between buying versus renting a home in a rapidly growing city like Singapore?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when deciding where to live in a new city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed how changes in your neighborhood, like new shops or housing, might impact local living costs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to weigh the costs and benefits of a personal decision, and how did that experience shape your understanding of value and trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between buying versus renting a home in a rapidly growing city like Singapore?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between investing in a sustainable urban development project versus a traditional one?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between renting versus buying a home in a city with rising property prices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you analyzed how people make decisions about valuable resources, and how that experience sparked your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, cost, and lifestyle when deciding where to live in a new city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between investing in a sustainable property versus a traditional one in a growing city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when choosing a first home in a competitive market?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between developing a green park versus building a shopping mall in a bustling city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when choosing a first apartment, and what insights you'd apply to a career?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between investing in a high-rise apartment versus a suburban home in a growing city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed how people make decisions about spaces or resources, and what insights did you gain from it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between buying versus renting a home in a rapidly growing city like Singapore?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting properties, and how these choices impact markets and communities?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between buying versus renting a home in a booming city, considering both financial and lifestyle factors?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a new public transport line on local housing prices in your neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between investing in a sustainable urban development project versus a traditional one?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when choosing a first home in a bustling city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between investing in a high-end residential project versus a mixed-use development in a growing city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and amenities when deciding where to live, and how does this relate to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to balance personal preferences with financial constraints, and how did that influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, cost, and lifestyle when choosing a place to live, and why?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed how changes in your neighborhood, like new developments, might impact local living costs or quality of life?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when deciding where to live in a city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between buying versus renting a home in a rapidly growing city like Singapore?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between investing in a new shopping mall versus residential housing in a growing city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a new public transport line on local property values in your neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and amenities when choosing a first apartment?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed how changes in your community, like a new mall, might impact local housing prices?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how location affects property prices, and how would you apply this insight to a hypothetical investment decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, affordability, and lifestyle when choosing a first home in a competitive market?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, cost, and lifestyle when deciding where to live in a new city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, cost, and lifestyle when deciding where to live in a new city?",
    "criterion": "Skills"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties in your community, and what insights did you gain?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever observed how people make decisions about spaces, like choosing a home or a favorite hangout spot - what did you learn from this?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how people make decisions about spaces, homes, or properties, and how that sparked your curiosity about their economic value?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you explored how property markets or urban planning impact daily life, and how might studying these areas shape your future career goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces, homes, or properties, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and how that impacts communities?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how people make decisions about spaces, homes, or properties, and how that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and what sparked your curiosity in this area?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and what insights did you gain from observing these choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you observed how property values or housing markets impact everyday life, and how did that influence your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or using spaces, and what sparked your curiosity about these everyday economic choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or using spaces like homes or shops - can you share an example?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how people make decisions about spaces, homes, or locations, and how that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever observed how people make decisions about buying, selling, or using spaces, and how might this curiosity shape your future studies or career?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how property values or housing markets impacted your community, and how did that influence your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties in your community, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces or resources, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces, like homes or shops, and what insights you gained from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and what insights did you gain from observing these choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how people make decisions about spaces or properties, and how that sparked your curiosity about their economic value?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces, homes, or locations, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or using spaces, and how this relates to your future career goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever observed how property values or housing markets impact people's lives, and how might you explore these dynamics further in your studies?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how people make decisions about spaces, homes, or properties, and how that sparked your curiosity about their economic value?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or using properties, and how this relates to your own future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces, homes, or properties, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you explored how property markets or urban planning impact daily life, and how might this interest shape your future career choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and what factors influence these choices in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about spaces, like where to live or work, and what factors influenced your own choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how property values or housing markets impacted people's lives, sparking your curiosity about the economics behind it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and what sparked your curiosity about these choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and how this relates to your future career goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or using spaces, and how this relates to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how property values or housing markets impacted your community, and how did that influence your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how location or market trends impact property values, and how might this curiosity shape your future career decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about spaces, like choosing a home or a favorite hangout spot, and what insights did you gain?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how people make decisions about spaces, homes, or locations, and what sparked your curiosity about these choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and how this relates to your future career goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how people make decisions about spaces, homes, or properties, and what intrigued you about those choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or using spaces like homes or shops - can you share an example?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you analyzed how people make decisions about spaces, like homes or shops, and how that impacts communities?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and what insights did you gain from observing these choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever observed how people make decisions about living spaces or properties, and how do you think these choices impact communities?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how people make decisions about spaces, homes, or properties, and how that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you observed how property values or housing markets impacted people's lives, and how did that influence your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces, homes, or properties, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how people make decisions about spaces, homes, or properties, and what sparked your curiosity about these choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how people make decisions about spaces, homes, or locations, and how that sparked your curiosity about the underlying factors?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make choices about spaces or resources, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how location or market trends might impact a property's value, and how did that spark your curiosity in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces, homes, or properties, and what insights did you gain?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how people make decisions about spaces, homes, or properties, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you explored how property markets or urban development impact daily life, and how might this interest shape your future career goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how property values or housing markets impact people's lives or decisions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever observed how property values or housing markets impact your community, and how might this spark your interest in understanding these dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how would you apply this curiosity to future studies?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how property values or housing markets impacted your community, and how did that influence your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how property values or housing markets impact people's lives, sparking your curiosity in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces, homes, or properties, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and what sparked your curiosity in these everyday economic choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever observed how property values or housing markets impact your community, and how might you contribute to shaping these dynamics in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and how this relates to your own future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces, homes, or properties, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you explored how property markets impact everyday life, and how might understanding these dynamics shape your future career choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you observed how people make decisions about spaces, homes, or properties, and how that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how property values or housing markets impact everyday life, and what sparked your curiosity about this connection?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces, homes, or properties, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting properties, and how that relates to your own future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever observed how property values or housing markets impact your community, and how might this curiosity shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make choices about spaces, homes, or locations, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties in your community, and what insights did you gain?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how people make decisions about spaces, homes, or locations, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how people make decisions about spaces, like homes or shops, and how that sparked your curiosity about the forces shaping these choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces, like homes or shops, and what insights did you gain?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever observed how people make decisions about living spaces or properties, and how do you think this relates to your future career goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties in your community, and what insights did you gain?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties in your community, and what insights did you gain?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how property values or housing markets impacted your community, and how did that influence your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties, and how this relates to your own future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces, homes, or properties, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how property values or housing markets impact people's lives, sparking your curiosity in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties in your community, and what insights did you gain?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you explored how property markets or urban development impact daily life, and how might understanding these dynamics shape your future career choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how location or market trends impact property values, and how might this curiosity shape your future career goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about spaces, like homes or shops, and how these choices impact communities or the environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how people make decisions about spaces, homes, or properties, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how people make decisions about spaces or properties, and how that sparked your curiosity about the field?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying, selling, or renting properties in your community, and what insights did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever observed how people make decisions about buying, selling, or renting properties in your community, and how might these interactions shape your career interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces, homes, or locations, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you analyzed how people make decisions about spaces, homes, or locations, and what insights you gained from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes in your community, and what insights did you gain from observing these choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how location or market trends impact property values, and how might this curiosity shape your future career choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how property values or housing markets impacted your community, and what sparked your curiosity about this issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you explored how property markets impact everyday life, and can you share an experience where you observed or influenced a decision related to space or resources?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever observed how property values or housing markets impact daily life, and how might understanding these dynamics shape your future career choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you observed how property values or housing markets impacted your community, and how did that influence your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever observed how property values or housing markets impact your community, and how might you analyze or influence such trends in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you observed how people make decisions about spaces, homes, or properties, and how that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics (Real Estate)",
    "school": "SMU",
    "question": "Have you ever observed how people make decisions about living spaces or properties, and how do you think this relates to your future career goals?",
    "criterion": "Experiences"
  }
]