[
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring the nuances of language or literature sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your reading habits, what draws you to exploring the nuances of language, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing sparked new perspectives for you, and how might this continue to enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favourite books or authors, how do you see exploring literature shaping your perspectives or career paths in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring the nuances of language or literature sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or discussing a literary work sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever lost track of time while reading a novel or exploring a poet's work, and how do you see such experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language sparked your curiosity, and how it might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or analyzing a literary work sparked new perspectives for you, and how might such experiences shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favourite books or authors, how do you see exploring literary works shaping your understanding of the world or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or analyzing a literary work sparked new insights for you, and how it influenced your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language sparked your curiosity, and how did that moment shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or inspired by a poem, and wondered how you could share that passion with others?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you think exploring literary works in-depth could shape your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your understanding of the world or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favourite books or authors, how do you see exploring literary works shaping your communication skills or worldview in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or analyzing a literary work sparked new insights for you, and how it influenced your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or analyzing a literary work sparked your curiosity, and how it influenced your goals or perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you think exploring diverse literary works could shape your worldview or inform your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favourite books or authors, how do you see exploring literary works shaping your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or analyzing a literary work deeply impacted you, and how you think such experiences could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever lost track of time reading a book, and how might exploring literature further enrich your personal growth or career path?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language sparked your curiosity, and how it might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever analyzed a novel or poem that challenged your perspectives, and how did that experience shape your appreciation for literature's impact on society?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or analyzing a literary work sparked new ideas or perspectives for you?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked joy or curiosity for you, and how do you see this passion evolving in your future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see nurturing this passion in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how might such experiences shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing sparked your curiosity, and how that experience relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever lost track of time while reading a novel or analyzing a poem, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or language sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favourite books or authors, how do you see exploring literature shaping your understanding of the world or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked your curiosity, and how you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favourite books or authors, how do you see exploring literary works shaping your communication skills or worldview in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when exploring a literary work or language sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your future perspectives or career pathways?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever lost track of time reading a novel or analyzing a poem, and how do you see such experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective or sparked personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or language sparked your curiosity, and how might this passion influence your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing sparked your curiosity, and how might exploring literature further enrich your personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your reading or writing experiences, how do you see exploring literary works and language shaping your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language deeply impacted you, and how might this relate to your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing sparked your curiosity, and how might that passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you think exploring literary works in-depth could shape your perspective or career path?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you see exploring literary works from diverse cultures shaping your worldview or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your perspective or communication skills in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your future perspectives or career pathways?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring the nuances of language or literature sparked your curiosity, and how might this continue to enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked a new perspective for you, and how might exploring language further enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever imagined a career where you could use storytelling to inspire change, and how might that align with your passions?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or analyzing a literary work sparked your curiosity, and how do you see such experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language concept sparked your curiosity, and how did that shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever imagined a career where you craft compelling stories or analyze influential texts - what draws you to the power of language?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your perspective or career path in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you see exploring literary works shaping your communication skills or worldviews in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked your curiosity, and how it influenced your goals or perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or inspired by a poem, and how do you see storytelling shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing sparked your curiosity, and how might this passion influence your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you see exploring literary works shaping your perspectives or career aspirations in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your future perspectives or career paths?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing sparked your curiosity, and how might this passion influence your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked a new perspective for you, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you think exploring literary works from diverse cultures will shape your perspective and future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring the nuances of language or literature sparked your curiosity, and how do you see this passion evolving in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your future perspectives or career paths?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever imagined a career where writing, storytelling, or critical analysis play a key role, and what excites you about that possibility?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or analyzing a literary work sparked new ideas or perspectives for you?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or analyzing a literary work sparked new insights for you, and how did that shape your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language deeply impacted you, and how you see this shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring the nuances of language or literature sparked your curiosity, and how might this continue to inspire you in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or language sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your communication skills or worldview in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever lost track of time while reading a book or analyzing a poem, and how does that experience relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language deeply impacted you, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or inspired by a poem, and how do you see storytelling shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or analyzing a literary work deeply resonated with you, shaping your perspectives or sparking new interests?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or discussing a literary work sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked your curiosity, and how might exploring this passion further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing sparked your curiosity, and how you envision this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favourite books or authors, how do you see exploring literature shaping your perspectives or career aspirations in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you think exploring diverse literary works could shape your perspective or career path?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspective, and how did that impact your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspective, and how did that influence your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a new perspective, and how did that shape your thoughts?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a play sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a new perspective, and how did that impact your thoughts or actions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how would you apply this skill in a future role?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that shape your own thoughts?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work profoundly impacted your perspective, and how you'd apply that insight in a real-world conversation?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a new perspective, and how did that impact your own thoughts or actions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work deeply impacted your perspective, and how would you analyze its themes to others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or poem deeply impacted you, and how would you analyze its literary elements to others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or analyzing a complex text changed your perspective, and how you applied that new insight?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how you've used creative writing or critical analysis to express your thoughts or persuade others, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary text helped you develop a deeper understanding of a social issue or human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film sparked a new perspective for you, and how did you apply it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading a challenging literary text helped you develop a new perspective or skill that you applied in a real-life situation?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that shape your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where effective communication or creative writing helped you achieve a personal goal or connect with others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work helped you develop a deeper understanding of human experiences or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or analyzing a text helped you develop a new perspective, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that shape your own thoughts?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a film challenged your perspective, and how did that influence your thoughts or actions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a new perspective, and how would you apply this skill in the future?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film sparked a new perspective for you, and how did that impact your views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or crafting an essay helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or analyzing a text helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary character's journey helped you better understand human motivations or behaviors?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where you used creative writing or critical analysis to convey a meaningful message or persuade an audience?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a play profoundly impacted your perspective, and how would you analyze its literary elements?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play sparked a new perspective for you, and how did that impact your views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a film sparked a new perspective for you, and how did you apply it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact your own thoughts or actions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work deeply impacted your perspective, and how would you share its significance with others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work profoundly impacted your perspective, and how would you analyze its themes to others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film inspired you to think differently, and how did you apply that new perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a play sparked a new perspective for you, and how did you apply it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play profoundly impacted your perspective, and how would you analyze its literary elements?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a new perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a play sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a new perspective, and how did that impact your own thoughts?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or analyzing a text helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or analyzing a text helped you develop a new perspective or skill?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film sparked a meaningful conversation, and how did you contribute to it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or analyzing a text helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspective, and how did that shape your views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading literature or writing creatively has helped you develop a new perspective or empathy for others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a film sparked a new perspective for you, and how you applied that insight?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or analyzing a text helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how would you apply that skill in the future?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a film sparked a new perspective for you, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing sparked a new perspective for you, and how did you apply this insight afterwards?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where effective communication helped you achieve a goal, and how do you think refining this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a play profoundly impacted your perspective, and how would you analyze its literary elements?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading or writing has helped you navigate a challenging situation or changed your perspective on a social issue?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where you used creative writing or persuasive communication to make an impact, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading a novel or poem sparked a new perspective for you, and how you'd apply this habit to future challenges?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film sparked a new perspective for you, and how did that impact your views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film inspired you to think differently, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or analyzing a literary text helped you develop a new perspective, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or poem profoundly impacted your perspective, and how you'd analyze its literary devices to others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that shape your thoughts?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or writing a piece significantly impacted your perspective, and how did that shape your voice?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary text helped you better understand a social issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary text helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a new perspective, and how did that impact your thoughts or actions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how you've used persuasive writing or storytelling to convey a message that resonated with your audience?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or film helped you develop a deeper understanding of social issues or human experiences?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary text helped you develop a deeper understanding of a social issue or human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play profoundly impacted your perspective, and how would you analyze its literary elements now?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading a novel or watching a play has influenced your perspective on a social issue?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that shape your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a film challenged your perspective, and how did that influence your communication style?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that shape your own thoughts?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing sparked a new perspective for you, and how did that shape your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing sparked your curiosity, and how you explored those new ideas further?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play sparked a new perspective for you, and how did you apply it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspective, and how did that impact your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a film sparked a new perspective for you, and how did you apply it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a play sparked a new perspective for you, and how you applied it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play sparked a new perspective for you, and how did that shape your thoughts?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or analyzing a text helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspectives, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a film sparked a new perspective for you, and how did you apply it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that shape your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspective, and how you applied that new insight?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a play sparked an insight that changed your perspective, and how would you analyze that text now?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a new perspective, and how did that impact you personally?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or analyzing a complex text helped you develop a new perspective, and how did that impact your thoughts or actions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading a challenging text or novel helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading or writing has influenced your perspective on a social issue, and how might this impact your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or challenged your way of thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop new perspectives or challenge your own assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you grow or shaped your perspective in a meaningful way?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice that surprised you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand different perspectives, and how did that shape your views?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective or helped you develop valuable skills?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or challenged your thinking in some way?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a new perspective, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when exploring literature or creative writing helped you understand different perspectives or cultures?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or challenged your way of thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop new perspectives or skills that excite you for future growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice that you're eager to further cultivate?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand different perspectives, and how did that shape your thoughts?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand different perspectives, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective or voice, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective or helped you navigate real-life challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a new perspective, and how did that shape your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when exploring literature or creative writing helped you develop a new perspective or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective or skill that might benefit your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading, writing, or discussing a literary work sparked a new perspective or passion in you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective on life or shaped your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective or voice, shaping your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, and how might this growth benefit your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a new perspective, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has helped you develop a new perspective or voice in your own life?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, shaping your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when exploring literature or creative writing helped you understand different perspectives or express your own voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has helped you develop a new perspective or voice in your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading or writing has helped you navigate a challenging situation or sparked a new perspective for you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing a literary work sparked a new perspective for you, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading, writing, or discussing a literary work deeply impacted your perspective, and how did that influence your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading or writing has helped you navigate a challenging situation or sparked a new perspective in your life?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective or helped you navigate real-life situations?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop new perspectives, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing a literary work inspired a new perspective or influenced your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you understand different perspectives or cultures?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective or voice, shaping your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or crafting your own writing sparked new perspectives or self-discovery for you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that shape your own views?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language deeply impacted your perspective, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language deeply impacted your perspective, and how might such moments shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice that you're eager to further cultivate?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when exploring literature or creative writing helped you understand different perspectives or cultures, shaping your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand different perspectives, and how did that shape your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or challenged your way of thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop new perspectives or challenged your thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or challenge your own assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective or helped you develop a valuable skill?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective on the world or shaped your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective or helped you develop valuable skills?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a new perspective, and how did that impact your own views?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing a literary work sparked your curiosity or changed your perspective in some way?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand different perspectives, and how did that shape your own views?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop new perspectives or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective or helped you develop a valuable skill?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading or writing has helped you navigate a challenging situation or sparked personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or challenged your way of thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading, writing, or discussing literature helped you understand a new perspective or challenge your own?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading or writing has helped you navigate a challenging situation or sparked personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a new perspective, and how did that shape your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever felt the impact of a well-crafted story or poem, and how might exploring literature further enrich your personal or professional life?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever imagined a career where storytelling or effective communication is key? What excites you about shaping messages that inspire others?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked joy or curiosity in you, and how might this passion influence your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or language sparked your curiosity, and how do you see this passion influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked joy in you, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever lost track of time reading a novel or analyzing a poem, and how might exploring such texts shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your understanding of the world or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever imagined a career where storytelling or effective communication could be your primary tool, and what excites you about that possibility?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when exploring a literary work or language sparked your curiosity, and how do you see this passion influencing your future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading or writing has influenced your perspective, and how you see this shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your perspective or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favourite books or authors, how do you see exploring literary works shaping your perspective or communication skills in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favourite books or authors, how do you see exploring literary works shaping your communication skills or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you see exploring literary works from diverse cultures shaping your worldview or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favourite books or authors, how do you see exploring literature helping you develop skills or perspectives valuable to your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing sparked your curiosity, and how might exploring such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see nurturing this passion in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you think exploring literary works in depth could shape your worldview or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your communication skills or perspective in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or discussing a literary work deeply resonated with you, shaping your thoughts or perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your future perspectives or career paths?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your communication skills or career aspirations in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or analyzing a literary work sparked a new perspective for you, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language sparked your curiosity, and how it might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked a new perspective for you, and how might you continue exploring this passion?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your personal growth or future career paths?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever analyzed a novel or poem that challenged your perspectives, and how did that experience shape your desire to explore language further?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked a new perspective for you, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever lost yourself in a novel or poem, and how do you see storytelling shaping your voice or career in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your perspectives or career paths in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever imagined a future where your passion for reading and writing could inspire others, and how might that shape your career path?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how you envision this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading or writing has influenced your perspective on life, and how might this continue to shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever imagined a career where storytelling or effective communication is key, and how might studying literature help you achieve that goal?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how might such experiences shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or analyzing a literary work sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever lost yourself in a novel or poem, and if so, what sparked that connection for you?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when exploring a literary work or language deeply impacted you, and how might such experiences shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked your curiosity, and how might exploring such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language sparked your curiosity, and how it might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your reading habits, what aspects of exploring literary works or creative writing excite you about shaping your future studies or career?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your personal growth or future career paths?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how you see such experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your communication skills or worldview in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your understanding of the world or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or inspired by a poem, and how might exploring such creative expressions shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or discussing a literary work sparked your curiosity, and how do you see such moments shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or inspired by a poem, and how do you see such experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how might such experiences shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you think exploring literary works in depth could shape your perspectives or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favourite books or authors, how do you see exploring literary works shaping your communication skills or worldviews in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your worldview or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or language sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever been moved by a novel, poem, or speech, and how do you see the power of language shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favourite books or authors, how do you see exploring literary works shaping your communication skills or worldviews in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you think exploring diverse literary works could shape your worldview or future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring the nuances of language or literature sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or inspired by a poem, and how might exploring such literary works shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked a new perspective for you, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your communication skills or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language sparked your curiosity, and how do you see this passion influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever analyzed a novel or poem that challenged your perspectives, and how did that experience shape your desire to delve deeper into literature?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked joy in you, and how do you envision this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language deeply impacted you, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when exploring a literary work or language sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing sparked your curiosity, and how might that passion shape your future goals or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how might exploring language further enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Have you ever lost track of time reading a book or writing a story, and how do you see storytelling shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or analyzing a literary work sparked a new perspective for you, and how did that impact your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how might exploring literature further enrich your personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing sparked your curiosity, and how you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring the English language or literature sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how you envision this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favourite books or authors, how do you see exploring literary works shaping your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing sparked your curiosity, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your reading habits, how do you see exploring literary works shaping your perspective or communication skills in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring the nuances of language or literature sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or analyzing a literary work sparked a new perspective for you, and how did that impact your interests?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your understanding of the world or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language sparked your curiosity, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your perspectives or career aspirations in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading a challenging literary text helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or writing a piece significantly impacted your perspective, and how did that influence your goals?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play significantly impacted your perspective, and how would you analyze its literary elements?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play challenged your perspective, and how did that impact your communication or empathy skills?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work profoundly impacted your perspective, and how would you analyze its themes to others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a play challenged your perspective, and how would you analyze its impact on your views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that shape your thoughts?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play profoundly impacted your perspective, and how would you analyze its literary elements?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you navigate a challenging situation, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or analyzing a text helped you develop a new perspective, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a deeper understanding of societal issues or human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play helped you develop empathy or challenge your perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or writing a piece helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play challenged your perspective, and how did that shape your thoughts on communication?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a film sparked a new perspective for you, and how did you apply it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play profoundly impacted your perspective, and how would you analyze its literary elements?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading a novel or poem has broadened your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or poem sparked a new perspective for you, and how did that impact your views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or writing a piece helped you develop a new perspective or skill, and how?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading a novel or watching a film challenged your perspective, and how you applied this new insight?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a film sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or analyzing a complex text helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a film sparked a new perspective for you, and how you applied it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or analyzing a text helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film sparked a new perspective for you, and how did you apply it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work has influenced your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you navigate a challenging situation, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film sparked a meaningful reflection, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspectives, and how did that influence your views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading or writing has influenced your perspective on a social issue, and how might this impact your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading a novel or poem influenced your perspective, and how might such insights impact your future interactions or career choices?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play profoundly impacted your perspective, and how would you analyze its literary elements?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspective, and how did that shape your views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how would you apply this skill in the future?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or analyzing a text significantly influenced your perspective or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspectives, and how did that influence your own writing or communication style?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play sparked a new perspective for you, and how did you apply it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or analyzing a text helped you develop a new perspective or challenged your existing beliefs?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where effective communication or creative writing helped you achieve a goal or connect with others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or analyzing a literary work challenged your perspective, and how did that shape your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading a novel or watching a film challenged your perspective, and how you applied that new insight?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work helped you develop a new perspective, and how do you think this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a play sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a new perspective, and how would you apply this skill in a future role?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading a novel or watching a film challenged your perspective, and how you applied that new insight?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that shape your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play challenged your perspective, and how did that impact your views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that shape your thoughts?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or analyzing a literary work changed your perspective, and how do you think such insights will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or poem sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play sparked a new perspective for you, and how did that impact your views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading a novel or poem broadened your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where effective communication helped you achieve a goal, and how do you think refining this skill will impact your future?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or analyzing a literary work changed your perspective, and how do you think such skills will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that shape your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspective, and how did you grow from it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film sparked a new perspective for you, and how did that impact your views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a new perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or analyzing a text helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a complex idea or connect with others, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact your own thoughts?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film sparked a new perspective for you, and how did you apply it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play inspired you to think differently, and how would you apply that insight in real life?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or analyzing a literary text challenged your perspectives, and how did that shape your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play profoundly impacted your perspective, and how would you analyze its literary elements?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a film challenged your perspective, and how did that influence your communication style?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspective, and how did that shape your views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or analyzing a literary work deeply impacted your perspective, and how would you apply this skill in the future?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that shape your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a new perspective, and how did that impact your own thoughts or actions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a film sparked a new perspective for you, and how did you apply it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or analyzing a text helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspective, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play sparked a new perspective for you, and how did you apply it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a play challenged your perspective, and how did that shape your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you navigate a complex situation, and how did that shape your communication approach?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a novel or watching a film challenged your perspective, and how you applied that new insight?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a play sparked a new perspective for you, and how would you share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or poem sparked a new perspective for you, and how you'd share that insight with others?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing sparked a new perspective for you, and how did you apply this insight in a creative or practical way?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a new perspective, and how did that shape your thoughts?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film sparked a new perspective for you, and how you applied it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film sparked a new perspective for you, and how did you apply it?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspective, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or watching a play sparked a new perspective for you, and how did that impact your thoughts or actions?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or analyzing a complex text helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or analyzing a literary work changed your perspective, and how do you think this skill will benefit your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work profoundly impacted your perspective, and how you'd apply that insight in a real-world conversation?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you navigate a challenge, and how did that shape your perspective on communication's power?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading a literary work or watching a film helped you develop empathy or challenge your perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary character's motivations helped you better understand human behavior or societal norms?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading a literary work or watching a film challenged your perspective, and how you applied that new insight?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Skills"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop new perspectives or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you navigate a challenge or connect with others in a meaningful way?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective or voice, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a new perspective, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand different perspectives, and how did that shape your thoughts?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, shaping your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective, and how might this shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading or writing has helped you navigate a challenging situation or sparked a new perspective for you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has helped you develop a new perspective or voice in your own life?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective or skill that excites you about future growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or crafting your own writing sparked new perspectives or self-discovery for you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing a literary work sparked new perspectives for you, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or crafting your own writing sparked new insights or perspectives for you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective or voice, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, shaping your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has helped you develop a new perspective or voice in your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you grow personally or sparked a new perspective, and why was it impactful?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has helped you develop a new perspective or voice in your own life?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you navigate a challenge or connect with others in a meaningful way?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand different perspectives, and how did that shape your views?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice that you still carry with you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or writing project helped you develop a new perspective or skill that excites you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice that surprised even yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading or writing sparked a new perspective for you, and how did that shape your interests or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a new perspective, and how did that shape your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective or helped you develop a particular skill?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that impact your own views?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that impact your own thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has helped you develop a new perspective or voice in your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective or communication style?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading or writing has helped you navigate a challenging situation or sparked personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you grow personally or sparked a new perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language deeply impacted your perspective, and how might such moments shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective or helped you develop valuable skills?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you navigate a challenging situation or sparked a new perspective for you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading, writing, or discussing literature helped you understand a new perspective or challenge your own views?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a new perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when exploring literature or creative writing helped you develop a new perspective or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective or communication style in unexpected ways?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop new perspectives or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language deeply impacted your perspective, and how might such moments shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective on the world or shaped your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective on the world or shaped your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you navigate a challenge or understand a different perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you navigate a challenge or understand a different perspective, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop new perspectives, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a new perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading or writing has helped you navigate a challenging situation or sparked a new perspective for you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective or voice, shaping your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or skills that might shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice that surprised even yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective or communication style in unexpected ways?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, shaping your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective or skill that excites you for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective or skill that you think will benefit your future?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a different perspective, and how did that shape your own views?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how reading or writing has influenced your perspective or decision-making in a personal or academic?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or crafting your own writing sparked new perspectives or self-discovery for you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective or skill that you think will benefit your future?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand different perspectives, and how did that shape your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has influenced your perspective or communication style in meaningful ways?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an example of how exploring literature or creative writing has helped you develop a new perspective or voice in your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading, writing, or discussing a literary work sparked your curiosity or changed your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice that surprised you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or communicate ideas more effectively?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop new perspectives or challenged your way of thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop new perspectives or challenged your thinking in meaningful ways?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a new perspective, and how did that shape your thoughts?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading or writing helped you understand a new perspective, and how did that shape your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, and how might this impact your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop a new perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or language concept deeply impacted your perspective, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you describe a moment when reading, writing, or discussing literature helped you understand a new perspective or challenged your own views?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where exploring literature or creative writing helped you develop a new perspective or voice, shaping your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English",
    "school": "NTU",
    "question": "Can you share an experience where reading, writing, or discussing literature helped you develop new perspectives or challenged your thinking?",
    "criterion": "Experiences"
  }
]