[
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite book, how do you think exploring its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite book, how do you see exploring literary themes and analysis shaping your understanding of the world or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel or poem, and how might exploring such works shape your understanding of the world or yourself?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever read a novel or poem that changed your perspective, and how do you see exploring such transformative texts shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost track of time reading a novel, and how do you think exploring literary works will shape your perspective or career?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that resonated with you, and how did it shape your perspective or spark curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem sparked a new perspective for you, and how do you see such experiences shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever read a book that changed your perspective, and how do you think exploring such transformative texts could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when a book or poem deeply impacted you, and how that experience shapes your desire to explore literary works further?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a novel, and if so, what drew you to its characters, themes, or worlds, sparking a desire to explore further?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite books, how do you see exploring their historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem sparked a new perspective for you, and how you applied it to your life?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever connected with a character or theme in a novel that sparked a desire to explore its deeper meanings and cultural significance?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem deeply impacted you, and how did that influence your desire to explore literary works further?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on a book that deeply impacted you, how do you see exploring literary works shaping your worldview or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem sparked a new perspective for you, and how you think exploring such texts could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem deeply impacted you, and how do you see such experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem deeply impacted you, and how it influenced your perspective or curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost track of time reading a novel or poem, and how do you see storytelling shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem deeply impacted you, and how do you see such experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel or poem, and if so, what drew you to that story, and how do you see such experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on a book that deeply impacted you, how do you think exploring literary works could shape your perspectives or career path?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel and wondered how its themes or characters might shape your perspective on real-world issues?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem deeply resonated with you, and how it influenced your perspective on life?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem deeply impacted you, and how you think exploring such works could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when a book or story deeply impacted you, and how you think exploring such works could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite book, what themes or characters resonated with you, and how do you think exploring such literary elements could enrich your future studies or career?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel or poem, and if so, what drew you to its characters, themes, or language, inspiring you to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost track of time reading a novel or poem, and how do you see such immersive literary experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem sparked a new perspective for you, and how that relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite book, how do you think exploring its themes and characters in-depth could shape your understanding of human experiences?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflect on a book that deeply impacted you - how do you see reading and analyzing literature shaping your perspectives or career path?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel or poem, and if so, what drew you to that story, and how do you think exploring such works could enrich your life or career?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a book or character that profoundly impacted you, and how did that shape your perspective or curiosity about storytelling?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem deeply impacted you, and how you think such experiences could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a novel's world, and how do you think exploring such literary realms could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel or poem, and if so, what drew you to its characters, themes, or language?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel or poem, and how do you think exploring such works could shape your worldview or career path?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever found yourself lost in the world of a novel, and how do you think exploring such literary journeys could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite books, how do you think exploring literary themes and characters could shape your understanding of human experiences and inform your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite reads, how do you see exploring literary works shaping your understanding of diverse cultures and informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever been deeply moved by a novel or poem, and if so, how do you see storytelling shaping your understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem deeply impacted you, and how you think exploring such works will shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a novel's world, and if so, how do you think exploring such literary realms could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost track of time while reading a novel, and how do you think exploring such immersive stories can shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever been deeply moved by a novel or poem, and if so, what sparked your emotional connection to the story or characters?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever connected with a character or theme in a novel that sparked a desire to explore its deeper meanings or cultural significance?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem deeply resonated with you, and how it influenced your perspective or sparked new interests?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favourite book, what themes or characters resonated with you, and how do you see exploring such literary elements shaping your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost track of time while immersed in a novel, and how do you see reading shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite books, how do you see exploring literary themes and analysis shaping your understanding of human experiences and societal issues?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem sparked a new perspective for you, and how did that impact your life?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite books or authors, how do you see exploring literary works shaping your understanding of the world and informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite book, how do you think exploring its themes and characters in-depth could shape your perspective or career choices?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel or poem, and if so, what drew you to that story, and how might exploring such works shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem deeply impacted you, and how you see such experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when a book or story deeply impacted you, and how you think exploring such texts could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when a book or story deeply impacted you, and how do you see such experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem deeply impacted you, and how it influenced your perspective on life or society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite book or author, how do you see exploring literary works shaping your understanding of the world and informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost track of time while reading a novel, and how do you think such immersive experiences could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel or poem, and if so, how did that experience shape your perspective on life or spark new interests?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel or poem, and if so, how do you think exploring such texts could shape your understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite book, how do you think exploring its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem sparked a new perspective for you, and how did that impact your life?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem sparked a new perspective for you, and how do you see such experiences shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a novel or poem, and how do you think exploring such works could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel or poem, and if so, how did that experience shape your perspective on life or inspire your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem deeply impacted you, and how you think exploring such works will shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem deeply impacted you, and how that experience shaped your desire to explore literary works further?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem sparked a new perspective for you, and how did that impact your views on life?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a novel's world, and if so, how do you see storytelling shaping your understanding of diverse cultures and societies?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem deeply impacted you, and how it influenced your perspective on life or society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever been deeply moved by a novel or poem, and if so, how do you think studying literary works could enrich your life or career?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when a book or character deeply impacted you, and how it shaped your perspective on life or society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite books, how do you think exploring diverse literary works could shape your worldview or inform your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite book, how do you see reading and analyzing literary works shaping your perspective or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem deeply resonated with you, and how it shaped your perspective or sparked new interests?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost track of time while reading a novel, and if so, what drew you into that imaginary world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost track of time while reading a novel, and how do you think exploring such immersive stories can shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever read a book that changed your perspective, and how do you see exploring more literary works shaping your future views?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a novel, and if so, how do you think exploring literary works could shape your perspective or career?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem sparked a new perspective for you, and how did that impact your way of thinking?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem deeply impacted you, and how that experience shapes your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a novel's themes or characters, and how might exploring such literary works shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel or poem, and if so, what sparked your curiosity to explore its deeper meanings or themes?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem sparked a new perspective for you, and how do you see such experiences shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel and wondered how its themes or characters might shape your perspective on life or inform your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever found yourself lost in the world of a novel or inspired by a poem, and wondered how you could explore these passions further?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite book, how do you think exploring its themes and characters in depth could shape your perspectives or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite book, what themes or characters resonated with you, and how do you think exploring such literary elements could enrich your future studies or career?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite book, what sparked your curiosity, and how do you see exploring literary works shaping your perspective or career?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite books or authors, how do you think exploring literary works in depth could shape your worldview or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite book, what aspects of storytelling or character development inspire you to explore literary works further in your studies?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem deeply impacted you, and how it influenced your perspective on life or society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem deeply resonated with you, and how it influenced your perspective or sparked new interests?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost track of time while reading a novel, and how do you think exploring such immersive stories could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel or poem, and how do you think exploring such works could shape your future perspectives or career?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem deeply impacted you, and how it influenced your perspective on life or society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Reflecting on your favorite reads, how do you see exploring literary works shaping your worldview or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a new perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a moment when reading a novel or poem profoundly impacted your perspective, and how you'd apply that insight to analyze other texts?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that profoundly impacted you, and how do you think its themes or characters continue to influence your perspective today?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when a literary work deeply impacted you, and how you'd analyze its themes to inspire others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when a literary work deeply impacted you, and how did that influence shape your perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's development in a novel helped you understand human behavior or societal issues better?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's journey in a novel has influenced your perspective on personal growth or relationships?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a novel that profoundly impacted you, and how analyzing its themes or characters might shape your perspective in future studies or careers?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a moment when a literary work challenged your perspective, and how you'd apply that critical thinking to real-world issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a new perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work challenged your perspective, and how did that shape your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where analyzing a character's motivations in a novel helped you better understand human behavior or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's journey in a novel has influenced your perspective on personal growth or relationships?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where analyzing a character's motivations in a novel helped you better understand human behavior or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss how analyzing a novel's characters has helped you understand real-life relationships or societal dynamics, and why this skill matters to you?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a novel that profoundly impacted you, and how analyzing its themes or characters has influenced your perspective or communication style?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where analyzing a character's motivations in a novel helped you better understand human behavior or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that profoundly impacted you, and how you'd analyze its themes to inspire meaningful discussions in diverse groups?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that resonated with you and explain how analyzing it has influenced your perspective or communication skills?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a literary work that profoundly impacted you, and how analyzing its themes or characters might refine your critical thinking for future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's development in a novel has influenced your understanding of human behavior or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that profoundly impacted you, and how do you think its themes or characters continue to influence your perspective today?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a novel that challenged your perspectives and how analyzing its themes might shape your critical thinking in future academic or professional pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a deeper understanding of human experiences or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem helped you understand a different perspective, and how might this skill benefit your future?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a literary work that resonated with you and explain how analyzing it has influenced your perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss how analyzing a novel's themes has influenced your perspective on real-life issues or relationships?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a literary work that resonated with you, and how analyzing its themes or characters has influenced your perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading a novel or poem has influenced your perspective on life, and how might this shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a moment when reading a novel or poem deeply impacted you, and how you'd analyze its themes or characters to others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's motivations in a novel helped you develop a deeper understanding of human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that profoundly impacted you, and how its themes or characters continue to influence your perspectives today?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem deeply impacted you, and how you'd analyze its themes or characters to others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a novel or poem has influenced your perspective on a social issue or personal challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a new perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where analyzing a character's development in a novel helped you understand a real-life situation or relationship better?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a literary work that challenged your perspectives, and how analyzing it helped you develop critical thinking or empathy skills?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss how analyzing a novel's themes helped you develop a deeper understanding of societal issues, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem deeply impacted you, and how you applied its themes or lessons to a real-life situation?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that challenged your perspective, and how analyzing it helped you develop critical thinking or empathy?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a novel or poem that challenged your perspectives, and how analyzing it influenced your critical thinking or empathy?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem deeply impacted your perspective, and how you'd apply that analytical lens to unfamiliar texts?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's journey in a novel helped you develop empathy or a new perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's journey in a novel helped you develop a deeper understanding of human motivations or behaviors?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a moment when a literary work profoundly impacted you, and how you'd apply those analytical skills to unfamiliar texts in the future?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a novel or poem has influenced your perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that profoundly impacted you, and how analyzing it influenced your perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's motivations in a novel helped you develop a new perspective on real-life relationships?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that profoundly impacted you, and how analyzing it influenced your perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when a literary work deeply impacted you, and how you'd analyze its themes in a way that resonates with others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss how analyzing characters in novels has helped you understand people's motivations in your own life?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where analyzing a character's motivations in a novel helped you better understand human behavior or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading a novel or poem helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's journey in a novel helped you develop a deeper understanding of human motivations?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss how analyzing characters from novels helps you understand real people's motivations, and how might this skill benefit your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work changed your perspective, and how do you think this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem profoundly impacted your perspective, and how would you analyze its literary elements to others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a deeper understanding of human experiences or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a new perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where analyzing a literary character's motivations helped you understand a broader social issue or human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a deeper understanding of human experiences or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's motivations in a novel helped you develop a deeper understanding of human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's development in a novel has helped you understand human motivations or behaviors better?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem profoundly impacted your perspective, and how do you think such experiences shape who we are?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's journey in a novel helped you develop a new perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where analyzing a character's motivations in a novel helped you understand a real-life situation or relationship better?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's development in a novel helped you understand human motivations, and how might this skill benefit your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a literary work that challenged your perspectives, and how analyzing it influenced your critical thinking or communication skills?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's journey in a novel helped you better understand human motivations or behaviors?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a moment when a literary work challenged your perspective, and how you'd apply such critical thinking to future academic or career pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem deeply impacted you, and how you'd analyze its themes to others?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a literary work that profoundly impacted you and how you'd analyze its themes to inspire a creative project of your own?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that profoundly impacted you, and how you'd analyze its themes to a diverse group of peers?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem profoundly impacted your perspective, and how you applied that insight in a real-life situation?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's development in a novel helped you better understand human motivations or behaviors?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a literary work that profoundly impacted you, and how analyzing it influenced your perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a literary work that challenged your perspectives, and how analyzing it helped you develop critical thinking or empathy skills?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a novel or poem has influenced your perspective on a social issue or personal challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a literary character's motivations helped you better understand human behavior or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss how analyzing characters' motivations in novels has influenced your understanding of human behavior, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's journey in a novel has influenced your perspective on real-life challenges or relationships?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where analyzing a literary character's motivations helped you better understand human behavior or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a literary work that resonated with you, and how analyzing it has influenced your perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's journey in a novel has influenced your perspective on real-life relationships or personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that resonated with you and explain how analyzing it has influenced your perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that profoundly impacted you, and how do you think its themes or characters continue to influence contemporary society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading a novel or poem has influenced your perspective, and how you think this habit will benefit you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where analyzing a literary character's motivations helped you understand a broader social issue or human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a literary work that challenged your perspectives, and how analyzing it helped you develop critical thinking or empathy skills?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's development in a novel helped you better understand human behavior or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a novel or poem helped you develop a deeper understanding of human experiences or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's motivations in a novel helped you better understand human behavior or societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a literary work that resonated with you, and how analyzing it shaped your perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how analyzing a character's journey in a novel helped you better understand human motivations or behaviors?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you discuss a moment when a literary work challenged your perspective, and how you applied this new insight to a real-life situation?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where analyzing a literary character's motivations helped you better understand human behavior, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when a literary work profoundly impacted your perspective, and how do you think such insights could shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that deeply resonated with you, and how analyzing it influenced your perspective on life or society?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work deeply impacted you, and how it influenced your perspective or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem sparked a new perspective for you, and how did that impact your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character helped you develop a new perspective or challenged your existing beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or author significantly impacted your perspective, and how might such insights shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share a moment when reading a novel or poem sparked a new perspective for you, and how did that impact your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading or analyzing a literary work has influenced your perspective or decision-making in a meaningful way?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work significantly impacted your perspective, and how did that influence your goals or values?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem deeply impacted you, and how it influenced your perspective or creativity?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem profoundly impacted your perspective, and how did that influence your desire to study literature further?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work sparked a new perspective for you, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work sparked a new perspective for you, and how did that impact your views or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem significantly impacted your perspective, and how did that influence your life or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character helped you develop a new perspective or challenged your existing beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever connected with a character or theme in a novel that sparked a new perspective, and how did that shape your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem sparked a new perspective for you, and how did that impact your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work helped you develop a new perspective, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem significantly impacted your perspective, and how did that shape your interest in literary studies?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading or analyzing a literary work has influenced your perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading a novel or poem sparked your curiosity, and how you explored its themes or meanings further?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading or analyzing a literary work has influenced your perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work profoundly impacted your perspective, and how might such insights shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how exploring a character's journey in a novel influenced your perspective on personal growth or relationships?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character helped you develop a new perspective or challenged your existing beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem sparked a new perspective for you, and how did that impact your views or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how exploring a character's journey in a novel or play has influenced your perspective on life or relationships?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work significantly impacted your perspective, and how did you apply that newfound insight?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem sparked a new perspective for you, and how did that impact your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading a novel or poem sparked a new perspective for you, and how might this habit shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work profoundly impacted your perspective, and how did you apply that new insight?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading a novel or poem significantly impacted your perspective, and how you applied that new insight in a real-life situation?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem sparked a new perspective for you, and how did that impact your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading a novel or poem has influenced your perspective on life or shaped your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem sparked a new perspective for you, and how did that impact your views or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem significantly impacted your perspective, and how did that shape your interests or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work deeply impacted your perspective, and how did that influence your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem profoundly impacted your perspective, and how did that influence your desire to explore literary studies further?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that profoundly impacted you and how it influenced your perspective or inspired personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem significantly impacted your perspective, and how did that shape your thoughts on storytelling's power?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem significantly impacted your perspective, and how did that influence your actions or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work deeply impacted you, and how you think it might shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem profoundly impacted you, and how it influenced your perspective or writing style?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading or analyzing a literary work has influenced your perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character helped you develop a new perspective or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading a novel or poem impacted your perspective, and how might such experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character helped you develop a new perspective or empathy, shaping your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work significantly impacted your perspective, and how might such insights shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem deeply impacted you, and how it influenced your perspective or sparked new interests?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how exploring a literary work or character has influenced your perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem sparked a new perspective for you, and how did that impact your views or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work challenged your perspectives, and how did that shape your understanding of the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how exploring a character's journey in a novel or poem has influenced your perspective on life or relationships?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem sparked a new perspective for you, and how did that impact your life?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading a novel or poem significantly impacted your perspective, and how might such experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how exploring a character's journey in a novel or play has influenced your perspective on real-life challenges or relationships?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work deeply impacted your perspective, and how did that influence your thoughts on its role in society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work helped you develop a new perspective, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how exploring a literary work, such as a novel or poem, has influenced your perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem sparked a new perspective for you, and how did that impact your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading or analyzing a literary work has influenced your perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading or analyzing a literary work has influenced your perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading or analyzing a literary work has influenced your perspective or decision-making in a meaningful way?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character helped you develop a new perspective or empathy for others?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem sparked a new perspective for you, and how did that impact your life?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem sparked a new perspective for you, and how did that impact your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work sparked a new perspective or emotion in you, and how did that impact your life?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem profoundly impacted your perspective, and how might such moments shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem deeply impacted you, and how did that shape your perspective or interests?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem deeply impacted your perspective, and how it influenced your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how exploring a literary work or character has influenced your perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading a novel or poem influenced your perspective, and how might such insights shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem profoundly impacted you, and how it influenced your perspective or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading a novel or poem helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading or discussing a literary work has broadened your perspective or influenced your thoughts on life?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of a literary work that resonated with you and how analyzing it shaped your perspectives or writing style?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading a novel or poem sparked a new perspective for you, and how you applied this insight?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character significantly impacted your perspective, and how might such insights shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading or analyzing a literary work has influenced your perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work sparked a new perspective or emotion in you, and how did that impact your life?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how exploring a literary work or author has influenced your perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem deeply impacted you, and how it influenced your perspective or creativity?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading or analyzing a literary work has influenced your perspective or decision-making in a personal or academic?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem significantly impacted your perspective, and how did that influence your thoughts on storytelling's power?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how exploring a literary work or author has influenced your perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a novel or poem sparked a new perspective for you, and how did that impact your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever lost yourself in a novel or poem, and how did that experience shape your perspective or spark a desire to explore language further?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work or character helped you develop a new perspective or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where reading a literary work profoundly impacted your perspective, and how did that influence your interests or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how exploring a literary work, such as a novel or poem, has influenced your perspective or sparked personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you describe a moment when reading a novel or poem sparked a new perspective for you, and how did that impact your thoughts or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an experience where exploring a literary work deeply impacted your perspective, and how might such insights shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Can you share an example of how reading or analyzing a literary work has influenced your perspective or inspired personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a novel or poem that challenged your perspectives, and how did that shape your thoughts on storytelling's power?",
    "criterion": "Experiences"
  }
]