[
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine investing in a property today; what excites you about analyzing its potential for long-term growth and contributing to someone's dream home or business?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or observed the use of property, sparking your curiosity about its financial aspects?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or observed the use of space, resources, or property, and how it sparked your curiosity about its financial aspects?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you considered how managing properties or investing in land could shape cities and communities, and is this something you'd enjoy being part of?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how property trends or location influences investment decisions, and how might this impact your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on buying their first home. What aspects of this process excite you, and how might they relate to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience or scenario where you found the intersection of property, investment, and market trends particularly intriguing?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience or scenario where you found the connection between property, investment, or market trends particularly intriguing to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting properties, and would you enjoy helping others navigate these choices in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience or scenario where you found the intersection of property, markets, and investment particularly intriguing?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine owning a property portfolio one day - what excites you about managing real assets and their financial implications for individuals or communities?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever thought about how people make informed decisions when buying or investing in properties, and would you enjoy helping others navigate these choices?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you considered how owning or managing properties could impact your future career or personal growth, and what excites you about that possibility?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever thought about how buildings or properties can be both physical assets and financial investments, and how that balance interests you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're investing in a property; what excites you about balancing financial risks and potential returns in such decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience where you saw property's impact on people's lives, and how that sparked your curiosity about its financial aspects?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever thought about how owning or managing properties could impact people's lives, and is that something you'd like to explore in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience or scenario where you combined analytical skills with an interest in property or urban development, and how did that excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience or scenario that sparked your curiosity about how property values are determined or managed in urban environments?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how owning or managing properties could impact your financial future, and what role you'd want to play in that space?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how owning or managing properties could impact your financial future, and is that something you'd enjoy exploring?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're investing in your first property - what excites you about balancing financial risk and potential returns in real-world scenarios?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever thought about how owning or managing properties could impact your future career or personal wealth, and what excites you about that?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed a property's potential for investment or considered how location impacts its value, and why does that intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how location or market trends impact property values, and how might this curiosity shape your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you found learning about property markets or managing assets intriguing, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine owning a property portfolio one day - what excites you about managing and growing real estate assets in a dynamic market?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you realized the impact of property investments on individuals or communities, sparking your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or invested resources, and how did it spark your curiosity about property markets or financial strategies?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're investing in a property; what aspects of the process excite you the most, and how do you think this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed property values or thought about how real estate impacts economies, and how might this curiosity shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed a property's potential for investment or considered how real estate trends might impact your future living or career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Could you share how your curiosity about property markets or managing assets might shape your future career goals and personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how property trends impact daily life, and how would you leverage this curiosity in a career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how owning or managing properties could impact your financial decisions, and how that excites you about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how people make informed decisions when buying or investing in properties - is this a process that intrigues you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on investing in a property versus stocks; what aspects of this decision excite or challenge you about the real estate sector?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you've seen how property decisions impact people's lives, and how that sparked your curiosity about the field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting homes, and how would you approach helping others make such choices wisely?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever thought about how buildings and properties shape city life, and how that inspires your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how buildings or properties in your community could be both homes and investments - what excites you about this dual role?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how owning or managing properties could impact your future wealth and community development?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how owning or managing properties could impact your financial future, and what role you might play in that space?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine owning a property portfolio - what excites you about managing its financial aspects and how does this align with your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how property investments can shape city skylines, and is this blend of business and built environment intriguing to you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed property trends or managed a budget that sparked your curiosity about how real estate investments shape financial markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how owning or managing properties could impact your future wealth, and what aspects of this excite you the most?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine investing in a property today; what aspects of the real estate market or investment process excite or intrigue you the most about shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're investing in your first property - what aspects of this process excite you the most, and how do you see yourself contributing to its success?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed a property's potential for investment or considered how location affects its value, and what sparked that curiosity in you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or organized something valuable, and how it sparked your curiosity about investing in or developing properties?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you found the intersection of property, markets, and financial decisions particularly intriguing or rewarding?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you saw the connection between property, investment, and people, sparking your curiosity about this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a situation where you found the intersection of property, investment, or market trends fascinating, and how you explored it further?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a moment when you realized the impact of property ownership or development on individuals or communities, and how that sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how buildings or properties can be both physical assets and financial investments, and how that intersection excites your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on buying their first home. What aspects of the property market or financial planning excite you to learn more about?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a moment when you realized the impact of property investments on people's lives or economies, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how property values impact local communities, and how might understanding this influence your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience or moment that sparked your curiosity in how property and financial markets intersect in everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how owning or managing properties could impact people's lives, and is this something you'd enjoy exploring in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever thought about how buildings or properties can be both a home and an investment, and how that balance interests you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're investing in a property - what aspects of this process excite you the most and how do you see yourself contributing to it?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how owning or managing properties could impact people's lives and financial futures, and does that intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you considered how managing properties or investments could shape your future career, and what excites you about this intersection of business and real assets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you combined analytical skills with an interest in property or urban development to make an informed decision?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed a property's potential for investment or considered how location affects its value, and how might this curiosity shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how buildings and properties shape city skylines, and would you enjoy a career managing these valuable assets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you had to make a strategic decision involving property or resources, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience or scenario that sparked your curiosity about how property markets or real estate investments impact everyday life or economies?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed property markets or considered how location impacts investment decisions, and what excites you about exploring these intersections in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're investing in a property. What aspects of this experience excite you, and how might they relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you saw the connection between property, investment, and community impact, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever thought about how buildings or properties can be valuable investments, and how that might shape your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed a property's potential for investment or noticed how location affects housing prices, and how might this curiosity shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on investing in property versus stocks; what excites you about guiding others in making such impactful financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how property investments shape city skylines, and could you see yourself advising on such impactful decisions in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're investing in a property - what aspects of the process, from market trends to financial analysis, genuinely excite or intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how properties shape communities, and how you'd strategically invest in or develop spaces where people live, work, or play?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience or scenario that sparked your curiosity about how properties are valued, managed, or financed in the real world?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how property investments shape city skylines or how you'd manage a dream home purchase?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on buying their first home - what aspects of the property and market would you find most fascinating to research and why?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting properties, and would exploring the financial aspects of these decisions excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how property investments shape city skylines, and how might this impact your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine managing a property portfolio; what aspects of real estate investment or market trends excite you the most about shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed property trends or considered how location affects investment decisions, and how might exploring this area shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Could you share an experience or scenario where you found the intersection of property and finance particularly intriguing, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or invested resources, and how did it spark your curiosity about property markets or financial decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine investing in a property today; what excites you about the potential financial returns and the impact of location on your long-term strategy?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever considered how buildings and properties shape city skylines or impact people's lives, and how that relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting properties, and would you enjoy helping others make informed choices in this space?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how property trends or location affects investment decisions, and how might this align with your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on their first property purchase; what aspects of the process excite you the most, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine investing in a property today, what aspects of the decision-making process excite or challenge you, and how do you see this impacting your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how property values impact local communities, and how might this curiosity shape your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people's living spaces impact their financial decisions, and how would you advise someone investing in their first home?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how people make decisions about buying or renting properties, and would you enjoy helping others make informed choices in this space?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever thought about how property investments shape cities, and is that something you'd like to influence in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a moment when you found the connection between property, investment, and market trends particularly intriguing or exciting?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed property values or considered how location impacts investment decisions, and how might this curiosity shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you had to analyze a complex situation, like evaluating a property's potential, and how you approached it?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach evaluating the potential return on investment for a property, considering both financial and lifestyle factors?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, property type, and investment risk in a hypothetical first real estate investment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property, considering both financial and lifestyle factors?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential return on investment for a property purchase, considering both financial and lifestyle factors?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach researching and analyzing a potential property investment, considering both financial returns and personal risk tolerance?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property, considering both financial and lifestyle factors?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach researching and evaluating a potential property investment, considering both financial returns and personal goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach investing in a property with limited information, and what strategies you'd use to mitigate potential risks?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential of investing in a mixed-use development project in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would evaluate the potential risks and returns of investing in a mixed-use property in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential return on investment for a property in a rapidly developing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would evaluate the potential risks and returns of investing in a mixed-use property development in your hometown?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach investing in a property with limited funds, balancing risk and potential returns?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach evaluating the potential of investing in a mixed-use development project in a revitalizing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential risks and returns of investing in a mixed-use property development in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how location affects property values, and how would you apply this insight to a hypothetical investment decision?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach evaluating the potential return on investment for a property in a newly developing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach investing in a property for the first time, considering both financial risks and potential long-term benefits?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach investing in a property with limited funds, balancing risk and potential returns?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential risks and rewards of investing in a mixed-use property development in a growing urban neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property development project in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed how location or market trends impact a property's value, and how would you apply such insights in a future investment decision?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach investing in a first-time property purchase with a limited budget, prioritizing long-term growth?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property, considering both financial and lifestyle factors?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach investing in a property with limited funds, balancing risk and potential returns?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property development project in a rapidly growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential risks and returns of investing in a mixed-use property in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or allocated resources effectively, and how did you balance risk and potential returns in your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach researching and analyzing a potential property investment, considering both financial returns and personal interests?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property, considering both financial and lifestyle factors?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would analyze the potential return on investment for a property, considering both financial metrics and personal preferences?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential of a new shopping mall in your hometown as a long-term investment opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, property type, and investment returns for a first-time real estate buyer?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a first-time property buyer in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine investing in a property today; what factors would you analyze to ensure it's a smart financial decision for your future?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a first-time property buyer in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you had to weigh the pros and cons of a significant purchase or investment, and how did you make your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed a property's potential for investment or personal use, and how did you approach evaluating its long-term value?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property in a newly developing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed property values or considered how location impacts investment decisions, and how might this curiosity shape your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach investing in a dream home versus a rental property, considering both emotional and financial factors?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach researching and evaluating a potential property investment, considering both financial returns and personal interests?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach evaluating the potential return on investment for a first-time property buyer in a new neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would evaluate the potential risks and returns of investing in a mixed-use development project in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would evaluate the potential risks and rewards of investing in a mixed-use property development in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would evaluate the potential risks and rewards of investing in a new mixed-use development in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach researching and evaluating a potential property investment, considering both financial returns and personal interests?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property, considering both financial metrics and market trends?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential risks and rewards of investing in a mixed-use property development in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential of investing in a mixed-use development project in a growing suburban area?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, property type, and potential returns when investing in a new real estate venture?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential risks and returns of investing in a mixed-use development project in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential returns and risks of investing in a mixed-use property development in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach researching and analyzing a potential property investment, considering both financial returns and personal risk tolerance?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach researching and analyzing a potential property investment for a first-time buyer, considering both financial and lifestyle factors?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd research and analyze a potential property investment in a neighborhood you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential of investing in a mixed-use development project in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach investing in a property with limited funds, and what factors would influence your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach researching and evaluating the potential return on investment for a property in a new, unfamiliar neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would evaluate the potential risks and rewards of investing in a mixed-use property development in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or organized something of value, and how did that experience spark your curiosity about investing in physical assets?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed property values in your neighborhood? How would you approach researching and advising on a potential investment in real estate?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever analyzed property values in your neighborhood? How would you approach evaluating factors that influence these values for a potential investment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on buying their first home; how would you approach analyzing both financial risks and property market trends to guide their decision?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, property type, and long-term investment potential in a hypothetical first real estate purchase?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property, considering both financial and lifestyle factors?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach researching and evaluating a potential property investment in a new city, considering both financial and lifestyle factors?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach researching and evaluating the potential of a new neighborhood for property investment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would evaluate the potential risks and rewards of investing in a mixed-use property development in your hometown?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach researching and evaluating the potential return on investment for a property development project in a new city?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential risks and returns of investing in a mixed-use development project in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach evaluating the potential of a new shopping mall in your hometown as a long-term investment opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property, considering both financial and lifestyle factors?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on investing in a property versus stocks; how would you analyze and compare the risks and potential returns for each?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential of investing in a mixed-use development in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential risks and returns of investing in a mixed-use property development in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or organized something of value, and how did that experience spark your interest in understanding property markets?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would evaluate the potential return on investment for a property in a growing neighborhood versus a declining one?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach researching and evaluating the potential of a new residential development project in your hometown?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would evaluate the potential risks and returns of investing in a residential property versus a commercial one?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach researching and evaluating a potential property investment for your future portfolio?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property in a rapidly developing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach investing in a property with limited funds, highlighting your decision-making process and risk assessment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing a local neighborhood's potential for a new community project, considering both financial and social impacts?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach researching and evaluating the potential of a new property development in an unfamiliar neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential of investing in a mixed-use development in a growing neighborhood?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would evaluate the potential risks and returns of investing in a residential property versus a commercial one?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach researching and evaluating a potential property investment in a neighborhood you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the trade-offs between location, property type, and investment returns when evaluating a potential real estate opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential of investing in a mixed-use development versus a purely residential project in a growing city?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time you managed or invested money, even if just in a simulation, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing a potential property investment, considering both financial returns and personal risk tolerance?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on buying their first home. How would you approach researching and evaluating the investment potential of different neighborhoods?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property, considering both financial and lifestyle factors?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach investing in a property with a limited budget, and what factors would influence your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential of a new shopping mall in your hometown as a long-term investment opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property in a growing neighborhood versus a declining one?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd evaluate the potential return on investment for a property in a growing neighborhood versus a declining one?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach researching and evaluating a potential property investment, considering both financial returns and personal goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed a property-related project that sparked your interest in how financial decisions impact real-world spaces?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did this spark your curiosity about the intersection of property and finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed the financial aspects of a property, like a family home or investment, that sparked your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized limited resources, and how did that impact your decision-making or outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed a property, like a family home or rental, that sparked your curiosity about its financial aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or analyzed the value of a property, or helped someone make an informed decision about real estate?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed the financial aspects of a property, such as a family home or school project, that sparked your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or observed the use of resources (e.g., money, space) to achieve a specific goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your decision-making or outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed a situation where property value or location significantly impacted a decision - how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed how properties are valued, bought, or sold, and how would you apply those lessons to a future career?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored how property values or location impacts investment decisions in your community, and how might this interest shape your future career?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed a property, investment, or budget that sparked your curiosity about how financial decisions impact physical assets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed how properties, like homes or commercial spaces, can be both valuable assets and costly liabilities in your personal or family experiences?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored or been involved in any activities related to property, investing, or community development that sparked your curiosity about shaping spaces and wealth?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed a property, like a family vacation home, and thought about how to maximize its value or rental income?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed the financial aspects of a property, such as a family home or investment, that sparked your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed the financial aspects of a property, like a family home or investment, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed how spaces like homes or shops are valued or utilized, and how might this spark your interest in related careers?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or observed the use of resources, spaces, or assets in a way that sparked your interest in their financial or strategic potential?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored how property values or locations impact personal or family financial decisions, and what did you learn from these observations?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a property-related decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed the financial aspects of a property, like a family home or school project, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored how property values or market trends impact communities, and how might this influence your future career choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored how property trends or personal finance decisions impact everyday life, and how might this curiosity shape your future career?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored or experienced situations where property, investment, or location strategy played a key role, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed the financial aspects of a property, like a family home or rental, that sparked your curiosity about investing in real estate?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or organized something of value, and how did that experience shape your interest in wealth management or property?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized limited resources, and how did that impact your decision-making or outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed a property, like a family home or school project, that sparked your interest in how spaces generate value?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or helped manage a resource, like organizing an event or budgeting for a project, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed the financial aspects of a property, like a family home or a school project, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed any property-related decisions, like buying, renting, or renovating, that sparked your interest in how financial aspects shape such choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed the financial aspects of a property, like a family home or a school project, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed a property-related project, like a school event or family investment, that sparked your curiosity about its financial aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed a property, like a family home or rental, that sparked your interest in how real estate can be a financial asset?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did this impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that spark your curiosity about the business of property and investments?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that spark your interest in property or investment decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed the financial aspects of a property, like a family home or a school project, that sparked your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored or experienced situations where property values, market trends, or investment decisions impacted your community or personal goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or invested in something valuable, like a school project or personal savings, that sparked your interest in property or financial planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that spark your curiosity about property markets or investment strategies?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or optimized resources, like budgeting or planning, that relates to your interest in property or investment?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that spark your curiosity about property markets or investments?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did this spark your curiosity about the business of property and investments?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored or would you consider how property investments or location choices impact personal or family finances, and why?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed a property, like a family home or school project, that sparked your interest in how spaces generate value?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or helped manage a property, budget, or investment that sparked your interest in how real assets impact financial decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed the financial aspects of a property, like a family home or a school project, that sparked your curiosity about real-world applications?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed, invested in, or analyzed properties - even virtually - that sparked your interest in shaping future spaces or communities?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored or been involved in any activities that combine financial concepts with property or urban development?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or optimized resources, and how did that experience spark your curiosity about property markets or investments?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed a property, investment, or budget that sparked your curiosity about how financial decisions impact real-world assets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did this impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored or been involved in any activities that combine business strategy with property or urban development, sparking your curiosity about this intersection?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed, invested, or observed money in a way that sparked your interest in how property or land contributes to wealth?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or helped manage a resource, like a budget or a property, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored or would you consider how property development impacts local communities, and how might that influence your future career choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or observed the use of physical spaces, and how it sparked your curiosity about their economic or social value?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or helped manage a budget, investment, or property, and what did you learn from that experience about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or analyzed property, budgets, or spaces, and how it sparked your curiosity about investing in or developing physical assets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or observed the use of resources, spaces, or assets that sparked your curiosity about their financial or strategic value?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed property transactions, or explored how location impacts investment decisions in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a significant asset, like property or investments, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed a property transaction, and how did that experience shape your understanding of financial decisions in real-world contexts?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that spark your curiosity about property markets or investments?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored or been involved in activities that combine business strategy with property or location-based decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored or been involved in activities that combine financial analysis with property-related decisions, and how did you find the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored or been involved in activities that combine business strategy with property or location-based decision-making, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized limited resources, and how did that shape your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your decision-making or outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized limited resources, and how did that impact your decision-making or outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed the financial aspects of a property, like a family home or rental, that sparked your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or helped manage a resource, like a budget or a project, that you think relates to your future career goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed a property transaction, investment, or development that sparked your interest in how real assets impact financial decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or invested resources, and how did that experience shape your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed property transactions, or explored how location impacts investment decisions in your personal or family experiences?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed the financial aspects of a property, like a family home or rental, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, invested, or innovated with resources, and how it sparked your curiosity about property markets or financial strategy?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed a property-related project, and how did you apply financial concepts to make informed decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or observed the use of resources, space, or assets in a way that sparked your curiosity about property values or investments?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that impact your understanding of value creation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or optimized resources, and how did that spark your interest in property or financial planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you ever managed or observed the financial aspects of a property, like a family home or a school project, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored how property values or locations impact everyday life, and how might this curiosity shape your future career choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you explored how property values or locations impact investment decisions, and how might this influence your approach to managing assets in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Have you managed or observed the financial aspects of a property, like a family home or rental, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Real Estate)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or analyzed the value of a property, and how did that shape your interest in its financial aspects?",
    "criterion": "Experiences"
  }
]