[
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures and economies, and how might this interest shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example from your life that sparked your curiosity about the interconnectedness of Asian cultures and how it might shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagining you're a bridge between Eastern and Western cultures, what aspects of this role excite you about shaping future international collaborations and understanding?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagine working in a role that connects Asian cultures; what aspects of this global interaction excite you about shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnected cultures, economies, or histories of Asian societies, and why does this intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about the interconnectedness of Asian cultures or economies, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where learning about different Asian cultures sparked your curiosity, and how might exploring these further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you ever imagined working in a role that bridges cultures across Asia, and if so, what excites you about that opportunity?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where learning about a different Asian culture sparked your curiosity, and how you think this curiosity might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about Asia's diverse cultures or global influence, and how might exploring this further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about the interconnectedness of Asian cultures and how it might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or topic that sparked your curiosity about the interconnectedness of Asian cultures, economies, or histories, and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about the interconnectedness of Asian cultures and how it might shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagine working in a role that bridges cultures across Asia; what aspects of this experience excite you and align with your long-term goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you ever explored or been intrigued by the cultural, economic, or historical connections between Asian societies, and how might these interests shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures and economies, and why does it fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagine working in a role that bridges cultures across Asia; what aspects of this global interconnectedness excite or motivate you about your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where learning about diverse Asian cultures sparked your curiosity, and how might exploring these further shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Could you share an experience or topic related to Asian cultures, economies, or histories that sparked your curiosity and why it resonates with your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Could you share an experience that sparked your curiosity about the interconnected cultures, economies, or histories of Asian societies and how you see this shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Reflecting on your experiences, how do you see the cultural, economic, or political dynamics of Asia influencing your future goals or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagining yourself working in a role that bridges Eastern and Western cultures, what aspects of this fusion excite you the most about shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or topic related to Asian cultures, economies, or societies that sparks your curiosity and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about the interconnectedness of Asian cultures, economies, or histories?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Reflecting on your experiences, how do you think studying the interconnectedness of Asian cultures and economies could shape your global perspective and career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnected cultures, economies, or histories of Asian societies and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about the interconnectedness of Asian cultures and economies, and how might this shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where learning about diverse Asian cultures sparked your curiosity, and how might this interest shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures and economies?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about diverse Asian cultures or global issues, and how you see this shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures and economies, and how might exploring this further shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about the interconnectedness of Asian cultures and economies, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about Asian cultures or global connections, and how might exploring these themes shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about the interconnectedness of Asian cultures and economies, and how you see this shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about diverse Asian cultures and their global influences?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures and economies, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you ever wondered how Asian cultures, economies, or histories might shape your future career or personal perspectives, and why does this connection intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures and economies, and how might this shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about diverse Asian cultures and how you see this curiosity shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Could you share an experience where learning about different Asian cultures sparked your curiosity, and how might exploring these further shape your global perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you encountered cultural differences that sparked your curiosity, and how might exploring diverse Asian perspectives shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you explored a cultural difference, and how did that spark your curiosity about the interconnectedness of Asian societies?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you ever explored how Asian cultures intersect globally, and how might this shape your future career or personal aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about diverse Asian cultures or global issues, and how exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagining your future self working across Asian cultures, what aspects of this diverse, interconnected region excite you the most about shaping your career?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagining yourself working across Asian cultures, what aspects of this global interconnectedness excite you about shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about Asia's diverse cultures or global influences, and how might exploring these themes shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Could you share an experience or topic related to Asian cultures or global issues that genuinely fascinates you, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about the interconnectedness of Asian cultures and economies, and how might this curiosity shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where exploring Asian cultures or global issues sparked your curiosity, and how you see this shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures, economies, or societies, and how you see this shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you ever imagined working in a role that bridges cultures across Asia, and if so, what excites you most about that possibility?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about diverse Asian cultures and how exploring them could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagining you're a bridge between Eastern and Western cultures, what aspects of this role excite you most about shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about the interconnectedness of Asian cultures and economies, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about Asian cultures or global connections, and how might exploring these themes shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures and societies?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where learning about diverse Asian cultures sparked your curiosity, and how might exploring these further shape your global perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the diverse cultures, economies, or histories of Asian regions, and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagine working in a role that bridges cultures across Asia; what aspects of this global connectivity excite you about shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or topic related to Asian cultures, economies, or histories that genuinely fascinates you and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or topic related to Asian cultures, economies, or histories that sparked your curiosity, and how might exploring these further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about the interconnectedness of Asian cultures and economies, and how exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where learning about diverse Asian cultures sparked your curiosity, and how might this continue to shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Could you share how exploring the diverse cultures, economies, or histories of Asian regions might shape your global perspective or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or topic that sparked your curiosity about the interconnectedness of Asian cultures and economies, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures and economies, and why does this fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures and economies, and why does it resonate with you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you ever found yourself curious about how Asian cultures intersect in the global landscape, and how that might shape your future opportunities?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Could you share an experience or encounter that sparked your curiosity about the diverse cultures, economies, or histories of Asian regions, and how do you see this fascination shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about the interconnectedness of Asian cultures and societies?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Could you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures and economies?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagining yourself working across Asian cultures, what aspects of this diverse and dynamic region excite you most about shaping your future career or personal journey?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you ever explored how Asian cultures intersect globally, and how might this intersection shape your future career or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagining you're a global citizen, which Asian cultural, economic, or social issue would you most want to explore and why does it resonate with you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagining yourself working in a role that bridges cultures across Asia, what aspects of this experience excite you the most about shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about diverse Asian cultures and how you think exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about the interconnectedness of Asian cultures and economies, and how you see this shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or topic that sparked your curiosity about the interconnectedness of Asian cultures and economies, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagine working in a role that connects Asian cultures and economies - what aspects of this global interaction excite you the most about your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Could you share an example of how learning about diverse Asian cultures or histories has sparked your curiosity or influenced your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or topic related to Asian cultures, economies, or histories that genuinely fascinates you and why it resonates with your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Reflecting on your own experiences, how do you think understanding diverse Asian cultures and economies could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where learning about diverse Asian cultures sparked your curiosity, and how you see this shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagine working in a role that bridges cultures across Asia; what aspects of this global connectivity excite you about shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures and economies, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you ever been fascinated by how Asian cultures intersect with global issues, and how might exploring these intersections shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about Asia's diverse cultures or global influences, and how might exploring these themes shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about the interconnectedness of Asian cultures and societies, and how you see this shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Imagine working in a role that bridges cultures across Asia; what excites you most about shaping connections between diverse societies in this dynamic region?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about Asian cultures or global connections, and how might exploring these interests shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you ever been fascinated by how Asian cultures intersect with global issues, and how might exploring these dynamics shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Reflecting on your experiences, what aspects of diverse Asian cultures or global issues excite you to explore their complexities in your future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Could you share how exploring the cultural, economic, or political dynamics of Asian regions might shape your future goals or personal perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about the interconnectedness of Asian cultures or economies, and why it fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience that sparked your curiosity about the interconnectedness of Asian cultures, economies, or histories, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures, economies, or histories?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the diverse cultures, economies, or histories of Asian regions and their global connections?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures and economies, and why does it resonate with you?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience or encounter that sparked your curiosity about the interconnectedness of Asian cultures and economies?",
    "criterion": "Interests"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will shape your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated cultural differences, and how do you think this skill will impact your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated a cultural difference or learned about an Asian society, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated cultural differences in your life, and how you think this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will benefit your future in an interconnected world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated cultural differences in your life, and how might such experiences shape your approach to global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will benefit your future pursuits in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated cultural differences in your life, and how you think this skill will benefit your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will impact your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated cultural differences, and how do you think such experiences shape your approach to global collaborations?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your approach to understanding diverse perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how your curiosity about diverse Asian cultures or histories has influenced your goals or perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future interactions in a globally connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a time when you navigated cultural differences, and how do you think such experiences shape your approach to global issues?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future in a globally connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how your curiosity about diverse Asian cultures or histories has influenced your decisions or perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will benefit your future in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will benefit your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will benefit your future in a globally connected career?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how your curiosity about diverse Asian cultures or histories has influenced your goals or perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will impact your future interactions in a globally connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated a cultural difference, and how do you think such experiences shape a leader's global perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will benefit your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cultural difference or international issue - how did you adapt and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how did this shape your approach to understanding diverse perspectives in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated cultural differences in your life, and how you think this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will serve you in a globally connected future?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will enhance your future collaborations in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated or would approach a cross-cultural challenge, and what skills did you develop through the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how did this shape your perspective on global interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated a cultural difference, and how that experience might shape your approach to global collaborations in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your approach to understanding diverse Asian perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will impact your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cultural difference or global issue, and how it shaped your perspective on interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will impact your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future in a globally connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated cultural differences in your life, and how do you think this skill will serve you in a globally interconnected future?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will impact your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cultural difference, and how did that shape your approach to understanding diverse Asian perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will benefit your future in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a personal experience that sparked your curiosity about diverse Asian cultures and how you think this curiosity might shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future in a globally connected career?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will benefit your future in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a time when you navigated cultural differences, and how did that experience shape your approach to understanding diverse Asian perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will shape your approach to global collaborations?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated cultural differences, and how do you think such experiences shape your approach to global challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated a cultural difference, and how you think this skill will benefit your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a moment when learning about a different Asian culture challenged your assumptions, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will impact your future aspirations in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated cultural differences, and how do you think such experiences shape a leader's global perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will serve you in a globally interconnected career?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated cultural differences in your own life, and how you think this skill will benefit your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will shape your approach to understanding diverse Asian perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how your understanding of diverse Asian cultures has influenced your perspective on a global issue?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated cultural differences, and how did that experience shape your perspective on global connections?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated cultural differences, and how did this experience shape your perspective on global collaboration?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated cultural differences, and how might such experiences shape your approach to global collaborations in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated cultural differences in your life, and how you think this skill will benefit your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will shape your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how did this shape your perspective on global interactions?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will impact your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will shape your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future in a globally connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated cultural differences in your life, and how do you think this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated cultural differences, and how do you think that skill will benefit your future in a globally connected career?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global interactions in your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your perspective on global collaboration or communication?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will serve you in a globally connected future?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will benefit your future in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will shape your future in a globally connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future in a globally connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated cultural differences, and how did that experience shape your perspective on global interactions?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated cultural differences, and how did that experience shape your understanding of Asia's global connections?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how your curiosity in Asian cultures or global issues has influenced your goals or perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated cultural differences, and how do you think such experiences will shape your approach to global challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will benefit your future in a globally connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how did that shape your approach to understanding diverse Asian perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will serve you in a globally connected career?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cultural difference, and how do you think this skill will serve you in a globally connected career?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cultural difference or diversity, and how did it shape your perspective on global interactions?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an example of how you've navigated a cultural difference or communication challenge, and what skills did you develop through that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will shape your approach to global collaborations in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will benefit your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will benefit your future in a globally interconnected world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will impact your future in an interconnected world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think this skill will benefit your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think such skills will shape your future interactions in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your views on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you engaged in activities or experiences that broadened your understanding of Asian cultures, economies, or histories, and how did they shape your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how it shaped your perspective on global connectivity?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did that shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how it shaped your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where exploring a cultural, social, or historical aspect of Asia sparked your curiosity about its global connections or relevance to your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where exploring a culture or region different from your own sparked curiosity or challenged your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a diverse Asian culture, and how it sparked your curiosity about the region's global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on regional interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you explored or engaged with Asian cultures, economies, or societies, and how did this shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you explored or connected with a culture from Asia, and how did that shape your goals or worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a diverse Asian culture, and how it sparked your curiosity about the region's global influence?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a diverse cultural group, and how did it shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did that shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you explored or interacted with diverse Asian cultures, and how did it shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how it sparked your curiosity about the region's global influences?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how it sparked your interest in exploring their global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how it sparked your curiosity about the region's interconnected future?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your views on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your global perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how it sparked your interest in exploring the region's complexities further?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you engaged in activities or experiences that deepened your understanding of Asian cultures, economies, or societies, and how did they shape your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how it sparked your curiosity about the region's role in global affairs?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a diverse Asian culture, and how did it shape your perspective on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your views on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your views on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a diverse Asian community or culture, and how it shaped your perspective on global interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you engaged in activities or travel that sparked your curiosity about diverse Asian cultures, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your views on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your global perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how it shaped your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a diverse Asian culture, and how it sparked your curiosity about the region's global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you explored or engaged with Asian cultures, and how did it shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a diverse Asian community, and how did it shape your perspective on regional connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you explored or connected with a culture from Asia, and how did it shape your perspective or interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where exploring a blend of Asian cultures or global issues sparked your curiosity about their interconnected impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where exploring a culture or region outside your own comfort zone sparked your curiosity about its global connections or impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you engaged in activities or discussions that helped you understand diverse Asian cultures or global issues, and how did these shape your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you engaged in activities or discussions that deepened your understanding of Asian cultures, economies, or histories, sparking your curiosity about their global impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how it sparked your curiosity about the region's interconnected future?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did that shape your perspective on global connectivity?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did that shape your perspective on global connectivity?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your views on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you explored or connected with Asian cultures, and how did that shape your interests or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global connectivity?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did that shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your views on global connectivity?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you engaged in any cross-cultural experiences or explored Asian perspectives that sparked your curiosity about their global impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how it sparked your curiosity about the region's global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global connectivity?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you engaged in activities or travel that broadened your understanding of Asian cultures or global connections, and how did these experiences impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did that shape your views on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a diverse Asian community or culture, and how it shaped your perspective on global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on regional connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Have you engaged in activities or discussions that deepened your understanding of Asian cultures, economies, or societies, sparking your curiosity about their global impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a culture or community different from your own, and how it shaped your worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on regional interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where exploring a different Asian culture or perspective helped shape your goals or worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your perspective on global interconnectedness?",
    "criterion": "Experiences"
  },
  {
    "major": "Global Asia",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with diverse Asian cultures, and how did it shape your views on global connections?",
    "criterion": "Experiences"
  }
]