[
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're advising a hospital to allocate a limited budget: what aspects of healthcare would you prioritize and why, reflecting your personal values?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you saw how resources or costs impacted healthcare, and how it sparked your curiosity about improving such systems?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine managing a hospital budget, how would you balance patient care quality with financial constraints, and what motivates your decision-making in such scenarios?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Reflecting on your goals, how do you see understanding healthcare systems and resource allocation shaping your future career or personal fulfillment?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine designing a healthcare system for your community - what aspects of balancing cost, quality, and accessibility excite you about this challenge?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of economic decisions on healthcare access or outcomes, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of economic decisions on healthcare access, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how healthcare resources were allocated, and how would you improve this system if given the chance?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're advising a hospital on budget allocation. What aspects of balancing patient care with financial sustainability excite or challenge you about this role?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how healthcare resources are allocated or managed effectively in your community?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of economic decisions on healthcare outcomes, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience or issue related to healthcare that sparked your curiosity, and how do you think studying economics could help address it?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of economic decisions on healthcare outcomes, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you saw how costs or resources affected healthcare outcomes, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a moment when you realized the impact of healthcare costs or policies on someone's life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're advising a hospital on budget allocation. What aspects of healthcare improvement or cost management would excite you most about this role?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're designing a healthcare system for a small town - what aspects of balancing costs, patient outcomes, and resources excite you to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed healthcare inefficiencies and how you think innovative management strategies could improve outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance individual well-being with limited resources, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how healthcare resources are allocated or managed in your community?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how healthcare resources are allocated or managed in your community?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed healthcare resources being allocated unfairly, and how would you improve such systems in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're designing a healthcare system; what aspects would you prioritize to balance quality care with sustainable costs, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're designing a healthcare system for a small town - what aspects of cost, quality, and access would you prioritize, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you ever wondered how healthcare resources could be allocated more effectively to improve societal well-being, and how you might contribute to this?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see the balance between healthcare costs and quality of life impacting your desired career or personal goals?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you saw the impact of financial decisions on healthcare access, and how did that influence your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of management decisions on healthcare outcomes, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how healthcare resources are allocated or managed effectively?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're designing a healthcare system - what aspects of balancing patient needs with limited resources excite or challenge you about this?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Reflecting on your future career, how do you think understanding the economics of healthcare systems could help you drive meaningful change in people's lives?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed a challenge in healthcare access or costs, and how you think innovative management could improve it?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how healthcare resources were allocated, and how it sparked your curiosity about improving such systems?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you ever analyzed how healthcare costs impact patient choices, and how would you balance affordability with quality care in such scenarios?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of financial decisions on healthcare access, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of economic decisions on healthcare outcomes, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you ever analyzed how healthcare resources are allocated in your community, and how would you improve this system if given the chance?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a situation where you realized the impact of economic decisions on healthcare outcomes, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how healthcare resources are allocated or managed effectively in your community?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how healthcare resources were allocated, and how would you improve this system if given the chance?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine designing a healthcare system for a small town; what aspects of balancing cost, quality, and accessibility excite you most about this challenge?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you noticed healthcare resources being allocated unfairly, and how would you redesign the system for better outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you saw the impact of limited resources on healthcare access, and how it sparked your curiosity about optimizing healthcare systems?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized how economic decisions impact healthcare access or outcomes, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you saw how healthcare resources were allocated unfairly, and how would you improve the situation if given the chance?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see yourself contributing to improving healthcare systems or policies, and what motivates this aspiration in you?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you saw healthcare resources being allocated unfairly, and how would you redesign the system for better outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you realized the impact of economic decisions on healthcare outcomes, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you saw a connection between healthcare resources and patient outcomes, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of financial decisions on healthcare outcomes, and how it sparked your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how healthcare resources are allocated or managed in your community?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're advising a hospital on budget allocation, how would you balance investing in new medical tech versus hiring more staff, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of financial decisions on healthcare access, and how it sparked your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of economic decisions on healthcare access, and how it sparked your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed healthcare resources being allocated unfairly, and how would you redesign the system for better outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're advising a hospital on budget allocation. What aspects of healthcare improvement would you prioritize and why?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're advising a hospital on budget allocation: would you prioritize new medical tech or staff training, and why does this decision excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of financial decisions on healthcare outcomes, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you observed healthcare services being allocated in a way that sparked your curiosity about improving their efficiency or fairness?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed a challenge in healthcare access or affordability, and how it sparked your curiosity about improving such systems?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of economic decisions on healthcare outcomes, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of financial decisions on healthcare outcomes, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see yourself contributing to improving healthcare systems, and what motivates you to balance resources with patient outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine designing a healthcare system for a small town - what aspects of balancing medical costs and patient outcomes excite you about this challenge?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see yourself contributing to improving healthcare systems or policies that balance cost and patient outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're advising a hospital on budgeting for a new life-saving treatment; what aspects of this challenge excite you about the intersection of healthcare and decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you saw how healthcare resources were allocated, and how did that spark your curiosity about improving such systems?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed a challenge in healthcare delivery and how you think innovative management or economic strategies could improve it?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Reflecting on your future, how do you think understanding the economics behind healthcare systems could shape your professional goals or personal values?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you realized how healthcare resources impact lives, and how you'd like to influence such decisions in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you saw a connection between healthcare resources and patient outcomes, sparking your curiosity to explore this link further?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're advising a hospital to allocate a limited budget: would you prioritize new medical tech or staff training, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience or observation that sparked your curiosity in how healthcare resources are allocated or managed in your community?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how healthcare resources were allocated, and how would you improve the system if given the chance?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of economic decisions on healthcare access, and how it sparked your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're designing a healthcare system; what aspects would you prioritize to balance quality care with cost, and why does this balance matter to you?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how healthcare resources are allocated or managed in your community?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a situation where you realized the impact of economic decisions on healthcare outcomes, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see yourself contributing to improving healthcare systems, and what motivates you to balance resource allocation with patient outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Reflecting on your future career, what aspects of improving healthcare systems or managing healthcare resources excite you the most?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're advising a hospital on budget allocation - what aspects of healthcare improvement would you prioritize and why?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how healthcare resources were allocated, and how did that spark your curiosity about improving healthcare systems?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how healthcare resources are allocated or managed in your community?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you ever wondered how healthcare systems balance cost and patient care, and how you might contribute to improving these systems in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance cost and quality in a decision, and how did that shape your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're designing a healthcare system - what aspects of cost, quality, and access would you prioritize, and why, in your ideal model?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're designing a healthcare system for a new city - what aspects of cost, access, and patient outcomes would you prioritize, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you saw a connection between health outcomes and resource allocation, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Reflecting on your experiences, how do you think understanding the economic aspects of healthcare can help you drive positive change in people's lives?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance the cost of a health decision with its benefits, and how did that influence your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine designing a healthcare system for a new city - what aspects of balancing cost, quality, and access excite you about this challenge?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of economic decisions on healthcare outcomes, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience or observation that sparked your curiosity about how healthcare systems balance cost, quality, and patient outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're designing a healthcare system for a new city - what aspects of cost, quality, and access would you prioritize and why?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you saw the impact of healthcare resources on a community, and how it sparked your curiosity about optimizing them?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're advising a hospital on budget allocation - what aspects of healthcare would you prioritize and why?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine designing a healthcare system for a small town - what aspects of balancing patient needs with limited resources excite you about this challenge?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of financial decisions on healthcare outcomes, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Imagine you're advising a hospital on budget allocation - what aspects of healthcare improvement would you prioritize and why?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how healthcare resources are allocated or managed in your community?",
    "criterion": "Interests"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced competing priorities, like cost and quality, and how did that experience shape your decision-making approach?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you had to balance individual well-being with limited resources, and how did you approach this dilemma?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced individual needs with limited resources - how did you prioritize and make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual needs with limited resources, and how did that experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced individual well-being with resource constraints, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced competing priorities, like cost and quality, in a decision that impacted people's well-being?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced personal or community health needs with limited resources, and how did you make that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual well-being with resource limitations in a personal or group project, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to balance individual well-being with limited resources, and how did you navigate that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual needs with limited resources, and how did you make a fair decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual needs with limited resources, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through how you'd balance the cost of a new hospital with the benefits to patients in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced personal or community health needs with limited resources, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with limited resources, and how did you approach that situation?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual needs with limited resources, and what did you learn from this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced individual well-being with resource constraints, and how did you navigate that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual well-being with resource constraints, and how this experience might shape your future decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual well-being with resource constraints, and how this experience might shape your approach to decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with limited resources, and how did you make your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with resource limitations, and how did you approach this dilemma?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through how you would balance the cost of a new medical treatment with its benefits to patients in a resource-limited setting?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual needs with limited resources, and how did you measure the success of your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a situation where you balanced individual well-being with resource limitations, and how did you make your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a situation where you balanced individual well-being with resource constraints, and how did you make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through how you'd balance the cost of a new medical treatment with its benefits to patients in a resource-limited setting?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with limited resources, and how did you navigate that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual needs with limited resources, and how did you make that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced competing priorities, like cost and quality, and how did that shape your decision-making approach?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual well-being with resource constraints, and how this experience might shape your future decision-making in healthcare?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through how you'd balance budget constraints with healthcare needs when managing a community health project?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance individual well-being with limited resources, and how did you approach that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced competing priorities, like cost and quality, and how you made a decision that impacted others?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual needs with limited resources, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced personal or community health needs with limited resources, and what strategies did you employ?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced personal or community health needs with limited resources, and what strategies would you use to optimize outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a situation where you balanced individual needs with limited resources, and how did you make your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual needs with limited resources, and how did you make that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced competing priorities, like cost and quality, to make a decision that impacted others?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with resource limitations, and how did you navigate that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with resource constraints, and how would you approach similar decisions in a healthcare setting?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced competing priorities, like cost and quality, to make a decision that impacted others' well-being?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual well-being with resource constraints in a personal or community?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you had to balance individual well-being with limited resources, and how did you approach that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time you balanced personal or community health needs with limited resources, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced competing priorities, like cost and quality, in a decision that impacted others' well-being?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced personal or family health needs with limited resources, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual needs with limited resources, and how might this skill be valuable in a career?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with resource constraints, and how did you navigate that trade-off effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual well-being with limited resources, and how did you make that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced competing priorities, like cost and quality, in a decision that impacted people's well-being?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual needs with limited resources, and how would you apply that mindset to improving healthcare systems?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with resource constraints, and how did you navigate that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced competing priorities, like cost and quality, to make a decision that impacted others?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced individual well-being with limited resources, and how did you navigate that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time you balanced individual well-being with limited resources, and how did you make that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through how you would balance the cost of a new hospital with the benefits to patients in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you balanced individual needs with limited resources, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with limited resources, and how would you approach such trade-offs in a healthcare setting?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced personal or community health needs with limited resources, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced competing priorities, like cost and quality, in a decision that impacted someone's well-being?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced personal or community health needs with limited resources, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced competing priorities, like cost and quality, in a decision that impacted others?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced individual needs with limited resources, and how did you make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through how you'd balance the cost of a new hospital with the potential health benefits to your community?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced competing priorities, like cost and quality, to make a decision affecting someone's well-being?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced individual well-being with resource constraints, and how did you navigate that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through how you would balance the cost of a new medical treatment with its potential health benefits for patients?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced competing priorities, like cost and quality, in a decision that impacted others' well-being?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with resource limitations, and how did you navigate that decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced competing priorities, such as cost and quality, and how did you make an informed decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you balanced competing priorities, such as cost and quality, in a personal or team project, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual well-being with resource constraints in a personal or team project, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced competing priorities, like cost and quality, in a decision that impacted others' well-being?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with limited resources, and how did you make that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced personal or community health needs with limited resources, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced individual well-being with resource constraints, and how this relates to your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced competing priorities, like cost and quality, and how did you make a decision that impacted others?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced personal or community health needs with limited resources, and how did you make your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did you navigate that situation effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced competing priorities, such as cost and quality, in a personal or group project?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with limited resources, and how did you prioritize decisions in that situation?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with limited resources, and how did that experience shape your decision-making approach?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an example from your life where you had to balance individual well-being with resource constraints, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with limited resources, and how would you approach such trade-offs in a healthcare setting?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with resource constraints, and how did you make your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced competing priorities, like cost and quality, in a personal or group project?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced competing priorities, like cost and quality, to make a decision that impacted others?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced competing priorities, like cost and quality, and how did you make a decision that benefited the greater good?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with resource constraints, and how did you make your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual needs with limited resources, and how did you make your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with resource constraints, and how did you make that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a situation where you balanced individual well-being with limited resources, and how did you make that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with resource constraints, and how did you navigate that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced individual well-being with resource constraints, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced competing priorities, like cost and quality, to make a decision that impacted people's well-being?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced competing priorities, like cost and quality, in a decision that impacted people's well-being?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual needs with limited resources, and how did you make your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual needs with limited resources, and how did you make that decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a situation where you balanced individual well-being with resource constraints, and how did you navigate this trade-off?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with limited resources, and how did you make your decision?",
    "criterion": "Skills"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your perspective on healthcare systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you ever managed a personal budget or helped others make cost-effective health decisions that impacted their well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your perspective on healthcare decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did this shape your understanding of healthcare systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual needs with limited resources, and how did that shape your perspective on decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource limitations, and how did that shape your perspective on healthcare systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did you navigate this trade-off?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced resource constraints with a desire to improve a community's well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you observed a healthcare challenge in your community and thought about how managing resources could improve the situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance limited resources with healthcare needs, and how did you approach that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed or addressed a challenge related to healthcare access or cost, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource limitations, and how did that shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance limited resources with healthcare needs, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you explored how healthcare resources are allocated in your community, and how might this influence your approach to decision-making in a health-focused role?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did you navigate that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance limited resources with healthcare needs, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource limitations, and how did that shape your perspective on healthcare systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your perspective on healthcare systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with limited resources, and how did that shape your perspective on healthcare systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced limited resources with a health or wellness goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance individual well-being with resource limitations, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance individual well-being with resource constraints, and how did you navigate that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource limitations, and how did you navigate that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your perspective on healthcare decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance limited resources with a health or wellness goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed or addressed a healthcare challenge, and how did it spark your interest in improving healthcare systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you helped organize or participated in an event that raised awareness or funds for a health-related cause?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed how costs or resources affected healthcare decisions, and how did that influence your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual well-being with resource limitations, and how did that experience shape your perspective on healthcare decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you had to balance individual needs with limited resources, and how did you approach this challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced competing priorities, like cost and quality, in a decision affecting someone's well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed or participated in a decision-making process related to healthcare resources or services?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance limited resources with a health or wellness goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did this shape your understanding of healthcare systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did you navigate that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance individual well-being with resource constraints, and how did you navigate that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed or participated in decision-making that balanced health outcomes with limited resources?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you balanced individual needs with limited resources, and how did that experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you observed or experienced a situation where resources were limited in a healthcare setting, and how did that influence your thoughts on decision-making in such contexts?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your understanding of healthcare systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource limitations, and how did this shape your perspective on healthcare decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource limitations, and how did that shape your understanding of decision-making in such contexts?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual needs with limited resources, and how did that shape your perspective on decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your understanding of decision-making in healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual needs with limited resources, and how did that shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual needs with limited resources, and how did that shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced limited resources to improve a health or wellness outcome, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did you navigate that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you participated in or observed situations where resources were scarce in a healthcare setting, and how did that influence your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed or addressed a healthcare challenge, and how you think economic or management principles could have improved the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed or addressed a healthcare challenge, and how did it spark your interest in balancing cost and care?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with limited resources, and how did that shape your perspective on healthcare decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you ever observed or experienced a situation where healthcare resources seemed scarce or unevenly distributed, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource limitations, and how did that shape your perspective on healthcare decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your perspective on healthcare decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you ever managed a budget for a school project or personal endeavor that involved balancing costs with health or wellness outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource limitations, and how did this shape your perspective on healthcare decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance limited resources with a health or wellness goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you explored or been impacted by how healthcare resources are allocated in your community, and how might this influence your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did you navigate that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did you approach this dilemma?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance individual well-being with limited resources, and how did you approach this challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual needs with limited resources, and how did that shape your perspective on decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did you navigate that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource limitations, and how did that shape your perspective on healthcare decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you engaged in activities or observed situations where healthcare resources were allocated, and how did that influence your perspective on balancing costs and patient care?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced limited resources to improve a health or community outcome, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual needs with limited resources, and how did this shape your understanding of decision-making in healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you had to balance individual well-being with limited resources, and how did you navigate that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced limited resources to improve a health or wellness outcome, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you engaged in activities or observed situations where financial decisions impacted healthcare access or outcomes, and how did that influence your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual needs with limited resources, and how did this shape your understanding of decision-making in healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your perspective on healthcare decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance individual well-being with limited resources, and how did you approach this challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your understanding of healthcare systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your perspective on healthcare systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource limitations, and how did that shape your perspective on healthcare decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and what did you learn from that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource limitations, and how did that shape your perspective on healthcare decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and what did you learn from that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your understanding of healthcare systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance limited resources with a goal of improving well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you ever managed a budget for a school project or helped a family member navigate healthcare costs?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your perspective on healthcare systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource limitations, and how did you navigate that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you describe a time when you helped manage a resource or made a decision that impacted someone's well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance limited resources with a health or wellness goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Have you engaged in activities or observed situations where balancing healthcare costs with patient outcomes sparked your curiosity about improving systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed or participated in decision-making that balanced healthcare needs with limited resources, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did that shape your perspective on healthcare decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource limitations, and how did you approach this challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you observed a healthcare challenge, and how you would approach balancing its economic and social implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance limited resources with health or wellness needs, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced resource constraints with healthcare needs, and how did that shape your perspective on decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced limited resources to improve a health or community outcome, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced individual well-being with resource constraints, and how did you navigate that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you balanced limited resources to achieve a health or wellness goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Health Economics & Management",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance limited resources with a health or wellness goal, and what did you learn from it?",
    "criterion": "Experiences"
  }
]