[
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or interests you've explored, and how you see them intersecting in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your diverse passions, how might combining two distinct fields of study help you create a unique career path or solve real-world problems?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you're passionate about that doesn't fit neatly into one discipline, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your diverse passions, how would combining two distinct fields in your degree help you stand out in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your diverse passions, how would you design a unique academic path that blends these interests to shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or interests you've explored, and how you see this blend shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different passions or subjects in a creative way, and how did that shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or fields you're passionate about that don't fit into one traditional major, and how exploring them together excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your diverse interests, how do you envision combining two distinct fields to create a unique career path or personal development journey?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you share an example of a unique combination of subjects or skills you're passionate about, and how exploring them together might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your diverse interests, how do you envision crafting a bespoke academic path that bridges multiple passions to shape your unique career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you share an example of a unique combination of subjects or interests you've explored, and how you see this blend shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your diverse passions, how might combining two distinct fields in your degree help you stand out in your future career or personal pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where combining two different fields sparked your curiosity, and how might this approach shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you share an experience where combining two different fields sparked your curiosity, and how might this blend shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or fields that fascinates you, and how exploring this intersection could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you share an example of a unique combination of subjects or interests you've explored, and how you see this shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or fields that genuinely excite you, and how exploring them together might shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or fields that genuinely excite you, and how exploring them together might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two passions or interests in a unique way, and how did that impact your personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you share an example of a unique combination of subjects or interests you've explored, and how you see this blend shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where combining two different fields sparked your curiosity, and how might exploring such intersections shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a topic or field you're passionate about that doesn't fit neatly into traditional academic categories, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excites you, and how exploring them together could shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a topic or activity outside your main studies that truly excites you, and how might pursuing it alongside your primary field shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or fields that genuinely excites you, and how exploring this intersection might shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you share an example of a unique combination of subjects or activities that excites you, and how exploring this intersection might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where combining two different fields sparked your curiosity, and how might exploring such intersections shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or fields that fascinates you, and how exploring this intersection could enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you share an example of a unique combination of subjects or interests you've explored, and how you see them intersecting in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or interests you've explored, and how you see this blend shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or interests you've explored, and how you see this blend shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or interests you've explored, and how you see them intersecting in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excites you, and how exploring them together might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where exploring a unique combination of subjects sparked your curiosity, and how might such exploration shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a topic or field that fascinates you, which isn't covered by traditional majors, and how exploring it could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where combining two different subjects sparked your curiosity, and how might this blend shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your diverse passions, how do you see combining two distinct fields shaping your future career or personal fulfillment?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a topic you're passionate about that doesn't fit into traditional academic categories, and how exploring it could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excites you, and how exploring this intersection might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your diverse interests, how do you see combining two distinct fields shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where exploring multiple subjects sparked your curiosity, and how might combining these passions shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into one academic discipline, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or fields that genuinely excites you, and how exploring this intersection could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you share an example of a unique combination of subjects or fields that fascinates you, and how exploring this intersection might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where exploring multiple subjects sparked your curiosity, and how might combining these interests shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your passions, how would you combine two distinct fields of study to create a unique career path that truly excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a topic or field you're passionate about that doesn't fit neatly into traditional categories, and how you see it shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your passions, how might combining two distinct fields of study help you create a unique career path or address a problem you care about?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or hobby you've pursued and how combining it with your future career aspirations excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where combining two different subjects sparked your curiosity, and how that relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a topic or field you're passionate about that isn't covered by traditional majors, and how exploring it could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where exploring multiple passions led to unexpected growth, and how might combining diverse interests shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Here is a concise question to assess a student's interest in the 'Individualised Second Major' at SMU, framed as requested: What unique combination of subjects would you pursue to bridge your diverse passions and prepare for a distinctive career path?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your diverse interests, how do you see combining two distinct fields shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or fields that genuinely excites you, and how exploring this intersection might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you tell me about a unique combination of subjects or fields that genuinely excites you, and how exploring them together might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your diverse interests, how do you envision combining two distinct fields to create a unique career path that truly excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you tell me about a topic or field that fascinates you, even if it's not traditionally paired with your primary major, and why exploring it further excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into one academic discipline, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or interests you're passionate about that don't fit into one traditional field, and how you see them intersecting in your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a topic or field that fascinates you, but isn't covered by traditional majors, and how exploring it could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you share an experience where combining two different fields sparked your curiosity, and how might exploring such intersections shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or fields that genuinely excite you, and how exploring them together could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or fields that genuinely excites you, and how exploring this intersection might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where exploring diverse subjects sparked your curiosity, and how might combining your passions shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excites you, and how exploring this intersection could shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excite you, and how exploring them together could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or skills you've explored, and how you see them intersecting in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you share an example of a unique combination of subjects or fields that genuinely excites you, and how exploring this intersection might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where combining two different fields sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where exploring multiple subjects sparked your curiosity, and how might combining these passions shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a topic or field that fascinates you, but isn't covered by traditional majors, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excites you, and how exploring them together could enrich your future path?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your diverse interests, how do you see combining two distinct fields shaping your unique career path or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an unconventional combination of subjects you're passionate about and how exploring them together could shape your unique career path or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or interests you've explored, and how you see them intersecting in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where exploring multiple subjects sparked your curiosity, and how combining these interests might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've explored outside traditional academics, and how might you design a path to integrate it into your future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how might exploring it in-depth shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you tell me about a unique combination of subjects or activities that truly excites you, and how exploring them together could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where combining two different fields sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a topic or field you're passionate about that doesn't fit neatly into traditional academic categories, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excite you, and how exploring them together could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or activities that excites you, and how exploring them together might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or fields that fascinates you, and how exploring them might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you're passionate about and explain how exploring it in-depth could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you share an unconventional field or topic you're passionate about, and how you see it intersecting with your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you'd love to explore in-depth, and how combining it with your primary field might shape your unique career path?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of subjects or interests you've explored, and how you see them intersecting in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you tell me about a time when you combined two different passions or subjects in a creative way, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excites you, and how exploring this intersection might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two passions to create something unique, and how did that shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you share an example of a unique combination of subjects or fields that genuinely excites you, and why does exploring this intersection matter to you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or fields that genuinely excite you, and how exploring them together might shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you're passionate about that doesn't fit into traditional disciplines, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your diverse passions, how might combining two distinct fields in your studies propel you toward a unique career or personal fulfillment path?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Reflecting on your diverse passions, how do you see combining two distinct fields shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excites you, and how exploring this intersection might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Could you share an experience where exploring multiple subjects sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of interests or skills you've pursued, and how you see this blend shaping your future career or personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time you combined two different interests or skills to achieve something meaningful, and how did this experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in an innovative way, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how you tailored your approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of interests or skills you've explored, and how you think this blend could enrich your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a unique combination of two disciplines that align with your passions and explain how this blend will enhance your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or skills you're passionate about that don't fit into one traditional field, and how you'd apply them?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of how you've combined two different interests or skills to achieve a personal or academic goal?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined unrelated interests or skills to achieve something meaningful, and how did this shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a bespoke academic path combining two passions of yours, and explain how this fusion will prepare you for a unique career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside academics, and how might you integrate it into a customised learning path?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside academics, and how do you see it intersecting with your future career goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how you tailored your learning approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests to achieve something meaningful, and how did this shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more different interests to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest you've pursued outside traditional academics, and how you tailored your approach to explore it deeply?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a unique combination of two disciplines that align with your passions and explain how this blend will enhance your future career prospects?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of interests or skills you've explored, and how you think this blend could enrich your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of how you've combined two different interests or skills to achieve a goal, and what did you learn from this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more different interests to achieve a personal goal or solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how you think it could intersect with your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a unique combination of two fields that fascinate you and explain how this blend will enhance your future career or personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time you combined two different interests or skills to achieve something meaningful, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more different interests to achieve a goal, and how did that shape your learning approach?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics and how you'd integrate it into your future studies?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more different interests to create something innovative, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different areas of interest to achieve something meaningful, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a unique blend of two disciplines that aligns with your passions and explain how this fusion will enhance your future career or personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest you've pursued outside traditional academics, and how might integrating it with your primary field enhance your future impact?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more different interests to achieve a goal, and how did this integration shape your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of how you've tailored your learning or projects to align with your unique interests, and what motivated this approach?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different passions or interests to create something unique, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests to achieve a goal, and how did this integration enhance your outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different areas of interest to create something unique, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of interests or skills you've pursued, and how you adapted them to achieve a personal goal?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different areas of interest to create something unique, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest you've pursued outside traditional academics and how you'd integrate it into a customised learning path?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside academics, and how you think exploring it in-depth could shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or skills you're passionate about that don't fit into one traditional field, and how you'd apply them?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest you've pursued outside academics and how you'd integrate it into a customised learning path?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a unique combination of two fields that fascinate you and explain how this blend will enhance your future career or personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more of your interests to create something innovative, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest you've pursued outside of academics and how you tailored your approach to explore it deeply?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how might you integrate it into a customised field of study?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more different interests to create something innovative, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a unique combination of two fields that fascinate you and explain how this blend will enhance your future career or personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different interests or skills to achieve something meaningful, and how did this experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside of academics, and how you tailored your approach to exploring it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different passions or interests to create something unique, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a unique combination of two disciplines that align with your passions and explain how this blend will enhance your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest you've pursued outside traditional academics and how you'd integrate it into a customised learning path?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how might integrating it into your studies shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a unique combination of two subjects that excites you, and explain how this blend will prepare you for your dream career or personal aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different interests or skills to achieve something meaningful, and how did that impact your growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics and how you tailored your approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of interests or skills you've developed, and how you see them intersecting in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside academics, and how might integrating it with your studies shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined two different interests or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more different interests to create something unique, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more different interests to achieve something meaningful, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more interests to create something unique, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest you've pursued outside academics and how you adapted your approach when faced with unexpected challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a unique combination of two fields you're passionate about and explain how this blend will enhance your future career or personal fulfillment?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a unique learning path combining your passions, and how would this bespoke approach propel your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different interests or skills to achieve something meaningful, and how did this experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique combination of interests or skills you've explored, and how you think they might intersect in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how you tailored your learning approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how do you see it shaping your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time you combined two different interests or skills to achieve something unique, and how did this experience shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how might integrating it with your future studies foster innovative thinking?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how you'd integrate it into a customised learning path?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of how you've combined two different interests or skills to achieve a goal, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in an innovative way, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics and how you tailored your approach to exploring it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different interests or skills to achieve something meaningful, and how did that impact your growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time you combined unrelated interests or skills to achieve something unique, and how did that impact your growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest you've pursued outside academics and how you adapted your skills to explore it effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a unique combination of two fields you're passionate about and explain how this blend will prepare you for your dream career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest you've pursued outside academics and how you'd integrate it into a customised learning path?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more unrelated interests to create something innovative, and what did you learn from this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time you combined two different interests or skills to achieve something meaningful, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of how you've combined two different interests or skills to achieve a goal, and what did you learn from this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a custom learning path that blends your diverse interests, and how would this unique combination prepare you for a rapidly evolving career landscape?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different interests or skills to achieve something meaningful, and how did that impact your growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different interests or skills in a creative way, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside academics, and how you think combining it with your primary field could create innovative opportunities?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside academics, and how you tailored your approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside of academics and how you tailored your learning approach to explore it deeply?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a unique combination of two subjects you're passionate about and explain how this blend will prepare you for a fulfilling career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a customised learning path that blends your passions and strengths, preparing you for a unique career or personal achievement?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest you've pursued outside academics and how you tailored your approach to exploring it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest you've pursued outside traditional academics, and how you think it could intersect with your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different interests or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more of your interests to achieve a goal, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or hobby you've pursued and how you've tailored your learning to deepen your engagement with it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you design a unique combination of two academic fields that align with your passions and explain how this blend will enhance your future career prospects?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way, and how did that shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest you've pursued outside academics and how you've tailored your approach to explore it deeply?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more different interests to achieve a goal or create something unique?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different fields or interests in a creative way that excited or challenged you?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more different interests to achieve a personal or academic goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or fields to create something new or solve a problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more passions to achieve something meaningful, and how did this shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more interests to create something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined different interests or skills to achieve a goal or solve a problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more interests to achieve something meaningful, and how did this shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more interests to achieve something meaningful, and how did this shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to achieve something meaningful, and how did this shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you've combined two or more interests to achieve a goal, and how did that shape your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different fields or interests to achieve something meaningful, and how did this shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a unique way that surprised others or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different interests or skills to achieve a goal, and how did that shape your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or skills in an innovative way, and what did you learn from integrating these diverse interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a unique way, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different fields or interests to achieve a goal, and how did that shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different areas of interest to achieve a goal or solve a problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more different interests to create something unique, and what did you learn from this experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined two different interests or fields to achieve something meaningful or innovative?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more passions to achieve a goal, and what did you learn from integrating these interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills to achieve something meaningful, and how did this shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued an unconventional interest outside of traditional subjects, and how did that experience shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more different interests to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project or interest you've pursued outside academics, and how it might shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more different interests to achieve a goal or solve a problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined different interests or skills to achieve something meaningful, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way that surprised others or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined two different interests or fields to achieve something meaningful, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different interests or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined unrelated interests or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills in a unique way that excited you?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills in a unique way that might shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you've combined different fields or interests to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to achieve a goal, and how did this experience shape your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different areas of interest to achieve a goal or solve a problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way that surprised others or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way that surprised you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more of your interests in a creative way, and how did that experience shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more interests to achieve a goal, and how did that shape your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or fields in a creative way, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more interests to achieve a unique outcome, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way that surprised you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project or initiative where you combined multiple passions or interests to achieve a meaningful outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way that surprised others or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time you combined different interests or skills to achieve a goal, and how did this experience shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills to achieve a goal, and how did this shape your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined two or more interests to create something unique, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more different interests to achieve something meaningful, and how did this shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or interests in a unique way that excited you for future exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how might this shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined seemingly unrelated interests or skills, and how did that shape your goals or self-perception?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two different interests or skills in a creative way, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined different interests or skills to achieve something meaningful?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you pursued a unique interest or passion project outside traditional boundaries, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills in a unique way that surprised others or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project or interest you've pursued that didn't fit into traditional categories, and how did you navigate its unique demands?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different fields or interests to achieve something meaningful, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined different interests or skills to achieve something meaningful?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined two or more different interests to achieve a personal or academic goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way that surprised you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you pursued a unique combination of interests or skills, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you've combined two different interests or skills in a creative way, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills in a creative way that might inspire your future path?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way that surprised you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more interests to achieve a goal, and how did this shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way that surprised you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a unique way that excited you?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more interests to achieve something meaningful, and what did you learn from integrating these passions?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more passions to create something unique, and what did you learn from integrating these interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way that surprised others or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way that surprised you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or skills in an innovative way, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way that surprised others or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different areas of interest to solve a problem or pursue a project?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or skills to achieve a goal, and how did this shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined different interests or skills to achieve something meaningful, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project or initiative where you combined diverse interests to achieve a meaningful outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more interests to achieve a goal, and how did this integration shape your learning or growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you pursued a unique interest or passion outside traditional paths, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more interests to achieve a goal, and what did you learn from integrating them?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way that excited you for future possibilities?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more interests to achieve something meaningful, and how did this shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different fields or interests in a creative way, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different passions or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined unrelated skills or interests to achieve something meaningful, and how did this shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined two or more different interests to achieve something meaningful or innovative?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or fields to achieve something meaningful or innovative?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different interests or skills in a creative way that surprised you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project or initiative where you combined multiple passions or interests, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills in a unique way, and how did that impact your learning or growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued an unconventional interest or combined different passions - how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more interests to achieve something meaningful, and what did you learn from integrating these passions?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined different passions or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined different interests or skills to achieve something meaningful, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two different fields or interests in a creative way that surprised others or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Second Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to achieve a goal, and how did this shape your aspirations?",
    "criterion": "Experiences"
  }
]