[
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple passions or interests to achieve something meaningful, and how might this approach shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or passions you've explored, and how might integrating them shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or fields that genuinely excite you, and how exploring them together could shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Could you share an example of a unique combination of subjects or interests you'd love to explore in depth, and how might this shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excites you, and how exploring this intersection might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or subjects to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excites you, and how exploring this intersection could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Could you share an unconventional topic or field that fascinates you, and how might you design a personalized academic path to explore its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or passions you'd love to explore together, and how might this blend shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you're passionate about that doesn't fit into traditional disciplines, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or fields that genuinely excite you, and how exploring them together could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or themes you're passionate about that don't fit into one traditional field, and why exploring them excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or themes you're passionate about that don't fit into one traditional field, and why exploring them together excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into traditional academic categories, and how you'd explore it?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or interests to create something unique, and how did that shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you're passionate about that doesn't fit into traditional disciplines, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or field you're passionate about that doesn't fit neatly into traditional disciplines, and how you'd explore it in depth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or themes you're passionate about that don't fit into one traditional field, and why exploring them together excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique passion or interest you've pursued outside traditional academics, and how might you integrate it into a customised degree path?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where exploring a unique combination of subjects sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic or field that genuinely excites you, and how might pursuing it shape your future aspirations or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where exploring a unique combination of subjects sparked your curiosity, and how might that shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Could you share an experience where you combined different passions or skills to achieve something meaningful, and how might that shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or subjects in a creative way, and how did that shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or themes you're passionate about that don't fit neatly into one traditional field, and how might exploring these together shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you tell me about a unique combination of subjects or fields that genuinely excite you, and how exploring them together could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or passions you'd love to explore together, and how might they shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or subjects in a unique way, and how did that shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that isn't covered by traditional majors, and how you'd design a customised learning path around it?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or subjects to achieve something meaningful, and how did that shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or themes you're passionate about that don't fit into a traditional academic box, and why exploring them matters to you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into traditional academic categories, and how you'd explore it in-depth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Could you share an example of a unique passion or interest you've pursued that doesn't fit neatly into traditional categories, and how you see it shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you're passionate about and how you'd design a unique academic path to explore its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or fields that genuinely excite you, and how exploring them together could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into traditional academic categories, and how you'd like to explore it in depth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Could you share an unconventional topic you're passionate about that doesn't fit into traditional disciplines, and how you'd explore its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or subjects in a unique way, and how did that shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excite you, and how exploring them together could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you're passionate about that isn't covered by traditional majors, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or fields that genuinely excite you, and how exploring them together could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or field that genuinely excites you, and how you'd design a customised learning path to explore it in-depth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excites you, and how exploring them together might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you tell me about a time when you combined different subjects or interests to explore something new - what sparked that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into traditional disciplines, and how you'd explore it in-depth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Could you share an unconventional topic you're passionate about that doesn't fit into traditional academic boxes, and how you see it shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that truly excites you, and how exploring this custom blend might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Could you share an experience where you combined different passions or skills to achieve something meaningful, and how did that shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different subjects or skills to achieve something meaningful, and how did that shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different subjects or interests to achieve a goal, and how did that shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or themes you're passionate about that don't fit into one traditional category, and why exploring them matters to you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple passions or interests to achieve something meaningful, and how might that shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or interests to achieve something meaningful, and how did that shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or interests you're passionate about that you wish to explore in-depth, and why do they excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you're passionate about that doesn't fit into traditional academic boxes, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you're passionate about that doesn't fit into traditional academic boxes, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or field you're passionate about that doesn't fit neatly into traditional categories, and how you see yourself exploring it in depth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or passions you'd love to explore together in your university journey and why they excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or themes you're passionate about that don't fit into one traditional field, and how exploring them together excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique topic or issue that fascinates you, and how you'd design a custom learning path to explore it?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or subjects in a creative way, and how did that shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion that doesn't fit into traditional categories and how you'd like to explore it further?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or themes you're passionate about that don't fit into one traditional major, and how exploring them together excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into traditional academic categories, and how you'd explore it in-depth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where exploring multiple subjects sparked your curiosity, and how might combining these passions shape your future path?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that isn't covered by traditional majors, and how you'd design a custom learning path around it?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you're passionate about and how you'd design a unique academic path to turn it into a meaningful career?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or themes you're passionate about that don't fit into one traditional field, and how might exploring these together shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or fields that fascinate you, and how exploring them together might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into one traditional discipline, and how you'd explore it in depth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into one academic category, and how you'd explore it?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue that fascinates you, which doesn't fit neatly into traditional academic categories, and how you'd explore it further?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into one subject area, and how you'd explore it in depth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into one traditional field of study, and how you'd explore it?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or subjects in a unique way, and how did that shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside of school, and how might you design a customised learning path around it?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you're passionate about that isn't covered by traditional majors, and how exploring it deeply could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or subjects in a unique way, and how did that shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Could you share an example of a unique combination of subjects or fields that genuinely excites you, and how exploring this intersection might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that truly excite you, and how exploring them together might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or fields that excite you, and how exploring them together could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or interests you're passionate about that don't fit neatly into one traditional field, and how might you explore them further?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into one discipline, and how you'd explore it in-depth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that truly excites you, and how exploring them together could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or themes you're passionate about that don't fit into one traditional field, and how exploring them might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple passions to achieve a goal, and how did that shape your aspirations for a customised academic path?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into traditional academic categories, and how you'd explore it in depth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into traditional academic categories, and how you'd explore it in depth?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or skills to achieve something meaningful, and how might you continue exploring such intersections in your future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you're passionate about that isn't covered by traditional majors, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or subjects in a creative way, and how did that impact your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a unique combination of subjects or fields that genuinely excite you, and how exploring them together might shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you tell me about a time when you combined different passions or subjects to create something meaningful, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or themes you're passionate about that don't fit into one traditional field, and how exploring them might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or subjects in a unique way, and how did that shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a unique combination of subjects or fields that genuinely excite you, and how exploring them together might shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share a personal experience where exploring a unique combination of subjects sparked your curiosity, and how might that shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or field that fascinates you, which isn't covered by traditional majors, and how exploring it could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a topic or issue you're passionate about that doesn't fit neatly into traditional academic categories, and how you'd explore it?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an unconventional topic you're passionate about that doesn't fit neatly into traditional disciplines, and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued independently, and how you tailored your approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how might you design a path to integrate it into your future studies or career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique learning path combining your passions and strengths, and explain how it prepares you for a fulfilling career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued independently, and how do you see it shaping your future academic or professional path?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different subjects or skills to achieve a goal, and how did this shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time you combined different passions or interests to create something unique, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued independently, and how you tailored your approach to achieve personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how do you see it shaping your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued on your own, and how you tailored your approach to explore it deeply?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued independently, and how you tailored your approach to achieve personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined different passions or interests to create something unique, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a bespoke learning path that blends your diverse passions, and how would you measure its success in preparing you for a fulfilling career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued independently, and how you tailored your approach to explore it deeply?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills to achieve a personal goal, and how did this shape your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time you combined diverse interests or skills to achieve a personal goal, and how did this experience shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique project that blends your passions and strengths, explaining how it prepares you for a fulfilling career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different passions or skills to achieve a unique goal, and how did that experience shape your aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined unrelated passions or skills to create something unique, and how did this shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to achieve a goal, and how did this shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different passions or interests to achieve a personal goal, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to achieve something unique, and how did that shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project that sparked your curiosity, and how you tailored your approach to achieve your unique goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique course of study that blends your passions and strengths, and explain how it prepares you for a fulfilling career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique project or idea you've pursued outside of academics, and how it reflects your ability to design a personalized path?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how you tailored your approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a bespoke academic path that blends your diverse passions, and how would this unique focus propel your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued an unconventional interest or combined different passions, and how did that shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique project or initiative you've led, and how you tailored your approach to achieve a personal or innovative goal?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside of academics and how you tailored your learning approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique project that combines your greatest passions with real-world impact, and how would you adapt it to evolving challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a bespoke learning path integrating your passions and strengths, and explain how it would prepare you for a fulfilling, unconventional career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you've tailored your learning or projects to pursue a unique interest - how did you adapt and what did you discover about yourself?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique academic path combining your passions and strengths, and explain how it would prepare you for a fulfilling career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a time you combined unrelated passions or interests to create something unique, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you had to design a personal project from scratch, and how did you tailor it to your unique interests and goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined unrelated interests or skills to achieve a personal goal, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how you tailored your approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined unrelated interests or skills to achieve a personal goal, and how did this shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to achieve a unique goal, and how did that shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a self-directed project you've initiated and how it reflects your ability to design a personalised learning path aligned with your passions?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics, and how you tailored your approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued independently, and how do you see it shaping your future academic or professional path?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued independently, and how you tailored your approach to achieve personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined unrelated passions or skills to achieve something meaningful, and how did this shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics and how you tailored your approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued independently, and how you tailored your approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to achieve a goal, and how did this shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined unrelated interests or skills to achieve a personal goal, and how did this shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you had to design a personal project from scratch, and how did you ensure it aligned with your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project you've undertaken and how it helped you discover new interests or skills?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time you combined unrelated interests or skills to achieve a goal, and how did this experience shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined two or more interests to create something unique, and how did that shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique project or idea you've pursued that doesn't fit into traditional categories, and what motivated you to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique blend of subjects from different disciplines that excites you, and explain how this combination will help you achieve your long-term goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined unrelated interests or skills to achieve a goal, and how did this shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined multiple interests or skills to achieve a personal goal, and how did this experience shape your aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique project or initiative you've undertaken that blends multiple passions, and how you navigated the challenges of self-directed learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a bespoke degree programme blending your passions, and explain how this unique combination would propel your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique learning path that combines your diverse interests to tackle a real-world problem, and how would you measure its success?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined unrelated passions or interests to achieve something meaningful, and how did this shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics and how you tailored your approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined unrelated passions or skills to create something new, and how did this process shape your learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique field of study combining two passions and explain how this blend will prepare you for a fulfilling career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined unrelated passions or skills to create something unique, and how did this shape your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside of academics, and how you think it could intersect with your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a bespoke learning path that combines your passions and strengths, and explain how it would prepare you for a fulfilling career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued independently, and how you tailored your learning approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined multiple passions or interests to create something unique, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined multiple passions or interests to achieve a personal goal, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique project or initiative you've led, and how you tailored your approach to achieve personal or collective growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to achieve a personal goal, and how did this experience shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique learning path that blends your diverse interests to address a real-world challenge, and why does this approach excite you?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a bespoke learning path that blends your passions with emerging industry trends, and how would you measure its success?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined seemingly unrelated interests or skills to achieve a personal goal or solve a problem?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined different interests or skills to pursue a unique goal or project?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you tailored your learning approach to pursue a unique interest, and how did that shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued on your own, and how do you see it shaping your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics and how you tailored your approach to explore it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple passions or interests to achieve a personal goal, and what did you learn from integrating these different aspects?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique learning path that combines your passions and strengths, and explain how it prepares you for a fulfilling career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you had to design a personal project from scratch, and how did you ensure it aligned with your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique academic path that blends your passions and strengths, and explain how it would prepare you for your dream career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued independently, and how you tailored your approach to achieve personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued outside traditional academics and how you tailored your approach to exploring it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique academic path combining your passions and strengths, and explain how it would prepare you for a fulfilling career?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined multiple passions or interests to create something unique, and how did you navigate any challenges that arose?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or subjects to create something meaningful, and how did this impact your growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different passions or skills to achieve a goal, and how did this experience shape your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued independently, and how you tailored your approach to achieve personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to create something unique, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple interests to achieve a goal, and how did this shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique blend of disciplines to tackle a global challenge you're passionate about, and explain how this fusion would drive your future impact?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you design a unique academic path combining your passions, and how would you convince others of its value in achieving your long-term goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you combined two or more unrelated interests to create something meaningful, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined two or more unrelated interests to create something new, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined multiple passions or interests to create something unique, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different passions or subjects to create something unique, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued independently and how you tailored your approach to achieve personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a unique interest or passion you've pursued independently, and how do you think cultivating such self-driven learning will shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different subjects or interests to solve a problem or pursue a passion, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined seemingly unrelated interests or skills to achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project or initiative you've undertaken that blends multiple passions or interests, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you pursued a unique interest or passion that didn't fit into traditional categories, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or interests to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you had to design your own learning path or project - what inspired it and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you designed or pursued a personal project that didn't fit into traditional categories, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different passions or interests to achieve a goal, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills to achieve a personal goal, and how did this shape your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you pursued a unique interest or passion project outside traditional boundaries, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you tailored your learning or activities to pursue a unique interest, and what did you discover about yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you tailored your learning or projects to fit your unique interests, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you pursued a unique interest or passion that didn't fit into traditional categories, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to achieve a personal goal, and how did that shape your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple passions or interests to create something unique, and what did you learn from that process?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills to achieve something meaningful, and how did this shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you had to design or create something from scratch that didn't fit into traditional categories?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills in an innovative way that excited you?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple passions or interests to achieve a personal goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or skills to achieve a unique goal, and how did that shape your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project or initiative where you combined multiple passions or interests to achieve a meaningful outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued an unconventional interest or combined different passions - what drove your curiosity and how did it shape you?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills in a unique way, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you've combined different interests or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you've combined multiple passions or interests to create something unique, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued an unconventional interest or created a personalized project? How did this experience shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project or initiative you've undertaken that didn't fit into traditional categories, and what motivated you to pursue it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined multiple passions or interests to create something unique, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or subjects in a unique way that excited you?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued a unique interest or project that didn't fit into traditional categories?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different subjects or interests to achieve a personal goal or solve a problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you've combined different passions or interests in a creative way that hints at your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you've combined different interests or skills in a creative way, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project or initiative where you combined multiple passions or interests to achieve a unique goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or interests to achieve a unique goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills in an innovative way, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to pursue a unique goal, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you pursued a unique interest or passion that didn't fit into traditional categories, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project or initiative you've undertaken that didn't fit into traditional categories, and what motivated you to pursue it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you pursued a self-directed project or interest that didn't fit into traditional categories?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued a self-directed project or passion that didn't fit into traditional categories, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you've combined different interests or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you had to design or shape your own learning path, and how did that impact your growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different subjects or interests to create something unique, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different passions or interests to create something unique, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued an unconventional interest or combined different passions? What did you learn from integrating these diverse areas?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple passions or interests in a unique way, and what did you learn from that integration?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you've had to design or shape your own learning path, and what did you learn about your interests through that process?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you designed or pursued a unique path that combined your passions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you designed or pursued a personalized project that blended multiple interests, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you designed or adapted something to fit your unique interests, and what did you learn from that process?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project or initiative you've undertaken that reflects your unique interests and strengths?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple passions or interests in a unique way, and what did you learn from integrating them?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different subjects or skills to pursue a personal project or interest, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple passions or interests to achieve a goal, and what did you learn from integrating different areas?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you've blended different fields or interests to achieve something meaningful, and how did this shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined multiple passions or interests to achieve a personal goal or solve a problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined multiple interests or skills to pursue a unique project or goal that wasn't predefined for you?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you had to design your own learning path or project - what inspired it and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple passions or interests in a unique way, and what did you learn from integrating them?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to pursue a unique project or goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued an unconventional interest or combined diverse passions, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you pursued a unique interest or combined different passions, and what did you learn about your strengths from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued a unique interest or passion project that didn't fit into traditional categories, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined seemingly unrelated interests or skills to achieve a personal goal or solve a problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you've had to design or shape your own learning path, and what motivated you to take that approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different passions or subjects to create something unique, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you've had to design or shape your own learning path, and what motivated you to take that approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined multiple passions or interests to pursue a unique project or goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you had to design your own learning path or project, and what did you learn about your interests and strengths?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you pursued a unique interest or passion that didn't fit into traditional categories, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple passions or interests to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you had to design or shape your own learning path, and how did that impact your growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you pursued an unconventional interest or project that didn't fit into traditional categories?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a self-directed project or initiative you've undertaken that blended multiple interests, and what did you learn from integrating diverse passions?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different subjects or interests to explore a unique topic, and how did that experience shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued a unique interest or passion that didn't fit into traditional categories, and how did that experience shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or subjects in a creative way that hints at your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or disciplines to achieve a goal, and what did you learn from this experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued a self-directed project or interest outside of traditional academics, and what motivated you to take the initiative?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued a unique interest or passion that didn't fit into traditional categories, and how did you navigate that?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued a unique interest or combined different passions outside of traditional subjects, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills in a unique way, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different passions or skills to achieve something meaningful, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an example of a time when you pursued a unique interest or combined different passions, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple passions or interests to achieve a goal, and how did this shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you pursued a unique interest or passion project that didn't fit into traditional categories, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you pursued a unique interest or passion that didn't fit into traditional categories, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple passions or interests to achieve a goal, and what did you learn from integrating these aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined multiple interests or disciplines to achieve a goal, and what did you learn from integrating different areas?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you describe a time when you combined different interests or skills to achieve a goal, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you've pursued a unique interest or passion that didn't fit into traditional categories, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you had to design or create something from scratch that didn't fit into traditional categories?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you had to design or shape your own learning path, and how did that impact your growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you pursued an unconventional interest or combined different passions - how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Individualised Major",
    "school": "SMU",
    "question": "Can you share an experience where you combined different interests or skills in a unique way, and what did you learn from integrating them?",
    "criterion": "Experiences"
  }
]