[
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you protected sensitive information, and how did that shape your curiosity about safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Imagine a world where data breaches are rampant; what motivates you to be part of the solution, and how do you see yourself contributing?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you protected sensitive information, and how did that experience spark your curiosity about safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect something valuable from being accessed by others - how did that make you feel?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been curious about how your personal data is protected online, and could you see yourself designing such safeguards in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach or privacy issue that sparked your curiosity to protect people's digital lives, and why does that motivate you?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever helped someone protect their personal data online, and if so, what motivated you to take that initiative?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been intrigued by how personal data is protected online, and can you see yourself contributing to safeguarding digital spaces in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you protected sensitive information or wish you had, and how did that experience spark your curiosity about safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect something valuable from potential risks, and how did that shape your curiosity about safeguarding digital information?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share a time when you protected sensitive information or wished you had, and how did that experience shape your curiosity about safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did that spark your curiosity about safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you protected something valuable from being accessed by others - how did that make you feel about safeguarding digital information?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been curious about how your personal data is protected online, and could you see yourself helping to safeguard such information in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you took initiative to protect personal or shared information, and what motivated you to act?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected someone's secret or valued privacy? How do you think safeguarding digital information could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been curious about how your personal data is protected online, and would you enjoy a career safeguarding such information?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been curious about how your personal data is protected online, and could you see yourself designing such safeguards in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you protected something valuable from being accessed by others, and how did that make you feel about safeguarding information?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach or privacy issue online that sparked your curiosity about protecting digital information?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how personal data is protected online, and can you see yourself contributing to safeguarding digital spaces in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach in the news and thought about how you could help prevent such incidents in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been curious about how your personal data is protected online, and could you see yourself helping to safeguard it in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Imagine a world where personal data is frequently breached; what motivates you to contribute to safeguarding digital information in such a landscape?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach or privacy issue online, and how did that experience spark your curiosity about protecting digital information?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever helped someone protect their online information or thought about a career where safeguarding digital data is key?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did that spark your curiosity about safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you protected sensitive information, and how did that spark your curiosity in safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you protected sensitive information, and how did that spark your curiosity about safeguarding digital assets in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach in the news and thought about how you'd protect people's information in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach or privacy issue that sparked your curiosity, and how do you think individuals can better protect themselves online?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did that shape your curiosity about safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how personal data is protected online, and could you see yourself contributing to safeguarding digital spaces in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how technology protects sensitive information, and can you see yourself contributing to safeguarding the digital world?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a cybersecurity breach in the news or personally, and how did it spark your curiosity about protecting digital information?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach or privacy issue that sparked your curiosity to protect people's digital lives and futures?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share a moment when you felt the need to protect something valuable from potential risks, and how did that experience shape your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did that experience spark your curiosity about safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been curious about how to protect sensitive information from cyber threats, and how that impacts our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how technology can both empower and endanger us, and how would you contribute to safeguarding our digital future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did that experience shape your curiosity about safeguarding digital data?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how personal data is protected online, and can you see yourself contributing to safeguarding digital spaces in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever helped someone protect their online information, and what motivated you to take on that responsibility?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach in the news, and if so, what motivated you to learn more about protecting digital information?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a cybersecurity breach in the news, and if so, how did it spark your curiosity about protecting digital information?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Imagine a world where cyberattacks are rampant; what sparks your curiosity about protecting digital spaces, and how do you see yourself contributing to this effort?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Imagine securing your dream company from cyber threats - what excites you about protecting sensitive information in our increasingly digital world?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach in the news and thought about how you could help prevent such incidents in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how technology protects sensitive information, and can you envision yourself contributing to safeguarding digital futures?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been intrigued by how personal data is protected online, and can you see yourself contributing to safeguarding digital spaces in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a situation where you had to protect sensitive information, and how did that experience spark your curiosity in safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach in the news and wondered how you could help prevent such incidents in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did that spark your curiosity in safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been intrigued by how your personal data is protected online, and could you see yourself designing such safeguards in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how technology protects sensitive information, and can you see yourself contributing to this critical field in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how technology protects sensitive information, and can you share an experience that sparked your curiosity in this area?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been intrigued by how your personal data is protected online, and can you see yourself contributing to safeguarding such information in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a cybersecurity breach in the news and thought about how you could help prevent such incidents in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how personal data is protected online, and could you see yourself contributing to safeguarding digital spaces in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach or privacy issue online that sparked your curiosity about protecting digital information, and why did it resonate with you?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how technology protects sensitive data, and can you envision yourself contributing to this critical field in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected someone's sensitive information or wished you could? How does that experience spark your curiosity about safeguarding digital futures?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you protected sensitive information, and how did that experience spark your curiosity about safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach in the news and thought about how you'd prevent such incidents in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how personal data is protected online, and can you envision yourself contributing to safeguarding digital spaces in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect something valuable from being accessed by others - how did that make you feel?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach or cyberattack in the news, and if so, what sparked your curiosity about protecting digital information?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach in the news? How would you react if your personal online accounts were compromised, and what would you do to prevent it?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever helped someone protect their online identity or secured a personal device from potential threats, and what sparked your curiosity in such challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how people protect sensitive information online, and could you see yourself contributing to this effort in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect something valuable from potential risks, and how did that shape your curiosity about safeguarding digital information?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how technology protects sensitive information, and can you envision yourself contributing to this critical field?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been intrigued by how technology protects sensitive information, and can you envision yourself contributing to these safeguards in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how technology protects our digital lives, and could you see yourself contributing to this effort in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach in the news and thought about how you'd prevent such incidents in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Imagine discovering a vulnerability in a widely-used app - what excites you about being the one to identify and mitigate such risks?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did that spark your curiosity in safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach in the news and thought about how you'd prevent such incidents in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share a time when you took initiative to protect personal data or secure an online account - what motivated you?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach in the news and thought about how you could help prevent such incidents in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach or privacy issue that sparked your curiosity to learn how to protect people's digital lives?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been intrigued by how technology protects sensitive information, and can you see yourself contributing to safeguarding digital spaces in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how technology protects our digital lives, and could you see yourself contributing to that protection in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Imagine discovering a vulnerability in your favorite app - what excites you about being the one to find and fix such digital threats?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach in the news and thought about how you'd prevent it in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Imagine securing your favorite social media platform from hackers - what excites you about protecting people's online lives and data every day?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did that experience spark your curiosity about safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect something valuable from potential risks, and how did that shape your curiosity about safeguarding digital information?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been curious about how to protect personal data from cyber threats, and how that relates to your desired career path?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been curious about how your personal data is protected online, and could you see yourself contributing to safeguarding such information in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how technology protects sensitive information, and can you see yourself contributing to this critical field in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did that experience spark your curiosity about safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach in the news and thought about how you'd prevent such incidents in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share a time when you took initiative to protect personal or shared digital information, and what motivated you to do so?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how personal data is protected online, and can you see yourself contributing to safeguarding digital spaces in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share a recent experience where you had to protect sensitive information, and how did that spark your curiosity about safeguarding digital assets?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever been fascinated by how technology protects sensitive data, and can you envision yourself contributing to safeguarding the digital world?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect something valuable from being accessed by others - how did that make you feel?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever encountered a situation where your personal data was at risk, and how did that experience shape your curiosity about protecting digital information?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever witnessed a data breach in the news and wondered how you could help protect people's information in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect a personal online project from potential cyber threats, and what motivates you to stay ahead of such risks?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how would you adapt those strategies to a digital world?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to a digital world?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time you protected sensitive information, and how would you adapt those strategies to safeguard digital data in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure its safety?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure its safety?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect a new social media account from common online threats, and why those steps matter to you?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect a personal online project from common cyber threats, even with limited resources?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies in a rapidly evolving digital world?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time you protected sensitive information, and how would you adapt those strategies to safeguard digital data in a rapidly evolving tech landscape?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time you protected sensitive information, and how would you adapt those strategies to safeguard digital data in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect a personal project, like a school website, from common online threats you've heard about?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever secured your personal online accounts? How would you improve the security of a friend's vulnerable social media account?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect your school's online voting system from potential hackers, ensuring only eligible students can vote?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you approach securing it in a rapidly evolving digital world?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure its safety from potential threats?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect a school project from potential online threats, even if you've never worked on one before?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did you ensure its safety from potential threats?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect a friend's new online business from common cyber threats, using only free resources?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect a personal online project, like a school blog, from common cyber threats you've heard about?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time you protected sensitive information, such as a friend's secret or your own online accounts, and how did you ensure its safety?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies in a rapidly evolving digital landscape?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information in a personal or group project, and how did you ensure it remained confidential?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how would you adapt those strategies in a digitally connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information from potential risks, and how would you ensure the confidentiality of valuable data in a connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information from unintended access? How would you ensure your friends' personal data stays safe in a school project?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information online? How would you safeguard a friend's personal data from potential cyber threats?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how would you adapt those strategies in a digitally connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you ensure its security in a digitally connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you protected sensitive information, and how would you adapt those strategies to safeguard digital assets in a rapidly evolving tech landscape?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect sensitive personal data from potential online threats in a project you're leading?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you improve that approach in the digital age?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure its safety?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever encountered a situation where personal data was at risk? How would you prioritize protecting it in a digitally connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect sensitive personal data, like your family photos, if you accidentally left your laptop at a public café?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and what steps did you take to ensure its security?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information, and if so, what strategies would you use to safeguard it from potential threats in a connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and what steps did you take to ensure its safety?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd secure your personal online accounts if you discovered a phishing attempt targeting your social media profiles?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you protected sensitive information, and how would you adapt those strategies to safeguard digital data in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time you protected sensitive information, and how would you adapt those strategies to safeguard digital assets in a rapidly evolving tech landscape?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure its security?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd secure your personal online accounts if you discovered a friend's account was recently hacked?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure its safety?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect a school project's confidential data from potential online threats, considering you have limited technical expertise?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected a personal project or idea from being copied, and how did you ensure its security?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information from potential threats, and if so, what strategies did you use to keep it secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you protected sensitive information, and how would you adapt those strategies to safeguard digital data in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected a personal project or idea from being copied, and how did you ensure its security?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure its safety?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you protected sensitive information, and how would you adapt those strategies to safeguard digital data in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure its safety?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect sensitive data shared with friends online, ensuring only intended recipients can access it?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information from potential threats, and if so, what strategies did you use to safeguard it effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information from unintended access? How would you ensure the security of personal data in a digital project?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure its safety?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd secure your own digital footprint if you discovered a suspicious login attempt on your personal online accounts?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect a new social media account from common online threats, even if you've never managed one before?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you approach securing it in a digitally connected world?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you improve your approach in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect a friend's new online business from common cyber threats, like hacking or data breaches?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever had to protect sensitive information, and if so, how did you ensure its security?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected a personal project or idea from being copied, and how did you ensure its security?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect a personal project or idea from potential online threats or unauthorized access?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information, like a friend's secret, and how would you ensure its safety in a digital world?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to a digital world?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you'd protect a personal online project from common cyber threats, like hacking or data breaches?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and what steps did you take to ensure its safety?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure its safety?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how would you adapt those strategies to safeguard digital data in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure its safety?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through how you would protect sensitive personal data, like your own or a friend's, from potential online threats?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to protect sensitive information, and how did you ensure its safety?",
    "criterion": "Skills"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information or help someone else do so, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, such as a personal project or a friend's secret, and how did you ensure its security?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or noticed potential online risks, and how did you respond to safeguard yourself or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or identified potential online risks, and how did that experience shape your interest in safeguarding digital spaces?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever encountered a situation where personal or confidential information was at risk, and how did you respond to protect it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, such as a personal project or a friend's secret, and how did you ensure its safety?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did you ensure its safety?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever encountered a situation where personal data was mishandled, and how did you respond to protect privacy or security?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did that experience shape your interest in safeguarding digital assets?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, such as a personal project or a friend's secret, and how you ensured its safety?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected someone's sensitive information or created a secure system, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever had to protect sensitive information, such as personal data or confidential files, and how did you ensure its security?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected someone's sensitive information or created a secure system, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected someone's sensitive information or helped resolve a privacy concern, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever had to protect sensitive information, such as personal data or confidential projects, and how did you ensure its security?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever had to protect sensitive information, like a personal project or a friend's secret, and how did you ensure its safety?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or identified vulnerabilities in a personal or school project, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information or prevent unauthorized access, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or helped someone recover from a privacy breach, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or identified potential online risks in personal projects or group work?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information or prevent unauthorized access, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever had to protect sensitive information or prevent unauthorized access in a personal or group project - how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information or prevent unauthorized access, and how did you approach the situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or helped someone recover from a digital mistake, and how did that shape your interest in safeguarding technology?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected someone's sensitive information or helped resolve a privacy concern - how did you approach this situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information or help someone else do so, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or helped someone recover from a privacy breach, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or helped someone recover from a digital mistake, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or noticed vulnerabilities in everyday technology? How did you respond and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or raised awareness about online safety in a personal or school project, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever helped someone protect their digital information or resolved a privacy concern that sparked your interest in safeguarding technology?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or helped someone avoid a digital security risk? Tell me about that experience and what you learned?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or identified potential online risks in personal or group projects?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever encountered a situation where personal or sensitive data was at risk, and how did you respond to protect it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you protected sensitive information, and how did that shape your approach to securing data in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did that shape your approach to securing data?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or identified potential online risks in your personal projects or school activities, and how did you address them?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever had to protect sensitive information or noticed vulnerabilities in everyday technology? How did you respond and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or identified potential online risks, and how did that experience shape your interest in safeguarding digital spaces?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did that shape your interest in safeguarding digital assets?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever helped someone protect their online information or resolved a digital privacy issue - can you walk me through that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information or noticed a security flaw in a system you used?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever helped someone protect their online information or resolved a digital privacy issue, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information or prevent unauthorized access, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you protected sensitive information or helped someone else do so, and what motivated your actions?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or helped someone recover from a privacy breach, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever helped protect someone's sensitive information or prevented a privacy breach, and how did that experience shape your interest in safeguarding digital spaces?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or helped someone avoid a digital mistake? How did that experience shape your interest in safeguarding technology?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information or resolve a privacy concern, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information or prevent unauthorized access, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or helped someone recover from a privacy breach, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever had to protect sensitive information or navigate a privacy dilemma, and how did you approach that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did that shape your interest in safeguarding digital assets?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or identified potential online risks, and how did that experience shape your interest in safeguarding digital spaces?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information or prevent unauthorized access, and how did you approach the situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did you ensure its confidentiality?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did you ensure its security?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and what steps did you take to ensure its security?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did that shape your interest in securing digital assets?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or identified potential online risks, and how did that experience shape your interest in safeguarding digital spaces?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information or prevent unauthorized access, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected someone's sensitive information or helped resolve a privacy concern? How did that experience shape your approach to safeguarding data?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information or prevent unauthorized access, and how did you approach the situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information or help others stay safe online, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, such as a personal project or a friend's secret, and how you ensured its safety?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or raised awareness about online safety, and how did that experience shape your interests in safeguarding digital spaces?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information or prevent unauthorized access, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever had to protect sensitive information or prevent unauthorized access in a personal or team project - how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected someone's confidential information or helped resolve a privacy concern, and how did that experience impact your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and what steps did you take to ensure its security?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did you ensure its security?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever encountered a situation where personal data was at risk, and if so, how did you respond to protect it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did you ensure its safety?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or identified potential online risks, and how did that experience shape your interest in safeguarding digital spaces?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected sensitive information or noticed potential online risks, and how did you respond to those situations?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you protected sensitive information or helped someone else do so, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever had to protect sensitive information, such as personal data or confidential projects, and how did you ensure its security?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information or noticed a security flaw in a system you used?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected personal data or secured online accounts? How did you ensure their safety, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected personal data or prevented unauthorized access in a project or personal endeavor, and what motivated your approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever had to protect sensitive information or noticed vulnerabilities in everyday technology? How did you handle it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did you ensure its confidentiality?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever encountered a situation where personal data was at risk, and how did you respond to protect it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever protected someone's sensitive information or helped resolve a privacy concern - how did that experience shape your approach to securing data?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did you ensure it remained secure?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever helped protect someone's online information or resolved a digital privacy issue - how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever had to protect sensitive information, such as personal data or confidential files, and how did you ensure its security?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information or resolve a privacy concern, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you share an experience where you had to protect sensitive information, and how did you ensure its confidentiality?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Have you ever helped someone protect their online information or devices from potential threats, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, and how did that experience shape your interest in securing digital assets?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you had to protect sensitive information, such as a personal project or a friend's secret, and how did you ensure its security?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Security",
    "school": "NUS",
    "question": "Can you describe a time when you protected sensitive information, such as a personal project or friend's secret, and what motivated your approach?",
    "criterion": "Experiences"
  }
]