[
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an aspect of Japanese culture, history, or society that fascinates you and how exploring it further could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever encountered Japanese culture through media or travel, and how do you think exploring it deeper could shape your global perspective?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever encountered a moment where understanding Japanese culture helped you connect with others, and how might exploring this further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Imagining you're planning a cultural exchange trip to Japan, what aspects of its society, history, or traditions excite you most to explore and why?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever encountered Japanese culture through media, food, or travel, and how do you see it influencing your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how exploring a foreign culture's history, language, and traditions might shape your global perspective or career path?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever explored Japanese culture through media or travel, and how might these experiences shape your future academic or career pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share a personal experience or encounter that sparked your curiosity about Japanese culture, and how do you see this interest shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share a moment when you felt drawn to Japanese culture, and how exploring it deeper might shape your future goals or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you encountered aspects of Japanese culture that fascinate you, and how might exploring them further enrich your future pursuits or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how might exploring it further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share a personal experience or encounter that sparked your curiosity about Japanese culture, and how might exploring it further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever encountered Japanese culture through media, food, or travel, and how do you see this sparking your curiosity for deeper exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Japanese tradition, book, or film, and how do you think exploring such interests could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share a moment when Japanese culture sparked your curiosity, and how exploring it further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share a personal experience or encounter that sparked your curiosity about Japanese culture, and how might exploring it further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a particular aspect of Japanese culture, and how do you think exploring it deeper could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how exploring it further might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an aspect of Japanese culture, history, or society that fascinates you and how exploring it deeper could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Japanese tradition, historical event, or pop culture phenomenon that sparked your desire to explore its deeper cultural significance?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by Japanese culture, and how do you see exploring its language, history, or contemporary issues shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how might exploring it further enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how do you see this fascination influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Japanese tradition or historical event that made you want to learn more about its cultural significance?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share a personal experience or encounter that sparked your curiosity about Japanese culture, and how do you see this interest shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Imagine living in Tokyo for a year - what aspects of Japanese culture, language, or history excite you to immerse yourself in, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share an aspect of Japanese culture, history, or society that fascinates you, and how exploring it further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share how exploring Japanese language, culture, or history might shape your future aspirations or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you encountered any aspects of Japanese culture that fascinate you, and how do you see exploring them further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "What aspects of Japanese culture, history, or society excite you the most, and how do you see exploring them shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever explored Japanese culture beyond popular media, and how might deeper study of it enrich your global perspective or career path?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how might exploring it further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how do you see this fascination shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Japanese cultural practice or historical event that sparked your curiosity to learn more about its origins?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Japanese tradition, film, or book, and how might exploring such interests shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how exploring a foreign culture, like Japan's, might shape your global perspective or influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Japanese tradition, event, or cultural phenomenon that sparked your curiosity to learn more about its origins and significance?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share an aspect of Japanese culture, history, or society that fascinates you and how exploring it deeper might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how might exploring this fascination shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how do you see this fascination shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you encountered Japanese culture through media, food, or travel, and how might exploring it further enrich your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how exploring it further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how exploring a foreign culture, like Japan's, might shape your global perspective or influence your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share an experience or encounter that sparked your curiosity about Japanese culture, and how might exploring it further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an aspect of Japanese culture, history, or society that fascinates you and how exploring it could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you encountered Japanese culture through media, food, or travel, and how might exploring it further enrich your personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share a personal experience or encounter that sparked your curiosity about Japanese culture, and how do you see this interest influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share an aspect of Japanese culture, history, or society that fascinates you and how exploring it deeper might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you encountered any aspects of Japanese culture, history, or society that fascinate you, and how might exploring these further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Imagining your life in 10 years, how do you see understanding Japanese culture and language influencing your personal growth or career path?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share a personal experience or encounter that sparked your curiosity about Japanese culture, and how do you see this interest shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "What aspects of Japanese culture, history, or society excite you the most, and how do you see exploring these interests shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever encountered Japanese culture through media, food, or travel, and how might exploring it further shape your global perspectives or career?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how do you see this fascination shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Imagining yourself immersed in a foreign culture, what draws you to explore the language, history, or contemporary society of Japan in your academic journey?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share how exploring a foreign culture, like Japan's, might shape your global perspective or influence your career path in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share a moment when you discovered something intriguing about Japanese culture, and how might exploring it further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Japanese tradition, event, or cultural practice that sparked your curiosity to learn more about its origins and significance?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Japanese cultural practice or historical event that you'd love to explore in-depth, and how might that enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how might exploring it further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Imagining your future self working in a field related to Japan, what aspects of its culture, language, or history excite you the most about this potential path?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share an experience or encounter that sparked your curiosity about Japanese culture, and how might exploring it further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you explored how studying a foreign culture and language could shape your global perspective or career opportunities?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an aspect of Japanese culture, history, or society that fascinates you and how exploring it further could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever encountered Japanese culture through media, food, or travel, and how do you see exploring it further shaping your global perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japan, and how exploring its culture or language might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how do you see this interest influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share a personal experience or encounter that sparked your curiosity about Japanese culture, and how do you see this interest shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Imagining your future self, how do you see learning about Japanese culture, language, or history enriching your personal or professional path?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an aspect of Japanese culture, history, or society that fascinates you, and how exploring it further could enrich your personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share a personal experience or encounter that sparked your curiosity about Japanese culture, and how do you see this interest influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Japanese tradition, character, or historical event that sparked your curiosity to learn more about its cultural?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share how exploring the language, culture, or history of a country like Japan might shape your global perspective or future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you explored how studying a foreign culture's history, language, or society could shape your global perspective or career path?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an aspect of Japanese culture, history, or society that fascinates you, and how exploring it further could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how do you see this interest shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Japanese tradition, historical event, or contemporary issue, and how might exploring these deepen your understanding of global cultures?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Japanese tradition or cultural phenomenon that you'd love to explore in-depth, and how might that relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever encountered a fascinating aspect of Japanese culture that made you eager to explore its historical roots or modern-day influences?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Imagining your future self, how do you see exploring Japanese culture, language, or history enriching your personal or professional path?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how might exploring it further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Japanese tradition, trend, or historical event that sparked your curiosity to learn more about its cultural?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share how exploring the language, culture, or history of Japan might shape your future goals or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share an experience or encounter that sparked your curiosity about Japanese culture, and how do you see this interest shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "What aspects of Japanese culture, history, or society intrigue you the most, and how do you see exploring these interests shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an aspect of Japanese culture, history, or society that fascinates you, and how exploring it further could enrich your academic or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by a Japanese tradition, book, or film that made you want to explore its cultural?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Imagine working in a field where you bridge Japanese and global cultures; what excites you about being that connector, and how do you see yourself growing in this role?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever encountered something from Japanese culture that sparked your curiosity, and how do you see exploring this further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you explored how understanding Japanese language and culture could enrich your global perspective or career opportunities in Asia?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Japanese culture, and how do you see this interest influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share an experience or encounter that sparked your curiosity about Japanese culture, and how might exploring it further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Imagine living in Japan for a year - what aspects of its culture, language, or history excite you to immerse in and learn more about?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Imagining your future self working in a global company, how do you think understanding Japanese culture and language could enhance your professional relationships and opportunities?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever encountered Japanese culture through media, food, or travel, and how might exploring this further shape your global perspectives or career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how learning a new language or culture has challenged your perspectives, and how you think this growth might shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning a new language or culture has challenged your perspectives, and how you adapted to this growth?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture different from yours challenged your assumptions, and how did that shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how exploring a foreign culture, like Japan's, might shape your worldview and influence your future career or personal aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a foreign culture, like through media or travel, has influenced your personal growth or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a culture different from yours sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you overcame a challenge in learning a new language or culture, and how it sparked your curiosity for further exploration?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning a new language or culture has challenged your perspectives, and how you adapted to these differences?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a different culture fascinated you, and how you think exploring such interests could shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how exploring a foreign culture, like Japan's, could shape your global perspective or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a cultural difference or language barrier, and how did it shape your curiosity about East Asian societies?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when exploring a foreign culture, like through media or travel, sparked your curiosity, and how did you deepen that interest?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a different culture challenged your assumptions, and how did you adapt your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture different from yours sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a time when exploring a foreign culture, like through media or travel, challenged your assumptions and how you adapted?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share how exploring a foreign language and culture, like Japanese, might shape your global perspective or career path?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a foreign culture helped you navigate a challenging social situation, and how did you adapt?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning a new language or culture has challenged your perspectives, and how you adapted to this growth?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a foreign culture, like Japan's, has influenced your perspective or decisions in your daily life?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, like Japan's, challenged your assumptions and how you adapted your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share how exploring a foreign culture, like Japan's, might shape your global perspective and influence your future career choices?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, like Japan's, challenged your assumptions and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how exploring a foreign language and culture, like Japanese, might shape your global perspective or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture challenged your assumptions, and how did that shape your worldview?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a foreign culture, like through media or travel, has inspired personal growth or shaped your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture challenged your assumptions, and how did that shape your interest in exploring East Asian societies?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a time when you explored a different culture, and how did that experience shape your curiosity about languages or global communities?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a foreign culture, like through media or travel, has influenced your personal growth or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a cultural difference, and how do you think understanding diverse cultures could shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you had to navigate a cultural difference, and how did that shape your interest in exploring languages or societies further?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, like through media or travel, challenged your assumptions and sparked personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture helped you navigate a challenging situation, and how did that shape your approach to understanding others?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a foreign culture, and how do you think understanding Japan's culture could enrich your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a foreign culture fascinated you, and how did that experience shape your curiosity about languages or global interactions?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how learning a new language or culture has challenged your perspectives, and how you think this adaptability could benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a different culture challenged your assumptions, and how you adapted your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a foreign culture, like through media or travel, challenged your assumptions and how did you adapt?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a cultural difference, and how do you think understanding another culture could enrich your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture challenged your assumptions, and how you adapted your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "How do you think studying a foreign culture like Japan's can influence your perspective on global issues or your future career path?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture challenged your assumptions, and how did that shape your interests or goals?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how exploring a foreign culture, like Japan's, might shape your worldview or career aspirations in our interconnected world?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a foreign culture, like Japan's, challenged your assumptions and how you adapted your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a cultural difference, and how do you think that skill will serve you in bridging connections across diverse societies?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a foreign culture, like Japan's, challenged your assumptions, and how did that shape your worldview?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how learning a new language, like Japanese, might shape your worldview or career aspirations in a multicultural society?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a foreign culture, like through language or media, has broadened your perspectives or sparked personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a different culture fascinated you, and how you think this curiosity could shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture challenged your assumptions, and how did that shape your perspective on global connections?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture helped you adapt or grow, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture challenged your assumptions, and how did that shape your worldview?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a foreign culture fascinated you, and how you think exploring such interests could shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture challenged your assumptions, and how did that shape your interests or goals?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a foreign culture, like Japan's, has influenced your perspective or decisions, and how might this continue to shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture helped you navigate a challenging social situation, and how did you apply those skills?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a foreign culture, like Japan's, has sparked your curiosity or challenged your perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture different from your own sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a time when exploring a foreign culture, like through media or travel, challenged your assumptions and how you adapted?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how exploring a foreign culture, like Japan's, might shape your global perspective or career aspirations in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you had to navigate a cultural difference or language barrier, and how did you adapt?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a different culture challenged your assumptions, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, like Japanese traditions or history, challenged your perspectives or sparked new interests in you?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "How do you think learning a foreign language like Japanese could shape your worldview or career opportunities in a globalized society?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a different culture significantly impacted your perspective, and how might such experiences shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share how exploring a foreign culture, like Japan's, might shape your global perspective or career aspirations in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a culture different from yours fascinated you, and how did that spark influence your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when you overcame a challenge in learning a new language or culture, and how did it shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share an experience where you explored a different culture, and how do you think understanding diverse perspectives will shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share how exploring a foreign culture's history, literature, or society might influence your personal growth or future career choices?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a foreign culture, and how do you think that curiosity will serve you in bridging cultural gaps in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, like Japan's, challenged your assumptions or broadened your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you overcame a cultural misunderstanding, and how do you think that skill will benefit your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a cultural difference, and how do you think understanding diverse cultures will shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning a new language or culture has challenged your perspectives, and how you adapted to these changes?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "How do you think learning a language like Japanese could shape your worldview or open unexpected career doors in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, like Japan's, challenged your assumptions or broadened your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, like Japan's, helped you navigate a challenging social situation or sparked a new interest?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, like Japan's, helped you navigate a challenging social or academic situation?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a foreign culture fascinated you, and how do you think exploring such interests can shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, like Japan's, helped you navigate a challenging social or academic situation?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, like Japanese, helped you adapt or grow, and how might this skill benefit your future?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a different culture surprised you, and how you think that experience could shape your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a foreign culture, like Japan's, has broadened your perspective or sparked new interests in you?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Could you share how exploring a foreign language and culture might shape your global perspective or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a foreign culture, and how do you think that curiosity could enrich your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "How do you think studying a foreign language and culture, like Japanese, can shape your global perspective and career opportunities in an interconnected world?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how exploring a foreign culture, like Japan's, might shape your global perspective or career aspirations in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you had to adapt to a new cultural?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you had to adapt to a culturally unfamiliar situation, and how did that shape your communication approach?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture challenged your assumptions, and how did that shape your perspective on communication or relationships?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture different from yours sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a foreign culture, like Japan's, has influenced your perspective or decisions in your daily life?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture challenged your assumptions, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when exploring a foreign culture, like through media or travel, sparked your curiosity, and how you pursued that interest further?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning a new language or culture has challenged your perspectives, and how you adapted to this growth?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture challenged your assumptions, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how exploring a foreign culture, like Japan's, might shape your global perspective or career aspirations in a rapidly changing world?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you describe a moment when learning about a different culture surprised you, and how you adapted your own perspectives as a result?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how exploring a foreign language and culture, like Japanese, might shape your global perspectives or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share how learning a language like Japanese might shape your worldview or career goals in a multicultural society?",
    "criterion": "Skills"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did you deepen that interest?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with Japanese culture, language, or history, and how it sparked your curiosity about its broader implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did you delve deeper into it?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where engaging with Japanese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see this interest shaping your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged with Japanese culture, language, or history in a way that sparked your curiosity about its broader societal implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged in activities or explored topics related to Japanese culture, language, or society that sparked your curiosity about its deeper study?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see this interest influencing your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with Japanese culture, language, or history, and how it sparked your interest in further exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged with Japanese culture, language, or history in ways that sparked your curiosity, and how might these experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged in any activities, such as language learning or cultural events, that sparked your curiosity about Japanese society or its global influence?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see this interest influencing your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see this interest shaping your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged in any activities, such as language learning, cultural events, or travel, that sparked your curiosity about Japanese society or language?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with Japanese culture, language, or history, and how it sparked your curiosity about its broader societal implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a foreign culture, and how did it shape your curiosity about societies different from your own?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with Japanese culture, language, or history, and how it sparked your curiosity for deeper exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged with Japanese culture, language, or history in a way that sparked curiosity about its broader societal or global implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see this interest shaping your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity and shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see exploring it further shaping your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture, perhaps through media, travel, or hobbies, sparked your curiosity about its societal or historical aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged with Japanese culture, language, or history in a way that sparked your curiosity about its global influence or your own future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you explored Japanese culture, language, or history through personal projects, travel, or media, and how might these experiences shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, like through media, travel, or language, sparked your curiosity about its societal or historical aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you explored Japanese culture, language, or history in your free time, and how might these interests shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged in any activities, such as language learning, cultural events, or travel, that sparked your curiosity about Japanese society or traditions?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical topic sparked your curiosity, and how did you pursue it further?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged in any activities or hobbies that sparked your curiosity about Japanese culture, and how might exploring this interest shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture, language, or historical perspective sparked your curiosity and influenced your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a Japanese cultural practice, language, or historical event that sparked your curiosity about its global influence?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, perhaps through media, travel, or language, sparked your curiosity about its societal or historical aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged in activities or self-driven projects that sparked your curiosity about Japanese culture, language, or history, and how did they impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged with Japanese culture, language, or history in meaningful ways that spark your curiosity for deeper exploration and future application?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see this interest shaping your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture, perhaps through media, travel, or language, sparked your curiosity about its societal or historical aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see this interest influencing your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, like through media, travel, or language, sparked your curiosity about its societal or historical aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged in any activities, such as language learning, cultural events, or travel, that sparked your curiosity about Japan's society, history, or contemporary issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged with Japanese culture, language, or history in a way that sparked curiosity about its broader social or global implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture different from yours sparked your curiosity, and how did that shape your interests or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you explored Japanese culture, language, or history in ways that sparked your curiosity, and how might these experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged with Japanese culture, language, or media in ways that sparked curiosity about its societal, historical, or contemporary influences on your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did you delve deeper into it?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where engaging with Japanese culture, language, or history sparked your curiosity, and how might this interest influence your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a culture vastly different from your own, and how did that shape your curiosity or skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged in any activities or experiences that sparked your curiosity about Japanese culture, language, or society, and how did they impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where engaging with Japanese culture, language, or history sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture, perhaps through media, travel, or language, sparked your curiosity and shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did you delve deeper into it?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged with Japanese culture, language, or history in meaningful ways that sparked your curiosity for deeper exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or history sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, like through media, travel, or language, sparked your curiosity and shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see this interest influencing your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how did it impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with Japanese culture, language, or history, and how it sparked your curiosity for deeper exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture, perhaps through media, travel, or hobbies, sparked your curiosity about its people, history, or customs?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged with Japanese culture, language, or history in ways that sparked curiosity about its broader societal or global implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged in any activities, such as language learning, cultural events, or media consumption, that sparked your curiosity about Japanese society or history?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see this interest shaping your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever encountered Japanese culture through travel, media, or language learning - how did these experiences spark your curiosity about its societal or historical aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you ever engaged with Japanese culture, language, or history in a way that sparked your curiosity about its broader social or global implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Japanese culture, and how do you see exploring it further shaping your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, perhaps through media or travel, sparked your curiosity and how it might shape your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with Japanese culture, language, or history that sparked your curiosity about its broader societal implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where engaging with Japanese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a foreign culture, and how it sparked your curiosity about its societal values or traditions?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged with Japanese culture, language, or history in ways that sparked your curiosity, and how might this continue to inspire you?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a different culture, and how it sparked your curiosity to learn more about its language, history, or society?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a foreign culture, and how do you think it shaped your curiosity for deeper cross-cultural understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you explored Japanese culture, language, or history in ways that sparked your curiosity, and how might these experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or history sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged with Japanese culture, language, or history in a way that sparked curiosity about its broader societal or global implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, like through media, travel, or language, sparked your curiosity about its societal or historical aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture, perhaps through media, travel, or hobbies, sparked your curiosity about its people or history?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged in activities or projects that sparked your curiosity about Japanese culture, language, or history, and how did these experiences shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you explored Japanese culture, language, or history through hobbies, travel, or projects that sparked your curiosity about its societal or global impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture, language, or historical perspective sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with Japanese culture, language, or history, and how it sparked your curiosity for deeper exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged with Japanese culture, language, or history in a way that sparked your curiosity about its broader social or global implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you engaged with Japanese culture, language, or media in ways that sparked your curiosity about its societal or historical contexts?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a foreign culture, and how do you think such exploration could shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or history sparked your curiosity, and how might this continue to inspire your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a foreign culture, and how do you think it shaped your perspective or skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Have you explored Japanese culture, language, or history in a way that sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a culture vastly different from your own, and how it sparked your curiosity for deeper understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture, perhaps through media, travel, or hobbies, sparked your curiosity about its history or societal norms?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where engaging with Japanese culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Japanese Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a foreign culture, language, or historical event sparked your curiosity and shaped your goals?",
    "criterion": "Experiences"
  }
]