[
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an unfair situation where you wished you had the power to advocate for change, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you advocated for someone or something, and how did that moment spark your curiosity about justice and its impact?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice that sparked your desire to create change, and how do you think studying law could empower you to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered situations where fairness or justice seemed compromised, and how did those experiences shape your desire to learn more about upholding rights?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share a moment when you witnessed an injustice, and how would you have addressed it if given the opportunity?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered situations where fairness or justice seemed unclear, and how did those moments shape your desire to understand legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or debated a controversial issue that sparked your desire to understand and shape the rules governing society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - what sparked your curiosity to learn how laws shape societal outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and how do you think a deeper understanding of legal systems could empower you to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered situations where fairness or justice was compromised, and how do you think studying law could empower you to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice and wished you could advocate for change - what drives your desire to be that voice?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered situations where fairness or justice was compromised, and how do you think studying law could empower you to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or debated a controversial issue that sparked your desire to understand and shape the rules governing society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, how did it motivate you to learn more about systems that promote fairness?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced an injustice that sparked your desire to understand and shape the rules governing society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you advocated for something you believed in, and how did that shape your desire to understand and work with legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand how laws can drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to want to address or resolve it?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced an injustice that sparked your desire to understand how laws can drive positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered situations where fairness was compromised, and how do you think studying law could empower you to address such issues in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Reflecting on your experiences, can you share a moment when you felt strongly about fairness or justice, and how it sparked your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - what sparked your curiosity about how laws shape society's responses to such situations?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered a situation where you felt a rule or policy was unfair? How did that experience shape your curiosity about justice systems?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand how laws can drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did that influence your desire to study and apply legal principles?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered a situation where you felt a rule was unfair? How would you go about advocating for change, and what drives your passion for justice?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced an injustice that sparked your desire to understand how laws protect individuals and shape societal norms?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you advocated for something you believed in, and how did that shape your desire to pursue a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you stood up for someone or something, and how did that moment shape your desire to pursue a career in justice?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its legal dimensions could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - what sparked your curiosity to learn how laws can drive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand how laws can drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about justice, rights, or governance, and how you see yourself contributing to these areas?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an unfair situation and wished you could intervene? What draws you to using legal frameworks to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to want to address or resolve it?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Reflecting on your future, how do you see yourself contributing to creating a fairer society, and what motivates this aspiration?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and how do you think studying law could empower you to address such issues in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a moment when you witnessed an injustice, and how would you have advocated for change in that situation?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a moment when you witnessed an injustice, and how would you have advocated for change if given the opportunity?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or debated a controversial issue that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered situations where fairness was compromised, and how do you think studying law could empower you to address such issues in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a moment when you witnessed an injustice, and how would you have advocated for change in that situation?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced an injustice that sparked your desire to understand how laws can drive positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a moment when you felt a strong sense of justice or fairness, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding the legal framework behind it could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice that sparked your desire to create change, and how do you think studying law could empower you to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and how did it spark your desire to understand the systems that govern and protect rights?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did that spark your curiosity about systems that uphold rights?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Reflecting on current events, what social justice issue sparks your curiosity, and how do you envision yourself contributing to its resolution through a legal career?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to want to address or resolve it?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Reflecting on current events, can you share an instance where you felt a law or policy should be created or changed, and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you stood up for someone or something, and how did that moment shape your desire to pursue a career in justice?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered situations where fairness was compromised, and how did that spark your curiosity about systems that promote justice?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a solution - what sparked your curiosity in resolving disputes?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did that spark your curiosity about creating a more just society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a moment when you witnessed unfairness and how you think a deeper understanding of legal systems could have led to a fairer outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did that spark your curiosity about creating positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand how laws could be used to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or debated a controversial topic that sparked your desire to understand and shape the rules governing society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you stood up for someone or something, and how did that moment shape your desire to pursue a career in justice?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding the legal framework around it could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an unfair situation where you wished you had the skills to advocate for change, and how does that relate to your career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered a situation where fairness was compromised, and how did that experience shape your desire to understand and uphold justice?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to create positive change through legal frameworks?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and how do you think a deeper understanding of legal principles could empower you to create positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you advocated for a cause or person, and how did that shape your desire to understand and work with societal rules?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced an injustice that sparked your desire to understand how laws protect individuals and shape societal norms?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and how did it spark your desire to understand the systems that promote justice?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, how did it spark your curiosity about creating positive change through legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and how did that experience shape your desire to understand and address societal rules and norms?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did those experiences shape your desire to advocate for change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand how laws can drive positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you advocated for a cause or persuaded someone to see things from your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you advocated for something you believed in, and how did that shape your desire to understand and work with legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Reflecting on current social issues, what aspects of advocating for justice or influencing societal change genuinely excite you about pursuing a legal education?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a moment when you witnessed injustice, and how would you have addressed it if given the opportunity?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an unfair situation where you wished you had the power to advocate for change, and how does that relate to your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, how did it motivate you to consider a career in creating positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered situations where fairness or justice was compromised, and how do you think studying law could empower you to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its legal dimensions could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand how laws could be used to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its legal dimensions could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - what sparked your curiosity to learn how laws shape societal outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to learn how laws can drive positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to want to address or resolve it?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and how did it spark your curiosity about creating positive change through legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, how did you think it should have been resolved?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share a moment when you observed injustice, and how would you address it if given the power to create change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to learn how laws can drive positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution - what did you enjoy about the process?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you stood up for something you believed in, and how did that shape your desire to pursue a career in justice?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - what sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its legal dimensions could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an unfair situation and wished to intervene? How do you think understanding the legal system could empower you to create positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did those experiences shape your desire to understand and uphold the law?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you witnessed an injustice, and how would you advocate for change if given the opportunity?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a complex rule or conflict, and how it sparked your curiosity about the systems that govern our society?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and how did that experience shape your desire to understand and address such issues through a career in law?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice or unfair situation, and how do you think a deeper understanding of legal systems could empower you to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed an injustice and wished you could help create a fairer outcome, and how does that relate to your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your perspective was effectively communicated?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through how you would approach researching and arguing a position on a controversial social issue you're passionate about?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuade someone to adopt your point of view, and how did you approach the conversation?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuade someone to see things from your perspective, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to persuade someone to see things from your perspective, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised? How would you advocate for a resolution, and what skills do you think are essential to do so effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your perspective was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to argue a point persuasively, even when others disagreed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to convince others?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuade someone to adopt your viewpoint, and how did you approach the conversation?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuade someone to see things from your perspective, and how did you approach the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuade someone to adopt your viewpoint, and how did you approach the conversation?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuade someone to see things from your perspective, and how did you approach the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you approach understanding the opposing viewpoint?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you ensure your message resonated with your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to persuade someone to see things from your perspective, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuade someone to see things from your perspective, and how did you approach the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to persuasively argue a point, even when faced with strong opposing views?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you approach building your case effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to argue a point convincingly, and how did you ensure your perspective was well-received?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuade someone to adopt your viewpoint, and how did you approach the conversation?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuade someone to adopt your viewpoint, and how did you approach the negotiation?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your perspective was effectively communicated?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuade someone to adopt your point of view, and how did you approach the conversation?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuade someone to see things from your perspective, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised? How would you address the issue if given the opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever navigated a complex disagreement? How did you approach resolving it, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you ensure your message resonated with your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered a situation where you had to argue for a rule change? How did you approach building your case?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuade someone to see things from your perspective, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you approach building your case effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuade someone to adopt your viewpoint, and how did you approach the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you encountered a situation where fairness was compromised? How would you construct a logical argument to address the issue and advocate for a resolution?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuasively argue a point, and how did you adapt your approach to convince your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuasively argue a point, and how did you tailor your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuade someone to see things from your perspective, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to persuasively argue a point, and how did you ensure your perspective was effectively communicated?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuade someone to adopt your viewpoint, and how did you approach the situation effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for yourself or others, and how did that experience shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever advocated for someone or something, and how did that experience shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to advocate for someone or something, and how did that shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to advocate for yourself or others, and how did that shape your interest in pursuing a legal career?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you engaged in debates, mock trials, or discussions on social justice issues that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a complex rule or disagreement, and how did that experience shape your approach to resolving conflicts?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a complex rule or conflict, and how did that experience shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a complex rule or disagreement, and how did that experience shape your approach to resolving conflicts?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for yourself or others, and how did that experience shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to argue a point or negotiate a resolution, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to persuade someone to see things from your perspective, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuade someone to see things from your perspective, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and how did that experience shape your communication style?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was a concern, and how did that influence your desire to understand legal systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did you respond or wish you could have intervened?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever advocated for a cause or negotiated a resolution in a challenging situation, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for yourself or others, and how did that experience shape your interest in pursuing a legal career?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for yourself or others, and how did this experience shape your interest in pursuing a legal career?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your interest in pursuing a legal career?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution? What did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever navigated a situation where fairness was questioned, and how did you advocate for a resolution that aligned with your values?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you advocated for a cause or resolved a conflict, and how did this shape your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and how did that shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever advocated for a cause or resolved a conflict that deepened your interest in understanding the legal frameworks that govern society?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did you respond or wish you could have intervened?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for yourself or others, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a situation where you had to navigate a complex rule or regulation, and how did that experience shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for yourself or others, and how did that experience shape your interest in pursuing a legal career?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you engaged in debates, mock trials, or discussions on social justice issues that sparked your curiosity about shaping or upholding societal rules?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was a concern - how did you navigate it and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you advocated for a cause or persuaded others to see things from a different perspective, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your perspective on fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for yourself or others, and how did that experience shape your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did you respond or wish you could have intervened?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuade someone or argue a point, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and how did that shape your communication approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your understanding of fairness?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you engaged in debates, mock trials, or discussions on societal rules that sparked your curiosity about how laws shape our daily lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was questioned, and how did you think it should be addressed?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to persuade someone or argue a point, and how did that shape your communication style?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution - what did you learn from that encounter?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or been part of a situation where fairness was questioned, and how did you navigate or reflect on that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did you respond or wish you could have intervened?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your interest in justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you engaged in debates, mock trials, or discussions on social justice issues that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for yourself or others, and how did that experience shape your interest in pursuing a career in justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you engaged in debates, mock trials, or discussions on social justice, and how did these experiences shape your perspective on fairness and advocacy?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your communication style?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a complex rule or conflict, and how did that experience shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to advocate for a cause or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to advocate for a rule change or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever navigated a situation where fairness was questioned, and how did you advocate for a resolution that aligned with your values?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for yourself or others, and how did that experience shape your understanding of fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you advocated for a cause, resolved a conflict, or navigated a complex rule system that sparked your interest in legal studies?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a complex rule or disagreement, and how did that experience shape your approach to resolving conflicts?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a complex rule or regulation, and how did that shape your approach to resolving conflicts or challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did you respond or wish to address it in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to argue a point or negotiate a resolution, and how did that experience shape your interest in justice or governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a complex rule or policy that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did that influence your desire to pursue a career in creating justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did you respond or wish you could have intervened?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to persuade someone or argue a point, and how did that shape your communication style?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you engaged in debates, mock trials, or discussions on social justice issues that sparked your curiosity about how laws shape societies?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and what did you learn from that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to advocate for yourself or others, and how did that shape your interest in pursuing a career in justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you advocated for someone or something, and how did that shape your understanding of fairness or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did you respond or wish you could have intervened?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did you respond or wish you could have intervened?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did you respond or wish you could have intervened?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Have you engaged in debates, negotiated conflicts, or advocated for a cause that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to persuade someone or argue a point, and how did that experience shape your communication style?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you share an experience where you had to argue a point or negotiate a resolution, and how did that shape your communication approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Law",
    "school": "NUS",
    "question": "Can you describe a time when you had to advocate for someone or something, and how did that experience shape your communication skills?",
    "criterion": "Experiences"
  }
]