[
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did those experiences shape your desire to understand and address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue that sparked your curiosity about how laws shape society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished to understand how laws could address it, shaping your desire to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed a situation where fairness was compromised, and how do you think understanding laws could empower you to make a difference?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed a situation where fairness was compromised, and how do you think studying law could empower you to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Reflecting on current social issues, which legal debates or landmark cases have sparked your curiosity, and how do you see yourself contributing to these discussions?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you stood up for a rule or principle, and how did that shape your curiosity about the legal system's role in society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you could advocate for change - what sparked your desire to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand the laws that govern society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to consider the role of laws in driving positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - what sparked your curiosity to explore the systems that govern fairness in society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed a situation where fairness was compromised, and how do you think studying the rules governing society could empower you to make a difference?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you observed an injustice, and how would you have addressed it if you had the power to create change?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did those experiences shape your desire to understand and address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice seemed unclear, and how did that spark your curiosity about the systems that govern our rights?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Reflecting on your future, how do you envision engaging with laws or justice systems to drive positive change in your community or career?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to consider the role of laws in creating a more just society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue that sparked your curiosity about the systems in place to address such matters?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you had the power to advocate for change, and how might studying law equip you to do so?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you had the power to advocate for change, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to consider learning how to address such issues systematically?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could help create a fairer outcome? What motivates you to explore the systems that govern societal fairness?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you could advocate for change, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or regulation, and how did that spark your curiosity about the systems that govern our society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you witnessed an injustice, and how would studying law empower you to address such issues in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed a situation where fairness was compromised, and how did that experience shape your desire to understand and uphold justice?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to consider the role of laws in creating positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed a situation where fairness was compromised, and how did that inspire you to learn more about systems that uphold justice?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed a situation where fairness was compromised, and what motivated you to consider a role in upholding justice or creating societal change?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished to understand how laws could address it, shaping your desire to study law in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice that sparked your desire to understand how laws protect individuals, and how would studying law help you make a difference?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you could advocate for change, and how do you think understanding laws could empower you?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue that sparked your curiosity about how laws shape society or protect individuals?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you observed an injustice, and how you think laws or legal systems could have addressed it effectively?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation and wished you could navigate the rules to create a fairer outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a moment when you observed an injustice, and how you think laws or legal systems could have addressed it differently?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you had the power to advocate for change, and what sparked that desire in you?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did that influence your desire to understand and address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation and wished you could advocate for change - what draws you to using law as a tool for impact?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you had the knowledge to advocate for change, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did those experiences shape your desire to understand and navigate legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed a situation where fairness was compromised, and how did that spark your curiosity about the systems that govern justice?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished to understand how laws could address it, shaping your desire to drive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you witnessed an injustice, and how would you advocate for change if given the opportunity?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could help create a fairer outcome? What motivates your desire to understand and shape the rules that govern society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand how laws can drive positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation and wished you could navigate the rules to create a fairer outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see understanding laws and justice systems impacting your career choices or personal values?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue that sparked your curiosity about how laws shape society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you had to navigate a rule or policy that seemed unfair, and how did that shape your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you had the power to advocate for change, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and how did that experience shape your desire to understand laws and their impact on society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice was a concern, and how do you think studying law could empower you to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your curiosity about how laws could be improved to address it?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed a situation where fairness was compromised, and how did that inspire you to learn more about systems that promote justice?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice that sparked your desire to understand how laws protect individuals, and how would you contribute to this process?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished to understand how laws could address it, shaping your desire to drive change?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Reflecting on your future, how do you envision engaging with laws or societal rules to drive positive change or support your community?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - what sparked your curiosity about the systems that govern societal behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice that sparked your desire to understand how laws could be used to drive positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed a situation where fairness was disputed, and how did that experience shape your curiosity about the systems that govern justice?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to consider learning more about systems that promote fairness?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, how did it spark your curiosity about the role of laws in promoting societal balance?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice that sparked your desire to understand the systems in place to address it, and how do you see yourself contributing to this effort?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Reflecting on current events, how do you think understanding the law influences your ability to engage with societal issues that matter to you?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Reflecting on your future aspirations, how do you see understanding laws and legal principles shaping your career or personal impact in society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation and wished to intervene? How do you think studying the law could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation and wished you could intervene? What motivates you to understand the systems that govern such outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation and wished you could address it through a structured, rule-based system - what motivated your reaction?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you witnessed an injustice, and how you think laws or legal systems could have been improved to address it?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how laws shape society, and how you see yourself engaging with these principles in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you observed an injustice, and how you think laws or legal systems could have been improved to address it?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or conflict, and how did that spark your curiosity about the systems that govern our society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you could intervene with knowledge of the law, and why did that moment resonate with you?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to consider the role of laws in creating positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to consider learning more about systems that promote fairness?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could help fix it? What motivates you to explore the systems that shape fairness in society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished to address it through a systematic approach - what motivates your curiosity about the legal framework?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you could intervene - what motivated your reaction, and how do you think understanding laws could empower you?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to consider how laws could be used to address it?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation, and if so, what motivated you to want to understand or address the legal aspects surrounding it?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed a situation where fairness was compromised, and what motivated you to consider a career that upholds justice and rights?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you observed an injustice, and how would you navigate the complexities to address it in a fair manner?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand how laws can drive positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed a situation where fairness was disputed, and what motivated you to consider the role of laws in resolving such conflicts?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could navigate the system to make a difference, and how does that drive your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation and wished you could intervene? What draws you to using laws and systems to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how laws shape society, and how you see yourself contributing to this process?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you could intervene with knowledge of the law, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you observed an injustice, and how you think laws or legal systems could be improved to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair situation where you wished you had the knowledge to advocate for change, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed a situation where fairness was debated, and how did that spark your curiosity about the systems that govern societal justice?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or unfair situation that sparked your desire to understand how laws can drive positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice that sparked your desire to understand the systems in place to address it, and how do you see yourself contributing to this process?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - what sparked your curiosity about the systems that govern societal behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice was a concern, and how do you think studying law could empower you to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could address it through a structured, societal framework?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see understanding laws and justice systems impacting your career choices or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice and wished you could address it through a structured, ethical framework - how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed an injustice or debated a controversial issue - what sparked your curiosity about how laws shape society?",
    "criterion": "Interests"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to resolve a conflict or disagreement? How did you approach the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to resolve a disagreement or misunderstanding? How did you approach the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or guideline? How did you ensure you understood and applied it correctly?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to interpret and apply rules or guidelines, and how did that experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point or negotiate a resolution? How did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to navigate a complex rule or regulation - how did you ensure compliance and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you had to navigate a complex rule or policy, and how did you ensure you understood its implications?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or guideline, and how did you ensure compliance while achieving your goal?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point convincingly, and how did you ensure your perspective was well-reasoned and respectful of opposing views?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to interpret and apply rules or guidelines, and how did that experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you had to navigate a complex rule or policy, and how did that experience shape your approach to fairness and justice?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was clear and impactful?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze a complex issue from multiple perspectives, and how did you develop a well-reasoned stance?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to interpret and apply rules or guidelines to resolve a conflict or dilemma?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to see things from your perspective, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to see things from your perspective, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or regulation, and how did you ensure compliance while achieving your goal?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for a rule change, and how did you approach persuading others to support your position?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to resolve a complex disagreement or dispute, and what skills did you use to navigate it?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or guideline, and how did you ensure you understood and followed it correctly?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to adopt your viewpoint, and how did you approach the conversation?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you had to navigate a complex rule or regulation? How did you ensure you understood and applied it correctly?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for a rule or policy change, and how did you approach the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your reasoning was sound?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or guideline? How did you ensure compliance while achieving your goal?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point of view or negotiate a resolution, and what skills did you use to persuade others?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to see things from your perspective, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point or negotiate a resolution, and what skills did you use to achieve your goal?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a complex rule or regulation that impacted your decision-making, and how did you adapt?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for a rule or policy change, and how you approached persuading others to support your position?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a complex rule or policy, and how did that experience shape your approach to understanding and applying guidelines?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure you understood its implications?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or regulation, and how did you ensure compliance while achieving your goal?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your message was clear and impactful?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you had to advocate for a rule change or fairness in a school or community setting?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or guideline, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to navigate a complex rule or policy that impacted a group or community?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a complex rule or policy - how did you ensure fairness and clarity in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you had to navigate a complex rule or regulation, and how did you ensure you were interpreting it correctly?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to interpret and apply rules or guidelines, and how did that experience shape your decision-making skills?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you had to navigate a complex rule or policy, and how did you ensure you understood its implications?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your reasoning was sound and respectful?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you adapt your approach to your audience?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point or negotiate a resolution, and how did you approach it effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you had to navigate a complex rule or policy - how did you ensure fairness and clarity in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to adopt your point of view, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to adopt your viewpoint, and how did you approach the negotiation?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your perspective was effectively communicated?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point of view or negotiate a resolution? How did you approach the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your perspective was effectively communicated?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to navigate a complex rule or policy - how did you ensure fairness and clarity in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze a complex issue from multiple perspectives, and how did you form a reasoned conclusion?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to argue a point persuasively, and how did you ensure your message was effectively conveyed?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to navigate a complex rule or regulation, and how did you ensure compliance?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to advocate for yourself or someone else, and how did you approach the challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to navigate a complex rule or policy that affected you or someone else?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to navigate a complex rule or policy that impacted a group or community?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure you understood its implications?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or guideline, and how did you ensure you were interpreting it correctly?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or guideline, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to persuade someone to adopt your point of view, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or regulation, and how did you ensure compliance while achieving your goal?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you had to argue a point persuasively, and how did you ensure your message was clear and impactful?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to navigate a complex rule or policy? How did you ensure you understood it correctly?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did you ensure fairness in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that seemed unfair, and how did that shape your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed or been part of a situation where fairness was a concern, and how did you navigate or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice was a concern, and how did you engage with or learn from those experiences?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever navigated a situation where rules or fairness were debated, and how did that spark your curiosity about the systems that govern societies?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how did that experience shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your approach to problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever navigated a situation where fairness or justice was at stake, and how did that influence your perspective on the role of laws in society?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your approach to understanding boundaries and governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or conflict, and how it sparked your curiosity about the systems that govern society?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your approach to fairness or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or conflict, and how did that shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you had to navigate a complex rule or regulation, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or policy, and how did that shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy, and how did that experience shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you engaged in any activities, such as debates or volunteer work, that sparked your curiosity about laws and their societal impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you had to navigate a complex rule or policy, and how did that shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or policy, and how did it spark your curiosity about the systems that govern society?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or conflict, and how did that shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or regulation, and how did that experience shape your approach to problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did that experience shape your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a complex rule or conflict, and how did that experience shape your interest in understanding laws?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or regulation that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a rule or policy that seemed unfair, and how did you respond?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or conflict, and how did it shape your perspective on fairness or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a rule or policy that seemed unfair, and how you addressed it?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that seemed unfair, and how did you address it?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy, and how did that experience shape your approach to resolving conflicts or making decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you had to navigate a complex rule or policy, and how did that shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did that experience shape your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or conflict, and how did that shape your understanding of fairness or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or disagreement, and how did that experience shape your approach to resolving conflicts?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was questioned, and how did you navigate or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or regulation, and how did it spark your curiosity about the legal framework's impact on society?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever navigated a complex rule or policy that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever navigated a situation where fairness or justice was at stake, and how did that experience shape your perspective on resolving disputes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or regulation, and how did that experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy, and how did that experience shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or regulation, and how did that shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed or been part of a situation where fairness was questioned, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever navigated a situation where fairness or rules were debated, and how did that experience shape your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised? How did you respond, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did that experience shape your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did that experience shape your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever navigated a situation where rules or fairness were debated, and how did that spark your curiosity about the systems that govern society?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or conflict, and how did that shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you engaged in debates, mock trials, or discussions on social justice, and how did these shape your understanding of fairness and governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did that experience shape your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you had to navigate a complex rule or policy, and how did that shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a complex rule or policy, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your interest in understanding legal systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a complex rule or policy, and how did that experience shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how laws shape our daily lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or conflict, and how it sparked your curiosity about the role of laws in society?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you had to navigate a rule or policy that seemed unfair, and how did you respond?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you engaged with or observed situations where fairness, justice, or rules were debated, and how did these experiences shape your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or regulation, and how did that shape your understanding of fairness or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you encountered situations where fairness or justice was compromised, and how did you respond or reflect on these experiences?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever witnessed or experienced a situation where fairness was compromised, and how did that influence your interest in understanding laws and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a complex rule or regulation, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or regulation, and how did that experience shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever navigated a situation where rules or fairness were debated, and how did that experience shape your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you engaged in debates, mock trials, or discussions on social justice issues that sparked your curiosity about the legal system's role in society?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did that experience shape your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or conflict, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your interest in understanding legal systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever navigated a situation where rules or fairness were debated, and how did that experience shape your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you had to navigate a complex rule or regulation, and how did that shape your approach to fairness or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or conflict, and how did it shape your approach to fairness and justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or conflict, and how did that shape your approach to fairness or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your interest in understanding legal systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you ever navigated a situation where rules or fairness were debated, and how did that experience shape your perspective on justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how laws shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did that experience shape your interest in understanding legal frameworks?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Have you engaged in debates, negotiated resolutions to conflicts, or explored rules and governance in any?",
    "criterion": "Experiences"
  },
  {
    "major": "Legal Studies",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that sparked your curiosity about how laws shape our daily lives?",
    "criterion": "Experiences"
  }
]