[
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one related to your own heritage, sparked your curiosity to teach or share it with others?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own heritage or cultural experiences, how do you think studying the language, history, and traditions of a specific community could enrich your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one tied to your heritage, sparked your curiosity to teach or share it with others?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think learning about a specific cultural heritage could enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored or been inspired by the history, culture, or language of Malay communities, and how might this inspire your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language, literature, and cultural heritage might enrich your future career or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share a moment when learning about a culture, particularly one tied to your heritage, sparked your curiosity to teach or share it with others?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience that sparked your curiosity about Malay culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own heritage or cultural experiences, how might exploring the history, language, and traditions of a specific community shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture or language sparked your curiosity, and how you think exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one tied to your heritage, sparked your curiosity to teach or share it with others?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about Malay culture, and how do you see exploring it impacting your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your experiences, how do you think exploring the culture, language, and history of Malay communities could enrich your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language and culture could enrich your personal growth or future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own heritage or cultural experiences, how might exploring the language, history, and traditions of Malay communities enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own heritage or cultural interests, how do you see exploring the history and contemporary issues of Malay communities shaping your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about Malay culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience that sparked your curiosity about Malay culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see exploring the language, culture, and history of Malay communities enriching your future career or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think learning about the Malay language and culture can enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language and culture could enrich your future teaching practices or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one tied to your heritage, sparked your curiosity to teach or share it with others?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, like your own or another's, sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one tied to your heritage, sparked your curiosity and desire to teach or share it with others?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language and culture might enrich your personal growth or future career, and why this excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the language, culture, and history of Malay communities might shape your personal growth or future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored the rich cultural heritage of the Malay community, and how might sharing such knowledge inspire young minds in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see exploring the language, culture, and education of Malay communities shaping your future aspirations or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, especially one tied to your heritage, sparked your curiosity and desire to teach or share it with others?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about Malay culture, and how might exploring it further shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the rich cultural heritage and language of Malay communities might shape your personal growth or future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one tied to your heritage, sparked your curiosity, and how might exploring such topics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about Malay culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored or been inspired by Malay culture, and how do you think learning about it could shape your future or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or past experiences, what aspects of Malay culture, history, or education systems excite you, and how might exploring these further enrich your future path?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Have you explored how the cultural heritage of a community can shape educational practices, and how might this intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, like Malay heritage, sparked your curiosity, and how might exploring such topics shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about Malay culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one tied to a language, sparked your curiosity and how you think it could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language and culture could enrich your personal growth or shape your future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience that sparked your curiosity about Malay culture, and how do you see exploring it further impacting your personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one related to your heritage, sparked your curiosity to teach or share it with others?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about Malay culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own heritage or cultural experiences, how do you think studying a subject that combines cultural exploration with educational practices could enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or volunteer work, how might exploring the language, culture, and education systems of Malay communities enrich your future personal or professional path?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own heritage or cultural exposures, how do you see exploring and sharing a specific cultural identity shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language and culture might enrich your personal growth or future career opportunities?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language, culture, or community might enrich your personal growth or shape your future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own heritage or cultural experiences, how might exploring a specific cultural group's history and education systems shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your passions, how might exploring the language, culture, and education of Malay communities enrich your future career or personal journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the language, culture, and history of Malay communities might shape your personal growth or future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or encounter that sparked your curiosity about Malay culture, and how do you see exploring it further impacting your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might sharing such knowledge inspire future generations in an educational setting?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Have you ever considered how learning about a culture's history and language can shape your own identity and inform your approach to teaching others?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might sharing this knowledge inspire future generations in an educational setting?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one tied to a language like Malay, sparked your curiosity about its educational preservation?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think learning about a specific culture's history and education systems could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language and culture could enrich your personal growth or future career paths?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or experiences, what aspects of learning about Malay culture, language, or history excite you, and how might this shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about Malay culture, and how do you see exploring it further impacting your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one related to your heritage, sparked your curiosity and desire to teach or share it with others?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or encounter that sparked your curiosity about Malay culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one tied to your heritage, sparked your curiosity and shaped your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own heritage or cultural interactions, how might exploring a specific cultural community's history and education systems enrich your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language and its cultural heritage might shape your future goals or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one related to your heritage, sparked your curiosity to teach or share it with others?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about Malay culture, and how do you see exploring it impacting your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture or community sparked your curiosity, and how you think exploring such themes could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or volunteer work, how might exploring the Malay language and culture enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about Malay culture, language, or education, and how you see it shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language and culture could enrich your personal growth or shape your future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about Malay culture, and how do you see exploring it further shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one tied to a language, sparked your curiosity, and how might exploring such connections shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your experiences, how do you think learning about a specific culture's history and education systems could enrich your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own heritage or cultural experiences, how do you think studying a specific cultural group's history and education systems could enrich your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language, culture, or history might enrich your personal growth or future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how learning about diverse cultures or histories has sparked your curiosity, and how you see this shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language and culture might enrich your personal growth or influence your future career path?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or volunteer work, what aspects of Malay culture or education systems inspire you to deepen your understanding of them?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own heritage or cultural experiences, how do you think studying the history and traditions of a specific community could shape your future career or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture or community, perhaps your own, sparked your curiosity to teach or share it with others?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the language, culture, and history of Malay communities might shape your personal growth or future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or volunteer work, how do you think studying a culture and its education system could enrich your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience that sparked your curiosity about Malay culture, and how do you see exploring it further shaping your personal or professional goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or passions, how might exploring the cultural heritage and educational development of a specific community shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language and culture might enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, like Malay, sparked your curiosity, and how you think exploring such heritage could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture or community inspired you, and how you think exploring such topics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the language, culture, and history of Malay communities might enrich your personal growth or future career paths?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or volunteer work, how might exploring the language, culture, and history of Malay communities enrich your future career or personal journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one tied to a language like Malay, sparked your curiosity and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Have you ever been fascinated by the cultural heritage of Malay communities, and how would exploring this interest impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Malay language, culture, or community has sparked your curiosity, and how you see this passion influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about Malay culture, and how exploring it further could enrich your future path?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored or been inspired by Malay culture, and how do you think learning about it could shape your future or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or volunteer work, how do you see exploring Malay culture and teaching methods shaping your future goals or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or past experiences, what sparks your curiosity about the cultural heritage and educational development of Malay communities?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, particularly one tied to a language like Malay, sparked your curiosity to teach or share it with others?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about Malay culture, and how exploring it further could shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or volunteer work, how might exploring the cultural heritage and education systems of Malay communities enrich your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did that shape your approach to teaching or sharing knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning about a culture different from your own has influenced your perspective or teaching approach in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own, and how would you teach its significance to younger peers?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated or learned about a cultural heritage, and how you think it shaped your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a cultural heritage and how you would creatively teach it to others in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how learning about diverse cultures, particularly Malay heritage, has influenced your perspective on education's role in bridging community gaps?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated Malay cultural values to someone unfamiliar with them, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from yours, and how would you teach others about it engagingly?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a cultural heritage, and how would you creatively teach it to others in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from yours, and how would you teach others about it engagingly?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone unfamiliar with it, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've used language or cultural skills to bridge a gap between people from different backgrounds?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own, and how would you teach its significance to others?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied your understanding of Malay culture to help others learn, and how might this shape your future teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied your understanding of Malay culture or language to help others learn or appreciate it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how learning about diverse cultures, particularly those of the Malay community, has influenced your own perspectives or teaching approaches in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own, and how would you teach its significance to younger peers?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've used your understanding of a cultural heritage to educate or engage others, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how learning about diverse cultures, particularly those relevant to your community, might shape your approach to teaching or mentoring others?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own and how you would teach its significance to others?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to a diverse group, and how did you ensure its relevance to their lives?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own, and how would you teach its significance to younger students?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural value or tradition to someone from a different background, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied your understanding of Malay culture to bridge a communication gap or support a peer's learning?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning about a culture different from your own has influenced your perspective or teaching style?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to a diverse group, and how did you ensure mutual understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated Malay cultural values to someone unfamiliar with them, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a cultural heritage, and how would you creatively teach it to younger peers?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning about a culture different from your own has influenced your perspective, and how might you apply this in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a cultural heritage and how would you creatively teach it to your peers?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how you would teach a traditional Malay custom to a diverse group of students who may have never encountered it before?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied cultural knowledge to bridge a communication gap, and how might this skill support your future community engagement?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how learning about diverse cultures, particularly those related to the Malay community, has influenced your perspective on education's role in societal harmony?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how learning about diverse cultures, particularly Malay heritage, has influenced your perspective on education's role in shaping identities?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from yours, and how would you teach its significance to others?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it could enrich your teaching or learning approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to others, and how did you ensure it was engaging and respectful?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own, and how would you teach its significance to younger peers?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own and how you would teach its significance to others?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural value or tradition to someone from a different background, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to others, and how would you adapt this skill in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from yours, and how would you teach others about it effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated or learned about a cultural practice different from your own, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own, and how would you teach its significance to younger peers?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own, and how would you teach its significance to younger peers?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural value or tradition to someone from a different background, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone unfamiliar with it, and how did you ensure mutual understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural value or tradition to someone from a different background, and how did it impact your teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning about a culture different from yours has influenced your perspective, and how might you apply this in an educational setting?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to others, and how did you adapt your approach to engage diverse audiences?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning about a culture different from yours has influenced your perspective or teaching approach in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a cultural heritage, and how would you creatively teach it to others in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural value or tradition to someone from a different background, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from yours, and how would you teach its significance to younger peers?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated or learned about a cultural practice different from your own, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the history and culture of a community, like your own or another, might shape your approach to teaching and learning?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own and how you would adapt it to teach others effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you ensure understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural value or tradition to someone from a different background, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural value or tradition to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to others, and how did you ensure it was engaging and respectful?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've used your understanding of a cultural practice to educate or enlighten someone else, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a cultural heritage, and how would you creatively teach it to others in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated or learned about a cultural heritage, and how it impacted your perspective or teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own, and how would you teach its significance to younger peers?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how your cultural heritage or language skills might help you connect with diverse communities in a future educational or social role?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated or learned about a cultural tradition different from your own, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a cultural heritage, and how would you creatively teach it to others in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied your understanding of a cultural practice or language to bridge a gap between different communities?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share how your understanding of a multicultural society influences your approach to teaching or learning about diverse cultural heritage?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated or taught a cultural concept to someone from a different background, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it could shape your future interactions or career?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning about a culture different from your own has influenced your perspective or teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated Malay cultural values to someone unfamiliar with them, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning about a culture different from yours has influenced your perspective or approach to teaching or sharing knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own, and how would you teach its significance to younger peers?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural value or tradition to someone from a different background?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own, and how would you teach others about it effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about or engaged with Malay culture, and how it sparked your interest in education or community development?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it could shape your future interactions or career?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you engaged with Malay culture or language, and how it sparked your interest in education or community development?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in learning or sharing knowledge with diverse groups?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about or shared aspects of Malay culture, and how did it impact your understanding of community or education?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it could shape your future interactions or career?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it shaped your understanding of education's role in cultural preservation?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your curiosity or passion for learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about or shared aspects of Malay culture, and how did that shape your interest in education?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it shaped your understanding of diverse communities?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in teaching or sharing cultural heritage?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about a culture different from your own, and how it sparked your interest in teaching or sharing knowledge?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it shaped your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it spark your interest in teaching or sharing this heritage with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about or shared aspects of Malay culture, and how did that shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a field that combines cultural studies with education?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about or engaged with Malay culture, and how did it shape your understanding of education's role in preserving heritage?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, perhaps your own or another's, sparked your curiosity to teach or share it with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others deepened your understanding of a community, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it shaped your understanding of education's role in preserving heritage?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others deepened your understanding of a community, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it shaped your understanding of diverse communities?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you engaged with Malay culture or language, and how did it shape your interest in education or community development?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others deepened your understanding of a community, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about or engaged with Malay culture, and how did it spark your interest in education or community development?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it could shape your future interactions or career?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in any cultural or educational activities that deepened your understanding of Malay heritage, and how might these experiences shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you engaged with Malay culture or language, and how do you think it shaped your understanding of diverse communities?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a field that combines cultural studies with education?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your curiosity or passion for learning and growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about or shared aspects of Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it impact your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about or shared a cultural heritage, and how it shaped your views on education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it shaped your understanding of community or education?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it could shape your future interactions or career?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it could shape your future interactions or career?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a cultural practice sparked your interest in learning or education pathways?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you engaged with Malay culture or language, and how it sparked your interest in exploring its educational aspects further?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it shaped your understanding of community and education?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it impact your understanding of community or education?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you engaged with Malay culture or language, and how did it shape your interest in education or community development?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it shaped your understanding of diverse communities?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in teaching or sharing cultural knowledge?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about or shared aspects of Malay culture, and how did it impact your understanding of diverse communities?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you engaged with Malay culture or language, and how did it shape your interest in education or community development?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it impact your desire to teach or share knowledge with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others deepened your understanding of a community, and how did it impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it spark your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in any cultural or educational activities that deepened your understanding of Malay heritage, and how might these experiences shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you engaged with Malay culture, language, or community, and how it sparked your interest in education or cultural preservation?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you engaged with Malay culture, language, or community, and how it sparked your interest in education or cultural preservation?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how it sparked your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Have you participated in cultural events or language programs that deepened your connection to Malay heritage, and how might this inspire your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it shaped your understanding of diverse communities?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it could shape your future interactions or career?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about or shared a cultural tradition, and how it shaped your perspective on teaching or learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in learning or sharing more?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in learning or education pathways?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture, language, or history sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it shaped your understanding of diverse communities?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage or a cultural community inspired you to learn or teach others about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you engaged with Malay culture or language, and how it sparked your interest in education or community development?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it shaped your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how do you think it could shape your future interactions or career?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it spark your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about or shared aspects of Malay culture, and how did it impact your understanding of community or education?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you learned about or shared aspects of Malay culture, and how did it impact your understanding of diverse communities?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in any cultural or educational activities that deepened your understanding of Malay heritage, and how might these experiences shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how it sparked your interest in teaching or sharing it with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it shape your interest in education or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated Malay culture, and how did it spark your interest in education or community engagement?",
    "criterion": "Experiences"
  }
]