[
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your own heritage or cultural experiences, how do you think exploring the history and traditions of a specific ethnic group could enrich your personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your hobbies or experiences, how do you think exploring the language, culture, and history of Malay communities could enrich your personal growth or future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share a moment when learning about a culture, tradition, or history sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how the Malay language and culture influence communities in Southeast Asia, and how exploring this could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how do you think learning about their history and traditions could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of the Malay community, and how might this exploration shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Malay culture, and how exploring it further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Southeast Asia, and how might understanding its diverse societies shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the cultural, historical, or social dynamics of Malay communities, and how might exploring these aspects further enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might understanding this diversity shape your future goals or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the rich cultural heritage and contemporary issues of Malay communities might enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your hobbies or experiences, what aspects of Malay culture, history, or language excite you to explore further in your academic journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Could you share an experience or moment that sparked your curiosity about Malay culture, and how exploring it further might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your hobbies or past experiences, what aspects of Malay culture, history, or language inspire you to explore them further in your academic journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the rich cultural heritage and history of Malay communities might shape your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your future pursuits or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, culture, or history of Malay communities might enrich your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, culture, or history of Malay communities might enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, culture, or history of Malay communities might enrich your personal growth or future career path?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your future pursuits or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, culture, or history of Malay communities might enrich your personal growth or future career paths?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your hobbies or experiences, how might exploring the language, culture, or history of Malay communities enrich your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture, tradition, or history sparked your curiosity, and how might exploring such topics shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share a moment when you discovered something fascinating about Malay culture, and how do you think exploring it further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you explored how understanding a culture's history and traditions can enrich your perspective, and how might this impact your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Southeast Asian communities, and how might understanding these traditions shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Malay culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your hobbies or experiences, how do you think exploring the language, culture, and history of Malay communities could enrich your personal growth or career path?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an aspect of Malay culture or history that fascinates you, and how exploring it deeper could enrich your personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your hobbies or past experiences, what sparks your curiosity about the cultural, social, or historical aspects of Malay communities?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how do you think this knowledge could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Southeast Asia, and how might understanding its diverse societies shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about the language, culture, or history of the Malay community?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of the Malay community, and how might understanding its history and traditions shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an aspect of Malay culture or history that fascinates you and how exploring it deeper could enrich your personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Malay culture, and how exploring it further might enrich your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Could you share an experience or encounter that sparked your curiosity about Malay culture, and how exploring it further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might understanding their history and traditions shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share a moment when you felt connected to Malay culture or language, and how exploring it further could shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the cultural heritage of Malay communities, and how might exploring this interest influence your personal growth or career path?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share a personal experience or encounter that sparked your curiosity about the language, culture, or history of Malay communities, and why does it resonate with you?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture, particularly one tied to your heritage or curiosity, sparked a desire to explore it further?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Could you share an aspect of Malay culture or history that fascinates you, and how exploring it further might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you explored how the cultural heritage of Southeast Asian communities could shape your future career or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your future pursuits or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your own heritage or cultural encounters, how might exploring the history and traditions of Malay communities enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your own heritage or cultural explorations, what aspects of a community's language, history, or traditions excite you to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Southeast Asian communities, and how might this exploration shape your future career or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the culture, history, or language of Malay communities might enrich your personal growth or future career paths?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of the Malay community, and how might this exploration shape your future career or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of the Malay community, and how might this knowledge shape your future pursuits or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, culture, and history of Malay communities might enrich your personal growth or future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you explored how understanding a culture's history and language can shape your perspective, and how might that impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of the Malay community, and how might this exploration shape your future pursuits or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how the cultural heritage of a community shapes its modern identity, and how exploring this intersection could enrich your own perspective?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Malay culture, and how exploring it further might shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your hobbies or past projects, how do you think exploring Southeast Asian languages, cultures, or histories could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture, tradition, or language sparked your curiosity, and how might exploring such aspects further enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you explored the rich cultural heritage of Malay communities, and how might this knowledge shape your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of the Malay community, and how might understanding it shape your global perspective or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the Malay language, culture, or history, and how might exploring these areas enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of the Malay community, and how might this exploration shape your personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your personal or professional aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your hobbies or cultural exposures, what aspects of Malay language, history, or traditions inspire you to explore them further in your academic journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Malay culture, and how exploring it further might shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, culture, or history of Malay communities might enrich your personal growth or future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share a moment when you discovered something fascinating about Malay culture, and how do you see exploring it further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, culture, or history of Malay communities might enrich your personal growth or future career paths?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your hobbies or experiences, what aspects of Malay culture, history, or language excite you to explore further in your academic journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your hobbies or cultural experiences, how do you think exploring the history, language, and traditions of Malay communities could enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the Malay language, culture, or community, and how might exploring these further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Southeast Asia, and how might understanding its diverse Malay influences shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of the Malay community, and how might understanding this diversity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, culture, or history of Malay communities might shape your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the history, culture, and contemporary issues of Malay communities might enrich your personal growth or future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Could you share how exploring the rich cultural heritage and contemporary issues of Malay communities might shape your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of the Malay community, and how might this knowledge shape your future pursuits or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share a moment when exploring Malay culture, history, or literature sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture, particularly one tied to your heritage or curiosity, sparked your desire to explore it further?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this knowledge shape your global perspective or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about Malay culture, and how exploring it further might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, literature, or cultural heritage of Malay communities might enrich your personal growth or future career path?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your hobbies or cultural experiences, what aspects of Malay language, literature, or history excite you to explore further in your academic journey?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share a personal experience or encounter that sparked your curiosity about the language, culture, or history of Malay communities, and how do you see this interest influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture, tradition, or language sparked your curiosity, and how exploring it further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of the Malay community, and how might understanding its history and traditions shape your personal or professional goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of the Malay community, and how do you think understanding it could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an aspect of Malay culture or history that fascinates you, and how exploring it further could shape your personal or professional goals?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Southeast Asia, and how might understanding its diverse societies shape your global perspective?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Reflecting on your hobbies or cultural exposures, what aspects of Malay language, literature, or Southeast Asian heritage inspire you to explore them further in your studies?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever explored the rich cultural heritage of Malay communities, and how might this exploration shape your personal or professional aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a culture different from your own has influenced your perspective or decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a cultural heritage, like your own or another's, has influenced your perspective or skills in a meaningful way?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural tradition or language helped you better understand a community, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the cultural heritage of a community, like tracing the evolution of its traditions, might enrich your understanding of diverse societies?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural tradition or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring the history and culture of a community, like your own or another's, has sparked your curiosity or challenged your perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a community's traditions sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring the history and culture of a community, like your own or another's, has sparked your curiosity or influenced your perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored or celebrated a cultural heritage, and how did that shape your understanding of diverse societies?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the history and culture of Malay communities might enrich your personal growth or inform your future career choices?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the history and culture of Malay communities might shape your perspectives or inform your future contributions to society?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural tradition or language sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a culture's history and literature has influenced your perspective, and how might this shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage, different from your own, sparked your curiosity, and how did you delve deeper into it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a culture's history and traditions has influenced your perspective, and how might this shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring your own cultural heritage or that of others has influenced your perspective on community or identity?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural tradition or language deepened your understanding of a community, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring your own cultural heritage or another culture has influenced your perspective on community or identity?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored your cultural heritage, and how do you think understanding diverse traditions might shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural tradition or language broadened your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring your own cultural heritage or that of others has influenced your perspectives or skills in a meaningful way?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring the cultural heritage of a community, like your own or another's, has sparked your curiosity or shaped your perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the language, culture, or history of a community has influenced your personal growth or shaped your career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a cultural heritage, like a language or tradition, has influenced your personal growth or sparked career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a cultural heritage, like your own or another's, has sparked your curiosity or broadened your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a culture's history and traditions has influenced your perspective, and how might this shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the history and culture of a specific ethnic group might shape your understanding of diverse societies?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or tradition helped you better understand a community, and how might this skill be valuable in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural tradition or language sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the history and culture of Malay communities might enrich your understanding of diverse societies and inform your future career choices?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a culture different from your own has influenced your perspective or decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a culture different from your own has influenced your perspective or decisions, and why?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural tradition or language sparked your curiosity, and how did you deepen your understanding of it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the cultural heritage of a specific community, like your own, might shape your future career or personal development?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or tradition deepened your understanding of a community, and how might this skill serve your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage, tradition, or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage, tradition, or language sparked your curiosity, and how did it shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a cultural heritage, like your own or another's, has sparked your curiosity or influenced your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural tradition or language deepened your understanding of a community, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a culture's history and traditions has influenced your perspectives, and how might this continue to shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a culture's history and traditions has influenced your perspective, and how might this shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the cultural heritage of a community, like yours or another's, might enrich your understanding of identity and inform your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural tradition or language sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the cultural heritage of a community, like tracing its historical evolution, might enrich your own perspective and future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the history and culture of Malay communities might shape your perspective on diversity in a globalized world?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the history and culture of a specific ethnic group has influenced your understanding of diverse societies?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how did that shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a cultural heritage, like a language or tradition, has influenced your perspective or skills, and how might this continue to shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture different from yours impacted your perspective, and how might such insights shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture different from your own sparked curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with Malay culture, and how do you think exploring such heritage could enrich your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the cultural heritage of a community, like tracing the evolution of traditional practices, might enrich your personal growth or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage, different from your own, sparked your curiosity, and how did you engage with it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked curiosity in you, and how did you engage with it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a cultural heritage, like your own or another's, has influenced your personal growth or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the cultural heritage of a community, like yours or another, has shaped your interests or career aspirations so far?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the cultural heritage of a community, like tracing the evolution of its traditions, might enrich your personal growth or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural tradition or language helped you understand a community better, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or tradition helped you understand a community's values, and how might this skill be valuable in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a cultural heritage, different from your own, sparked your curiosity and influenced your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new cultural perspective sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage, tradition, or language sparked your curiosity, and how did it shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a cultural heritage, similar to Malay traditions, helped you connect with others or broadened your worldview?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural tradition or language deepened your understanding of a community, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a culture's history and traditions has influenced your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage, perhaps your own or another's, sparked your curiosity, and how did you engage with it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural tradition or language sparked your curiosity, and how did you delve deeper into it?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "How do you think studying the history and culture of Malay communities can help you bridge cultural gaps in a diverse, globalized society?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring your own cultural heritage or that of others has influenced your personal growth or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the history and culture of Southeast Asian communities might shape your perspective on social issues in your future career or personal life?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the history and culture of Southeast Asian communities might shape your perspective or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural tradition or language helped you bridge a communication gap or fostered personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture different from yours impacted your perspective, and how might exploring Southeast Asian traditions shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new cultural perspective helped you better understand societal dynamics or informed your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a culture's history and literature has influenced your perspective, and how might this shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the history and culture of Malay communities might enrich your understanding of Southeast Asia's diversity?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked curiosity in you, and how might this shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share how exploring the history and culture of a specific ethnic group could enrich your understanding of diverse societies and inform your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about diverse cultures, particularly those in Southeast Asia, has influenced your personal growth or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a culture different from your own has broadened your perspectives or influenced your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a culture different from your own has influenced your perspective or decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "How do you think exploring the cultural heritage of a specific ethnic group could enrich your understanding of Southeast Asia's diverse societies?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "How do you think exploring the history and culture of Southeast Asian communities can enrich your understanding of modern societal dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring your own cultural heritage or that of others has influenced your understanding of Southeast Asian communities?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a cultural heritage, like your own or another's, has influenced your perspectives or skills in a meaningful way?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new culture sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Malay culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged with Malay culture, language, or history in ways that sparked your curiosity or shaped your understanding of diverse communities?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your heritage or a cultural community sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture, tradition, or language sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community issue sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged with Malay culture, language, or community in meaningful ways that sparked your curiosity for deeper academic exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community, perhaps your own or another's, sparked your curiosity about its history, traditions, or contemporary issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage, tradition, or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Malay culture, language, or history sparked your curiosity, and how might this interest shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you explored Malay culture, history, or language in ways that sparked your curiosity, and how might these experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture, language, or community different from your own sparked your curiosity and shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your heritage or a cultural tradition sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture, tradition, or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a diverse community sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your heritage or a cultural tradition sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a Southeast Asian community sparked your curiosity about its history, traditions, or contemporary issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community tradition sparked your curiosity, and how did you engage with it?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Malay culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community tradition sparked your curiosity, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a community's traditions sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a Southeast Asian community sparked your curiosity about its history, traditions, or contemporary issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture, tradition, or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community tradition sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or language sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community, perhaps your own or another's, sparked your curiosity and shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community, perhaps your own or another's, sparked your curiosity about its history, traditions, or contemporary significance?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you explored Malay culture, history, or language in ways that sparked your curiosity, and how might these experiences shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community tradition sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a Southeast Asian community deepened your understanding of its history, values, or contemporary issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged with Malay culture, language, or history in ways that sparked curiosity about its broader societal impacts or your personal identity?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a diverse community sparked curiosity, and how might that relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged in activities or communities that deepened your understanding of Malay culture, and how might this enrich your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged with Malay culture, language, or community activities that sparked your curiosity about its history, society, or contributions to Southeast Asia?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community tradition sparked your curiosity, and how might such exploration shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture, language, or history outside your own sparked your curiosity, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture, tradition, or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community tradition sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community tradition sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community tradition sparked your curiosity, and how did that shape your interests or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a community's traditions sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Malay culture, history, or language sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or tradition, perhaps your own or another's, sparked your curiosity about its history or societal impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring the language, culture, or history of a community helped shape your goals or worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Malay culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community, perhaps your own or another's, sparked your curiosity about its history and traditions?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or learning a new language sparked your curiosity about its broader social or historical?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring the language, culture, or history of a community helped shape your identity or sparked a desire to learn more?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Malay culture, language, or history sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage, tradition, or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a Southeast Asian community sparked your curiosity about its history, traditions, or contemporary issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your heritage or a culture different from yours sparked curiosity or personal growth, and how might that relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged with Malay culture, language, or history in ways that sparked your curiosity about its broader social or personal significance?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you explored or wish to engage with Malay culture, language, or history in ways that might shape your future pursuits or personal identity?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage, tradition, or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a community's traditions sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a community's traditions sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged with Malay culture, language, or community initiatives in ways that sparked your curiosity or shaped your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a community's traditions sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community issue sparked your curiosity, and how did you engage with it?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged with Malay culture, language, or literature in a way that sparked curiosity about its role in shaping communities, and how?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community, perhaps your own or another's, sparked your curiosity about its history, traditions, or social dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a Southeast Asian community sparked your curiosity about its history, traditions, or contemporary issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a diverse community sparked your curiosity about its history, traditions, or societal contributions?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a diverse community sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a new cultural community sparked your curiosity, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage, tradition, or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or tradition deepened your understanding of a community, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged in any cultural or community activities that deepened your understanding of Malay heritage, and how might these experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged with or explored the Malay language, literature, or cultural practices in ways that sparked your curiosity about their broader social or historical contexts?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged with Malay culture, language, or history in meaningful ways that inspire your future pursuits or personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community tradition sparked your curiosity, and how might such exploration shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your heritage or a cultural community sparked your curiosity, and how might this continue to inspire your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged with Malay culture, language, or community initiatives in ways that sparked your curiosity about its historical, social, or contemporary significance?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community, perhaps your own or another's, sparked your curiosity about its history, traditions, or contemporary issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged in any cultural or community activities that deepened your understanding of Malay heritage, and how might this shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your heritage or a cultural tradition sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or tradition helped you better understand a community, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community tradition sparked your curiosity, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you explored or engaged with Malay culture, language, or history in ways that sparked your curiosity or shaped your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a Southeast Asian community deepened your understanding of its social dynamics or historical?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Malay culture, history, or language sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you explored or been exposed to Southeast Asian cultures, languages, or histories that sparked your curiosity about their societal impacts?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community, similar to Malay traditions, sparked your curiosity about its history or societal impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage, tradition, or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Malay culture, language, or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Malay culture, language, or history sparked your curiosity, and how might this passion influence your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Malay culture, language, or history sparked your curiosity, and how might this continue to inspire you in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you explored Malay culture, history, or language through travel, school projects, or community engagement that sparked your curiosity about its societal impacts?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you ever engaged with or explored the Malay language, literature, or cultural practices that sparked your curiosity about their historical or contemporary significance?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you explored or engaged with Malay culture, language, or literature in ways that sparked your curiosity about its broader social or historical contexts?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or language sparked your curiosity, and how might this interest influence your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged with Malay culture, language, or history in ways that sparked your curiosity about its significance in Southeast Asia's diverse societies?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring your cultural heritage or a Southeast Asian community deepened your understanding of its social, historical, or literary aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community, perhaps your own or another's, sparked your curiosity about its history or societal role?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you engaged with Malay culture, language, or history in meaningful ways, and how might these experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community, similar to Malay culture, sparked your curiosity or shaped your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or community tradition sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Have you explored Malay culture, history, or language through school projects, personal interests, or community engagements that sparked your curiosity about its significance?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring Malay culture, language, or history sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Malay Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a cultural heritage or language sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  }
]