[
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a problem, and how did that moment spark your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how mathematical concepts have intrigued you in everyday life, sparking a desire to explore them further?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked joy, and how might such analytical challenges shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex math problem felt rewarding to you, and how do you see math shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem felt rewarding to you, and how do you think this curiosity might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you found a hidden pattern or solved a complex problem, and how did that moment spark your curiosity to explore deeper mathematical connections?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that moment influence your academic pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser sparked your curiosity, and how might exploring such challenges benefit your future?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or pattern sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've applied logical thinking or problem-solving in a creative way, and how that experience sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a problem, and how did that moment spark your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've applied mathematical thinking to solve a real-life problem, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or pattern sparked your curiosity, and how you see such challenges shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a mathematical puzzle or problem felt particularly rewarding to you, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've used mathematical thinking to solve a real-life problem or puzzle that genuinely intrigued you?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how did that moment influence your academic or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem sparked your curiosity, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a mathematical puzzle or problem felt rewarding to you, and how that experience shaped your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a real-life problem, and how did that spark your curiosity to explore it further?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or pattern sparked your curiosity, and how might exploring such puzzles shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex math problem felt rewarding to you, and how do you see this passion driving your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how solving a complex problem or puzzle sparked your curiosity, and how you see this drive impacting your future studies or career?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem sparked your curiosity, and how did that experience shape your academic pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how do you see yourself applying analytical thinking in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a mathematical puzzle or problem sparked your curiosity, and how did that moment influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share a moment when solving a complex problem sparked your curiosity, and how do you see mathematical thinking shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or problem sparked joy, and how might such analytical challenges shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you found a pattern or solved a problem that sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a real-life problem, and how did that moment spark your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a problem, and how did that moment spark your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share a moment when solving a complex math problem excited you, and how do you see this passion guiding your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you found a mathematical concept fascinating and how you see it shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a real-life problem, and how did that spark your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or puzzle sparked your curiosity, and how did that experience influence your academic pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how it relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how do you see such analytical thinking shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex math problem felt rewarding to you, and how did that experience shape your curiosity for abstract concepts?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex math problem felt rewarding, and how do you see such skills shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've used problem-solving or logical reasoning in a unique way, and how that experience sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or puzzle sparked your curiosity, and how did that experience influence your academic pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how mathematics has helped you solve a real-life problem, and how do you see this skill evolving in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share a moment when solving a complex math problem felt rewarding to you, and how do you see this passion driving your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you found a pattern or solved a puzzle that sparked your curiosity, and how did it make you feel?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a problem or understand something new, and how did that moment spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a mathematical puzzle or problem felt particularly rewarding to you, and how did that experience shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem sparked joy or curiosity in you, and how that relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or problem sparked your curiosity, and how do you see this shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've applied mathematical concepts to solve a real-life problem or understand a complex situation?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a real-life problem, and how did that spark your curiosity to explore it further?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a mathematical puzzle or problem sparked joy or curiosity in you, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've applied logical thinking or problem-solving in a creative way, and how that experience sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or problem sparked joy, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem sparked joy or curiosity in you, and how you applied logical thinking to overcome it?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or problem sparked joy, and how might such analytical challenges shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a mathematical puzzle or problem sparked your curiosity, and how you think such experiences might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or understanding a mathematical concept sparked your curiosity and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share a moment when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or pattern sparked your curiosity, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem sparked your curiosity, and how do you see such analytical challenges shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem sparked your curiosity, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how do you see such challenges shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how did that moment shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or pattern sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a problem or understand something new, and how did that moment spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser sparked your curiosity, and how did that experience influence your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a real-life problem, and how did that spark your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked joy, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem sparked your curiosity, and how did that experience shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or problem sparked joy, and how might such analytical thinking shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share a moment when solving a mathematical puzzle sparked joy or curiosity in you, and how do you see this passion evolving in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've applied mathematical thinking to solve a real-life problem, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem felt rewarding to you, and how did that experience shape your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how do you see such analytical skills shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked joy or curiosity in you, and how did that shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a problem, and how did that moment shape your curiosity about its broader applications?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share a moment when solving a complex puzzle or pattern sparked your curiosity, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem felt rewarding to you, and how do you think that relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you found a mathematical concept fascinating and how you think exploring it further could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or puzzle sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how math has helped you solve a real-life problem, and how you see this skill evolving in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how do you see such analytical thinking shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've applied mathematical thinking to solve a real-life problem, and what sparked your curiosity in that moment?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked joy, and how might such analytical thinking shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how do you see yourself applying analytical thinking in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or pattern sparked joy, and how might such moments relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a real-life problem, and how did that moment spark your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or pattern sparked joy, and how might exploring such challenges shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a problem or understand something new, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've applied mathematical concepts to solve a real-life problem or understand a complex situation?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how might such challenges shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser sparked your curiosity, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've applied logical reasoning or problem-solving in a non-academic?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem sparked your curiosity, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how might exploring mathematical concepts further enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a real-life problem, and how did that spark your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did that impact your decision to pursue further study in this field?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem required creative mathematical thinking, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem creatively sparked your curiosity, and how did you approach it systematically?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you solved a complex problem using logical reasoning, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you applied mathematical concepts to solve a real-life problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem, and how did that impact your decision to pursue further study in this field?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when solving a complex puzzle or brain teaser taught you a valuable lesson about perseverance or creative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or brain teaser excited you, and how did you approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or brain teaser taught you a valuable lesson about perseverance or creative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem outside of academics?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem sparked your curiosity, and how did you systematically approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when solving a complex math problem challenged your thinking, and how did that experience shape your approach to problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or brain teaser taught you a valuable lesson about perseverance or creative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that process impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem mathematically helped you make sense of a real-world situation?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem felt rewarding to you, and how did the process of finding a solution impact your thinking?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem felt rewarding to you, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or brain teaser taught you a valuable lesson about perseverance or creative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem felt rewarding to you, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem helped you develop resilience or critical thinking, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem helped you grow, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical thinking to solve a real-life problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of a complex problem you've solved using mathematical reasoning, and how did the process impact your decision-making skills?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex math problem felt rewarding to you, and how did that experience shape your approach to challenges since?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem helped you grow, and how did the process influence your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or brain teaser excited you, and how did you approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a situation where you used mathematical thinking to solve a real-life problem, and how did that experience shape your interest in pursuing further study in this field?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem felt rewarding to you, and how do you think mathematical thinking was essential to that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a situation where you had to break down a complex problem into manageable parts, and how did mathematical thinking help you solve it?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when solving a complex puzzle or brain teaser taught you a valuable lesson about perseverance or creative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem helped you grow, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem felt rewarding to you, and how did that experience shape your interest in pursuing advanced mathematical studies?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex, open-ended problem that requires mathematical thinking, and what excites you about the process?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you solved a complex problem using mathematical reasoning, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem felt rewarding to you, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem helped you grow, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or brain teaser taught you a valuable lesson about perseverance or creative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex, unfamiliar math problem, and how you see this skill benefiting your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or problem sparked your curiosity, and how did you systematically approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem mathematically helped you make sense of a real-world situation?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem felt rewarding to you, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem felt rewarding to you, and how did breaking it down help in finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've applied mathematical thinking to solve a real-world problem or make a personal decision?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem helped you develop resilience or a new perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used mathematical reasoning to solve a real-life problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when solving a complex problem helped you grow, and how did the process spark your curiosity in exploring mathematical concepts further?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when solving a complex math problem felt rewarding to you, and how do you think this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex, unfamiliar math problem, and what strategies you'd use to overcome initial difficulties?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or problem sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem felt rewarding to you, and how do you think this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when solving a complex puzzle or brain teaser sparked your curiosity, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem felt rewarding to you, and how do you think this relates to your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex, open-ended math problem with no clear formula, and what excites you about the process?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've applied logical reasoning or problem-solving skills to overcome a challenge, and how did that experience shape your approach to analytical thinking?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or problem sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem felt rewarding to you, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex, unfamiliar math problem, and what strategies you'd use to overcome initial confusion?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or brain teaser excited you, and how did you approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem sparked your curiosity, and how did you systematically approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex math problem helped you grow, and how might similar challenges shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex math problem felt rewarding to you, and how did that experience shape your approach to challenges since?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex, unfamiliar math problem, and what strategies you'd use to overcome initial obstacles?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've applied mathematical thinking to solve a real-life problem, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of a complex problem you've tackled, and how your analytical approach might be applied to real-world mathematical modeling?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or brain teaser taught you a valuable lesson about perseverance or creative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser excited you, and how did that experience shape your approach to problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem or make a decision that impacted you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did it shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that moment shape your interest in exploring mathematical concepts further?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did it influence your academic or personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did it impact your perspective on learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem, and how did it spark your curiosity for further exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or puzzle sparked your curiosity, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or make a meaningful decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem, and how did it impact your perspective on using math practically?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did it impact your perspective on learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem, and how did it impact your decision to pursue further study in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did it impact your perspective on using math practically?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or make a meaningful decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did it impact your perspective on using math?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of when you applied mathematical concepts to solve a real-world problem, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or understand a complex situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your interest in exploring mathematical concepts further?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did that impact your perspective on learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that shape your interest in analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem or understand a complex situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or understand a complex situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or overcome a challenge, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or make a meaningful decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of a challenging math problem you've encountered and how you approached solving it, highlighting any creative strategies used?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of a challenging problem you solved using mathematical reasoning, and how it sparked your interest in exploring advanced mathematical concepts?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did it impact your perspective on learning math?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used mathematical concepts to solve a real-world problem or understand a complex situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that shape your interest in analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or make a personal decision, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did it impact your perspective on learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that moment influence your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or puzzle sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did it influence your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or make a meaningful decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem or understand a complex situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your interest in analytical thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or puzzle sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that moment influence your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or make a meaningful decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've applied mathematical thinking to solve a real-life problem or overcome a challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of how you've applied logical reasoning or problem-solving skills to overcome a challenge, and how did it impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem, and how did it impact your perspective on learning maths?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem, and how did that impact your interest in pursuing the field?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem, and how did it impact your perspective on using math practically?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex math problem felt rewarding to you, and how did that experience shape your curiosity for deeper mathematical exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did that impact your interest in pursuing math further?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your interest in pursuing advanced mathematical studies?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used mathematical thinking to solve a real-life problem or make an informed decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem or make a significant decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem, and how did it impact your perspective on the subject?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an example of a challenging math problem you tackled, and how working through it influenced your approach to solving complex issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did it shape your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did that impact your interest in pursuing math further?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem or overcome a challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that moment influence your academic interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did that impact your interest in pursuing math further?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did it spark your curiosity for deeper mathematical exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did it shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem or make a meaningful decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did it influence your academic or personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-life problem, and how did it impact your decision to pursue further study?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did it shape your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that shape your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or make a significant decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or puzzle sparked your curiosity, and how did that shape your approach to learning?",
    "criterion": "Experiences"
  }
]