[
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or philosophical idea, how do you think exploring such topics deeper will shape your perspective or career path?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think exploring the fundamental nature of reality and analyzing past events can shape your personal growth or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, how do you think exploring the evolution of ideas and societies can shape your perspective on contemporary global challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think exploring the origins of ideas and societies could shape your perspective on contemporary issues?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the meaning of life, and how might exploring such inquiries shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or philosophical concept, how do you see exploring its deeper meanings shaping your perspectives or career paths?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you encountered a historical event or philosophical idea that challenged your views, and how did that shape your curiosity about the human experience?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, how do you think exploring the evolution of ideas and societies will enrich your perspective on life and inform your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the ethics of historical events, and how might exploring these ideas shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical event or philosophical idea, how do you think exploring such topics deeper will shape your future perspectives or decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical event or philosophical idea, how do you see exploring the 'why' behind human actions shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, how do you think exploring big questions about existence, ethics, and the past might shape your worldview and inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosities, how might exploring the evolution of ideas or analyzing historical events shape your understanding of contemporary societal challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical event or philosophical idea, how do you see exploring such topics shaping your worldview or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the ethics of historical events, and how might exploring such inquiries shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, what aspects of questioning reality, ethics, or historical events excite you to explore their deeper connections in your future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think exploring the 'big questions' of existence and analyzing past events might shape your worldview or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the foundations of your own beliefs or been fascinated by how past events continue to shape our present?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosities, how do you think exploring the evolution of ideas or societal events might shape your worldview or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, how do you think exploring the evolution of ideas and societies might shape your perspective on life and inform your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the meaning of life, and how might exploring such inquiries shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the ethics of historical events, and how might exploring such inquiries shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical event or philosophical idea, how do you think exploring the 'why' behind human actions and societies might shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the meaning of life, and how might exploring these ideas shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosities, how might exploring the evolution of ideas and past societies shape your perspective on current global challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, how do you think exploring the evolution of ideas and societies might shape your perspective on contemporary challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical event or philosophical idea, how do you see exploring such topics shaping your perspectives or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical figure's decisions, what philosophical questions about morality or justice would you explore to better understand their choices?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, how do you see exploring life's big questions and historical events shaping your perspective or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosities, how might exploring life's fundamental questions or analyzing past events shape your future perspectives or career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you encountered moments where questioning assumptions or exploring the past helped you better understand yourself or society?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, can you share an experience where questioning assumptions or exploring the past sparked your desire to understand human thought and societies?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the foundations of your beliefs or explored how past events shape our present, and how might this curiosity influence your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the meaning of life, and how might exploring such inquiries shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or philosophical concept, how do you see exploring such topics shaping your perspective on life and decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share a moment when questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you encountered a moment where questioning a long-held belief or historical event sparked your curiosity, and how did you explore it further?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think exploring the fundamental nature of reality and analyzing past events can shape your perspective on future challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the meaning of life, and if so, how do you think exploring these ideas could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosities, what aspects of exploring fundamental human questions or analyzing past events excite you about shaping your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, what sparks your desire to explore the evolution of ideas and societies, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, how do you think exploring fundamental life questions or analyzing historical events could shape your perspective or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity about fundamental questions or historical events, how do you see exploring the 'why' behind human experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosities, how do you think exploring the roots of human thought and past societies might shape your worldview or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical event or philosophical idea, how do you think exploring such topics could shape your personal growth or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, how do you think exploring the evolution of ideas and past societies might shape your perspective or inform your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, can you share an example of how questioning assumptions or exploring the past has influenced your perspective on life?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think exploring the fundamental nature of reality and analyzing past events might shape your perspective on life?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the foundations of your beliefs or explored how past events shape our present, and if so, what sparked that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, can you share an experience where questioning assumptions or exploring the past sparked excitement for you?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, can you describe a moment when questioning fundamental truths or exploring past events deeply intrigued you, and why it sparked your interest?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or philosophical idea that fascinates you and explain how exploring its 'why' or 'how' might shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the ethics of historical events, and how might exploring such inquiries shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, what sparks your desire to explore the evolution of ideas and societies, and how might this inquiry shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, what aspects of exploring fundamental life questions or analyzing past events excite you about shaping your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical event or philosophical idea, how do you see exploring such topics shaping your perspective or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, which historical event or philosophical idea sparks your desire to understand human experiences and societal progress?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the meaning of life, and how might exploring these ideas shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the meaning of life, and how might exploring these ideas shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the ethics of historical events, and how might exploring these questions shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, can you share an experience where questioning assumptions or exploring the past sparked excitement for you?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you encountered a historical event or philosophical idea that challenged your perspective, and how did exploring it impact your thoughts on life or society?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical figure's decisions, how would studying the 'why' behind their actions shape your understanding of human behavior and inform your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the foundations of your beliefs or been fascinated by how past events shape our present?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you encountered a moment where questioning assumptions or exploring the past helped you better understand yourself or society, and why was that meaningful?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite book or historical event, how do you think exploring the 'why' behind human actions and societies could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the ethics of historical events, and how might exploring such inquiries shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity about fundamental life questions or historical events, how do you see exploring these themes shaping your future perspectives or career?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the meaning of life, and how might exploring such inquiries shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think exploring the origins of ideas and societies can shape your perspective on contemporary challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think exploring the fundamental nature of reality and analyzing past events can shape your perspective on life?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, what draws you to exploring fundamental questions about existence, morality, or historical events, and how might this shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, what sparks your desire to explore fundamental questions about existence, human experience, and the lessons of the past?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, how do you think exploring the evolution of ideas and societies can shape your perspective or inform your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share a moment when questioning assumptions or exploring the past sparked your curiosity, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical event or philosophical idea, how do you think exploring such topics in depth could shape your future perspectives or career?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosities, how do you see exploring the evolution of ideas and past societies enriching your perspective on life and decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical event or philosophical idea, how do you think exploring such topics in-depth could shape your personal growth or career path?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you encountered moments where questioning assumptions or exploring past events sparked your curiosity, and how might such inquiries shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical event or philosophical idea, how do you see exploring such topics shaping your perspective on life and society?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, how do you think exploring big questions about existence, ethics, and the past might shape your worldview or career path?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity about big questions, how might exploring the evolution of ideas and societies shape your understanding of yourself and the world?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the meaning of life, and how might exploring such inquiries shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your own life experiences, how do you think exploring the 'why' behind historical events or questioning fundamental beliefs might shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever questioned the origins of societal norms or debated the ethics of historical events, and how might exploring these questions shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your curiosity, what draws you to exploring fundamental questions about existence, morality, or the past, and how might this inquiry shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing past events helped you better understand a complex issue or make a more informed decision?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example of how questioning assumptions or analyzing historical events has influenced your perspective on a contemporary issue?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand a complex issue or yourself?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or challenging a common belief helped you grow, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "How do you think studying the evolution of ideas and historical events can help you critically evaluate the complexities of modern societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or challenging beliefs led to personal growth, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you better understand a complex issue or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing conflicting historical accounts or philosophical viewpoints has influenced your decision-making or broadened your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "How do you think examining the past and questioning fundamental truths can help you navigate complex, real-world problems in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or challenging a common belief led to a deeper understanding of yourself or a historical event?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "How do you think studying the evolution of ideas and past events can shape your critical thinking and inform your decisions in an uncertain future?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example of a time when questioning assumptions or exploring different perspectives helped you navigate a challenging situation or decision?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "How do you think studying the evolution of ideas across time could shape your critical thinking and inform your decisions in an uncertain future?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "How do you think studying the past and questioning fundamental truths can shape your perspective on contemporary issues and inform your future decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or challenging prevailing beliefs led to a deeper understanding of a historical event or personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you navigate a challenging situation or shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you navigate a complex situation or shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing past events helped you better understand a complex issue or make a more informed decision?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you better understand a complex issue or make a more informed decision?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you better understand a current issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you walk me through a time when questioning assumptions or analyzing the past helped you make a more informed decision?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or challenging conventional wisdom helped you grow, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example from your studies or personal experiences where critically analyzing assumptions or historical?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you navigate a complex decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you walk me through a time when questioning assumptions or analyzing the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you make a decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you make a decision, and how did it impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example of how questioning assumptions or challenging beliefs has influenced your perspective, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you better understand a current issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example of a time when questioning assumptions or analyzing the past helped you navigate a challenging situation or decision?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you make a more informed decision, and how did that impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a time when questioning assumptions or exploring different perspectives helped you navigate a complex issue or decision?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you navigate a challenging decision or conversation?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or challenging prevailing beliefs led to personal growth or a new perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you make a decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you make a more informed decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you walk me through a moment when questioning assumptions or challenging beliefs led to a deeper understanding of yourself or a historical event?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you make a decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or challenging prevailing beliefs led to a deeper understanding of a historical event or personal belief?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example from your life where questioning assumptions or analyzing past events helped you gain a deeper understanding of a complex issue?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or challenging beliefs led to personal growth, and how might this skill serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or challenging a common belief led you to a new understanding, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "How do you think studying the evolution of ideas and historical events can help you navigate complex moral dilemmas in your future personal or professional life?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you walk me through a moment when questioning assumptions or challenging a widely accepted belief led to a significant shift in your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you better understand a complex issue or yourself?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you navigate a challenging situation or decision?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or challenging a common belief led to a deeper understanding of yourself or a historical event?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example of a personal experience where questioning assumptions or challenging prevailing beliefs led to a deeper understanding of yourself or society?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you make a decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "How do you think studying the evolution of historical ideas can help you develop critical thinking skills for navigating complex modern societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "How do you think exploring the evolution of ideas across cultures and centuries might shape your critical thinking and inform your decisions in life?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you make a decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you navigate a complex situation or shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "How do you think studying the evolution of ideas and past events can help you better navigate and understand the complexities of modern society?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you navigate a complex situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you navigate a complex situation or shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you navigate a challenging decision or conversation?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or challenging a common belief helped you grow, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example of a time when questioning assumptions or challenging prevailing beliefs led you to a deeper understanding of a historical event or personal experience?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a time when questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you make a decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you walk me through a moment when questioning assumptions or exploring historical?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you navigate a challenging situation or decision?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example of how questioning assumptions or analyzing historical events has influenced your perspective on a contemporary issue?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you navigate a complex decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you make a more informed decision or changed your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you make a more informed decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you walk me through a time when questioning assumptions or challenging prevailing beliefs led to a deeper understanding of a historical event or personal belief?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example of how questioning assumptions or analyzing historical events has influenced your perspective on a contemporary issue?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example of how questioning assumptions or analyzing past events has helped you better understand a complex issue or made a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring different perspectives helped you navigate a challenging decision or conversation?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a time when questioning assumptions or exploring the past helped you navigate a complex issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you walk me through a time when questioning assumptions or challenging prevailing beliefs led to a deeper understanding of a historical event or personal experience?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "How do you think studying the evolution of ideas and past societies can help you navigate complex modern challenges in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you make a decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you better understand a complex issue or yourself?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing conflicting perspectives on a historical event has influenced your own critical thinking or decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring historical?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you make a more informed decision about your future?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you walk me through a time when questioning assumptions or challenging a common belief helped you grow, and how might this skill serve you in exploring foundational ideas?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or analyzing the past helped you navigate a challenging situation or decision, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring different perspectives helped you better understand a historical event or personal challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or challenging norms led to a deeper understanding of a historical event or personal belief?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you better understand a complex issue or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a time when questioning assumptions or exploring the past helped you better understand a complex issue or yourself?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you make a more informed decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example from your life where questioning assumptions or analyzing the past helped you make a more informed decision?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an example of how questioning assumptions or analyzing historical events has influenced your perspective on a current issue?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or analyzing the past helped you make a decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you walk me through a time when questioning assumptions or analyzing the past helped you better understand a complex issue or personal challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or challenging conventional wisdom helped you grow, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or a complex issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or a complex issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you ever challenged a widely accepted belief or explored the historical roots of a current issue - how did that shape your thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflect on a moment you questioned a long-held belief; how did this experience shape your critical thinking and curiosity about the past?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or a complex issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or a complex issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand a current issue or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or a complex issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or a complex issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand a complex issue or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflecting on your past, can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Have you encountered moments where questioning assumptions or exploring past events deeply impacted your decisions or worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflect on a time when questioning assumptions or exploring the past sparked your curiosity - how did this shape your perspectives or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring big questions or analyzing the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or a complex issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand a current issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or your own beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or a complex issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflect on a time you questioned a common belief or tradition; how did this experience shape your critical thinking and curiosity about the past?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or a complex issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand a complex issue or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you share an experience where questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Reflect on a moment when questioning assumptions or exploring the past sparked your curiosity - how did this shape your views or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Philosophy and History",
    "school": "NTU",
    "question": "Can you describe a moment when questioning assumptions or exploring the past helped you better understand yourself or the world around you?",
    "criterion": "Experiences"
  }
]