[
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you ever wondered how everyday phenomena connect to global energy challenges, and how exploring these questions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or solving an energy-related problem sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Reflect on a time you explored a scientific concept or solved a real-world problem. How did it spark your curiosity, and could you see yourself dedicating to similar pursuits long-term?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or solving an energy-related problem sparked your curiosity, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the 'why' behind a natural phenomenon, and how did that spark your curiosity about energy's role in our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a real-life energy challenge that sparked your curiosity for further discovery?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a scientific concept that sparked your curiosity about energy and its impact on society?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or topic that sparked your curiosity about how energy shapes our daily lives or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a real-life energy challenge that sparked your curiosity and desire to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a real-life energy challenge that sparked your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or thought that sparked your curiosity about the natural world, and how might exploring energy and its applications shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a scientific concept that sparked your curiosity about how things work?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you ever wondered how renewable energy solutions could transform daily life, and how would you contribute to this transformation in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how energy shapes our daily lives or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share a moment when you marveled at the natural world or a scientific phenomenon, and how it sparked your curiosity about energy or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share a moment when you wondered about the natural world or energy's role in society, and how might studying this topic shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explored the natural world or a scientific concept, and how it sparked your curiosity about energy or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how energy shapes our daily lives or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a real-life energy challenge that sparked your curiosity about how things work?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share a moment when you explored the natural world or energy systems, sparking curiosity in you, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored how energy transforms or impacts daily life, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Could you share how exploring the natural world or addressing energy challenges might shape your future goals or spark personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how the universe works or the role of energy in our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share a moment when you wondered about the natural world, and how exploring such curiosities might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or thought that sparked your curiosity about the natural world, and how might exploring energy systems shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or hobby that sparked your curiosity about how energy shapes our daily lives or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the connection between scientific principles and real-world energy challenges, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or topic that sparked your curiosity about how energy shapes our daily lives or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or energy-related issues sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or energy-related issues sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a moment that sparked your curiosity about how things work around you?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how energy shapes our daily lives or the environment, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or solving an energy-related problem sparked your curiosity, and how might this shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or curiosity that sparked your interest in understanding the natural world or solving energy-related challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you were curious about how energy shapes our daily lives, and how you explored that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a real-life energy challenge that sparked your curiosity about how things work?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the natural world or solving an energy-related problem sparked your curiosity, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how energy shapes our daily lives or the natural world?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how energy shapes our daily lives or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you ever wondered how everyday phenomena, like energy efficiency or renewable resources, could shape your future career or impact daily life?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Could you share an experience or topic that sparked your curiosity in understanding how the universe works or solving energy-related challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you were curious about how the natural world works, and how exploring that curiosity might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you ever wondered how the laws of physics can be harnessed to address global energy challenges, and how would you contribute to this effort?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the 'why' behind a natural phenomenon, and how did that spark your curiosity about the world?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or thought process where you explored how energy transforms our daily lives, sparking your curiosity about its underlying physics principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring how things work or solving an energy-related problem sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or curiosity that sparked your fascination with the natural world, and how might exploring energy systems further ignite this passion?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how might exploring energy systems further ignite that passion?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored how energy impacts daily life, and how might that curiosity guide your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how energy shapes our daily lives or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world, and how it sparked your curiosity about the interconnectedness of energy and our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you ever wondered how energy shapes our daily lives, and how you might contribute to a more sustainable future through scientific exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how might exploring energy and its impact on society further ignite your passions?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or energy-related issues sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a scientific concept, and how it sparked your curiosity about the universe or sustainable energy solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've explored the natural world, and how further study of energy and its impact might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share a moment when you wondered how something in the natural world works, and how exploring its energy aspects might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share a moment when you wondered how everyday phenomena work, and how exploring such curiosities might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or thought process where you connected everyday phenomena to underlying scientific principles, sparking your curiosity about energy or the physical world?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or energy systems, and how it sparked your curiosity about their underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a scientific concept, and how it sparked your curiosity about energy or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or solving an energy-related problem sparked your curiosity, and how might this passion guide your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored how energy impacts daily life, and how might that curiosity guide your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how energy shapes our daily lives or the natural world?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or idea that sparked your curiosity about the natural world, and how might exploring energy and its impact on society further ignite your passions?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored how energy shapes our daily lives, and how would you contribute to sustainable solutions in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring the natural world or energy-related topics sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring how things work or solving an energy-related problem sparked your curiosity, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or thought that sparked your curiosity about how energy shapes our daily lives or the world's future challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring energy or the natural world sparked your curiosity, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or solving an energy-related problem sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a real-life energy challenge that sparked your curiosity about how things work?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or solving an energy-related problem sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or topic that sparked your curiosity about how energy shapes our daily lives or the environment, and why it fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you ever wondered how energy shapes our daily lives, and how you could contribute to sustainable solutions for future generations?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how might exploring energy solutions shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how energy shapes our daily lives or the natural world?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or solving an energy-related problem sparked your curiosity, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Could you share how exploring the fundamental laws of nature or developing sustainable energy solutions might align with your future aspirations or spark personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or topic related to energy or the environment that sparks your curiosity, and how might exploring it further impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how the natural world works, and how you see this driving your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a real-life problem that sparked your curiosity about energy or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or thought that sparked your curiosity about how energy shapes our daily lives or the world's future challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a real-life energy challenge that sparked your curiosity about its underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explored how energy transforms our daily lives, and how it sparked your curiosity about its underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or topic that sparked your curiosity about how energy shapes our daily lives or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or solving an energy-related problem sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Could you share an experience where exploring the natural world or solving an energy-related problem sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or solving an energy-related problem sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or topic that sparked your curiosity about how energy shapes our daily lives or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about how energy shapes our daily lives or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Could you share an experience or thought that sparked your curiosity about how energy shapes our daily lives or the world's future challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored how energy transforms our daily lives, sparking your curiosity to learn more about its underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or energy-related issues sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or solving an energy-related problem sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the natural world or solving an energy-related problem sparked your curiosity, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the natural world or a moment that sparked your curiosity about how energy shapes our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or thought that sparked your curiosity about how energy shapes our daily lives or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored how energy impacts daily life, and how would you contribute to sustainable solutions in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you wondered how something in the natural world worked, and how did that spark your curiosity about energy or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your interest in energy or environmental issues?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored a scientific concept, like energy transformation, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a scientific concept, like energy or motion, to someone else, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that shape your interest in exploring energy-related challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you observed an energy-related issue in daily life and thought about how you might contribute to a sustainable solution?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a complex scientific concept, like energy conservation, to someone with little prior knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied scientific principles to solve a real-world problem, and how it sparked your curiosity about energy or the environment?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you applied logical reasoning to solve a complex problem, and how did that experience shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did it spark your curiosity about energy or the environment?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a complex scientific concept, like energy conservation, to someone with little prior knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a scientific concept to others, and how did that experience shape your interest in teaching or sharing knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a scientific concept, like energy conservation, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a complex scientific concept, like energy transformation, in a creative way to others?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your interest in pursuing a field that combines science with societal impact?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied logical thinking to understand a complex natural phenomenon, and how it sparked your curiosity about the world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that shape your curiosity about energy or the environment?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you observed energy in action, and how did that spark your curiosity about its role in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a complex scientific concept, like energy transformation, in a creative way to others?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you observed an energy-related problem, and how you would approach understanding or solving it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did it spark your curiosity about energy or the environment?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical thinking to solve a complex problem, and how did that shape your interest in understanding the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you observed an energy-related problem, and how you would approach designing a simple, innovative solution to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you observed a real-life energy transformation and explain how understanding its physics could impact sustainable solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied logical thinking to solve a complex problem, and how it sparked your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that shape your interest in pursuing a field that combines science with societal impact?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored a scientific concept, like energy conversion, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a complex scientific concept, like energy conversion, in a creative way to others?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did it spark your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you observed an energy-related problem in daily life and brainstormed a potential solution, even if it was just theoretical?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did it spark your curiosity about energy or the environment?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical application of scientific principles, and how it sparked your curiosity about energy or environmental challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explored or explained a complex scientific concept, like energy conservation, in a creative way to others?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that impact your interest in pursuing science-related studies?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you applied scientific principles to solve a real-life problem, and how did that experience shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did it spark your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you observed an energy-related problem, and how would you approach designing a simple solution using basic physics principles?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored the science behind everyday phenomena, and how did that experience shape your curiosity about energy and its impact on society?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your interest in pursuing a field that combines science with societal impact?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the connection between scientific principles and real-world energy challenges, and how did that spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your interest in pursuing related studies?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you observed an everyday energy-related problem and brainstormed innovative solutions, even if you couldn't implement them?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a scientific concept to others, and how did that experience shape your interest in energy or education?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you observed an everyday energy-related challenge and brainstormed a creative solution, even if it didn't work as planned?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you observed energy transformation in daily life and how it sparked your curiosity to learn more?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your interest in pursuing a field that combines science with everyday life challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a scientific concept, and how would you adapt your approach for different audiences?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied scientific principles to solve a real-world problem, and how did this experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you applied logical thinking to solve a complex problem, and how did that experience spark your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that shape your interest in pursuing a field that combines science with societal impact?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did it spark your curiosity about energy or the environment?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you observed a natural phenomenon and tried to explain its underlying principles, sparking your curiosity to learn more?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a complex scientific concept, like energy transformation, to someone with little background in the subject?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied scientific principles to solve a real-life problem, and how it sparked your curiosity about energy or the environment?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a complex scientific concept, like energy conservation, in a creative way that engaged others?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you applied scientific principles to solve a real-world problem, and how did that experience shape your curiosity about energy and its impact on society?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you applied scientific principles to solve a real-world problem, and how did that experience shape your curiosity in energy or environmental issues?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you observed an energy-related problem in daily life and brainstormed a creative solution, even if you couldn't implement it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you observed an everyday energy-related challenge, and how you would approach solving it creatively?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a complex scientific concept, like energy transformation, in a creative way to others?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a complex scientific concept, like energy conservation, in a creative way to others?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning to understand a complex natural phenomenon, and how did that shape your curiosity about the physical world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did it spark your curiosity about energy or the environment?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did it spark your curiosity about energy systems?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you observed an energy-related issue in daily life and how you might approach understanding its underlying physics principles?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a complex scientific concept, like energy conversion, to someone with little prior knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you observed an energy-related challenge in daily life and brainstormed potential solutions, even if you didn't act on them?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored the practical applications of physics in everyday life, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explored the connection between everyday phenomena and scientific principles, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you observed an energy-related problem in daily life and brainstormed innovative solutions, even if not fully developed?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that impact your interest in pursuing science further?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you applied scientific principles to solve a real-world problem, and how did that experience shape your curiosity about energy and its impact on society?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied scientific principles to solve a real-life problem, and how did that experience shape your curiosity about energy and its impact on society?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied scientific principles to solve a real-life problem, and how did that experience shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you observed an energy-related challenge in daily life and brainstormed a creative solution, even if it wasn't implemented?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a complex scientific concept, like energy transformation, in a creative way to others?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that shape your interest in pursuing a field that combines science with societal impact?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored a complex scientific concept on your own, and how did that experience shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you observed an energy-related problem, and how would you approach designing a sustainable solution for it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied scientific principles to solve a real-life problem, and how it sparked your curiosity in energy or the environment?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored a scientific concept, like energy conversion, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning to solve a complex problem, and how did that shape your approach to understanding the world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored a scientific concept, like energy or motion, and how it sparked your curiosity for further learning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that shape your interest in pursuing a field that combines science with societal impact?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your interest in pursuing a field that combines science with societal impact?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you applied scientific principles to solve a real-life problem, and how did that experience shape your curiosity in energy or environmental issues?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explored the 'why' behind a natural phenomenon, and how did that experience spark your curiosity about the world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did it spark your curiosity about energy and its impact?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that shape your interest in pursuing a field that combines science with societal impact?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that shape your interest in exploring energy-related challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did that shape your interest in pursuing a field that combines science with societal impact?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a scientific concept to others, and how did that experience shape your interest in teaching or sharing knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored a scientific concept, like energy transformation, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored a scientific concept or phenomenon that sparked your curiosity, and how did you deepen your understanding of it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-life problem, and how did it impact your understanding of energy in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you applied scientific principles to solve a real-life problem, and how did this experience shape your curiosity in energy or environmental issues?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did that shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you observed an energy-related challenge in daily life and brainstormed a creative solution, highlighting your analytical skills?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you observed energy in action, and how would you explain the underlying physics to a curious younger student?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you applied scientific principles to solve a real-world problem, and how did it spark your curiosity about energy systems?",
    "criterion": "Skills"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or considered how energy solutions impact our future?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or contributed to energy conservation efforts?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific concepts to understand energy-related issues, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles, and how it sparked your curiosity about the natural world or sustainability?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or solved a real-world energy-related problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or environmental sustainability, and what sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of science, and how it sparked your curiosity about energy or the environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or considered how energy solutions impact our future?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues or phenomena in your daily life?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in daily life or solved an energy-related problem, and what sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy transformations, and how did that spark your curiosity for further learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or solved a problem related to energy conservation?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related phenomena or solve a real-world problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or the environment, and how it sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues or real-world phenomena?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in daily life or addressed an energy-related challenge, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related phenomena, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of science in everyday life, and how it sparked your curiosity about energy or the environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or considered how energy solutions impact our future?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of science, and how it sparked your curiosity about energy or the environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or contributed to promoting energy awareness in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored or explained scientific concepts, like energy transformations, in creative ways that sparked curiosity in others or yourself?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explored or explained a scientific concept, and how it sparked your curiosity about the natural world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles, and how it sparked your curiosity about energy or the physical world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy transformations, and how did that impact your curiosity about related fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you explored or been involved in projects that combine science learning with real-world energy challenges, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or considered how energy solutions impact our future?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy transformations or environmental challenges in your daily life?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or considered how energy solutions impact our future?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy transformations, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of science, and how it sparked your curiosity about energy or the environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explored or explained a scientific concept, like energy transformation, that sparked your curiosity about its real-world applications?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explored or explained a scientific concept, and how it sparked your interest in its real-world applications?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy transformations, and how did that impact your curiosity about related fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related phenomena, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or addressed energy-related challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or sustainability, and what sparked your curiosity about energy systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or the environment, sparking your curiosity about energy solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you explored or been involved in projects that made you curious about how energy shapes our daily lives or future innovations?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when exploring scientific concepts, like energy or the environment, sparked your curiosity and influenced your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did it spark your curiosity for further learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific concepts to understand energy-related issues, and how did it shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explored or explained a scientific concept, and how did that experience shape your interest in learning or teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or considered how energy impacts our global community?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in daily life or solved a real-world energy-related problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and what sparked your curiosity in this area?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a scientific concept, like energy transformation, that sparked your curiosity or helped others learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you ever designed or participated in a project that applies scientific principles to solve real-world energy or environmental challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored or experimented with renewable energy sources, and how do you think this relates to your future goals or everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did that impact your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or addressed an energy-related challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a scientific concept, like energy transformation, that sparked curiosity in yourself or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you explored or would you enjoy learning how energy transformations impact daily life, and can you share an experience that sparked this curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or considered how energy solutions impact our future?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or considered how energy solutions impact our future?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and what sparked your curiosity in this area?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a scientific concept, like energy transformation, that sparked your curiosity or helped others learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related phenomena, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific concepts to understand energy-related issues, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in daily life or solved a problem related to energy efficiency?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Have you explored or would you enjoy learning about the practical applications of physics in addressing real-world energy challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or solved a problem related to energy efficiency?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or solved a problem related to energy efficiency?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or considered how energy impacts our daily world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related phenomena, and how it sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related phenomena or solve everyday problems?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related phenomena, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific concepts to address a real-world energy challenge, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in daily life or solved a real-world energy-related problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or considered how energy impacts our daily world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or contributed to promoting energy awareness in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of science, and how it sparked your curiosity about energy or the environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or solved a real-world energy-related challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy transformations, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the connection between scientific principles and real-world energy challenges, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or contributed to promoting energy awareness in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of science, and how it sparked your curiosity about energy or environmental issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues or phenomena in your daily life?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or contributed to energy conservation efforts?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the connection between science and everyday life, and how it sparked your curiosity about energy or the physical world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and what sparked your curiosity in this area?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of science in everyday life, and how did that spark your curiosity about energy or the environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles, and how did it spark your curiosity about the world's energy challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or solving real-world energy challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related phenomena or real-world challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored the practical applications of physics in everyday life or solved a real-world energy-related problem?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explored or explained a scientific concept, and how it sparked your interest in teaching or sharing knowledge with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific concepts to understand energy-related issues, and what sparked your curiosity in this area?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics & Energy Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied scientific principles to understand energy-related issues, and how did it spark your curiosity?",
    "criterion": "Experiences"
  }
]