[
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how might exploring this fascination shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you were curious about how something in the natural world worked, and how did that spark your desire to explore deeper?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about how something in the natural world worked, and how did you explore that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you were fascinated by how something in the natural world worked, and how did you explore that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about how something in the natural world worked, and how did you explore that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were fascinated by how something in the natural world works, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Could you share an everyday phenomenon that sparks your curiosity, and how would you approach understanding its underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where exploring the 'why' behind a natural phenomenon sparked your curiosity, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Could you share an experience or moment that sparked your curiosity about how the natural world works, and how you think exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you found yourself curious about how the natural world works, and how you explored that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about the natural world, and how might exploring its fundamental laws shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where observing a natural phenomenon sparked your curiosity, and how you explored its underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an everyday phenomenon that sparks your curiosity, and how you'd approach uncovering the underlying physical principles at play?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you wondered about the natural world, and how exploring its underlying principles might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about the natural world, and how exploring it might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or curiosity that sparked your fascination with understanding how the natural world works, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever wondered how everyday phenomena work, and can you share an example of something that sparked your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about how the natural world works, and how you see this driving your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you marveled at a natural phenomenon and felt driven to understand its underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you wondered how something in the natural world worked, and how did that spark your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever wondered how the universe works, and how exploring its fundamental laws might shape your future pursuits or daily life?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you marveled at a natural phenomenon and felt driven to understand its underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you were curious about how something in the natural world works, and how did you explore that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you wondered how something in the natural world worked, and how did that spark your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored the 'why' behind a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you were fascinated by how the natural world works, and how might exploring such phenomena shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you were curious about how something in the natural world works, and how did you explore that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever encountered a natural phenomenon that sparked your curiosity, and how do you think studying the underlying principles could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you were fascinated by how the natural world works, and how might exploring such curiosities shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you were fascinated by how something in the natural world works, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever found yourself questioning how everyday phenomena work, and how exploring these curiosities might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an everyday phenomenon that sparked your curiosity, and how would you go about uncovering the underlying physical principles at play?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when exploring the natural world sparked your curiosity, and how you think studying its fundamental laws could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how might exploring this fascination shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where observing a natural phenomenon sparked your curiosity, and how you explored its underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity about the natural world led you to explore or question something, and how did that spark further interest in you?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about how something in the natural world worked, and how you explored that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how do you see yourself exploring this fascination further?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored the 'why' behind a natural phenomenon, and how did that spark your curiosity about the physical world?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you were curious about how something in the natural world worked, and how did you explore that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever wondered how the natural world works, and can you share an experience where exploring these mysteries sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about the natural world, and how might exploring this further shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Could you share an experience where exploring the natural world sparked your curiosity, and how might this relate to your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how you think studying it further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an everyday phenomenon that fascinates you, and how you think understanding its underlying principles could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how do you see yourself exploring this fascination further?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Could you share an example of how observing a natural phenomenon sparked your curiosity, and how you think studying its underlying principles could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Could you share an everyday phenomenon that fascinates you, and how understanding its underlying principles might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored how things work, and how might that curiosity drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever wondered how the universe works, and can you share an experience where exploring the 'why' behind a natural phenomenon sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you were curious about how something in the natural world works, and how did you explore that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were fascinated by how something in the natural world worked, and how did you explore that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever wondered how the universe works, and how exploring its fundamental laws might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever found yourself curious about the fundamental laws governing the universe, and how exploring these might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about the natural world, and how do you see yourself exploring these interests further?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever wondered how everyday phenomena work, and how exploring these curiosities might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how might exploring its fundamental laws shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about how something in the natural world works, and how did you explore that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you were curious about how something in the natural world worked, and how did you explore that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the natural world sparked your curiosity, and how you see this driving your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how might exploring this fascination shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an everyday phenomenon that sparks your curiosity, and how would you approach understanding its underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the natural world sparked your curiosity, and how might pursuing this fascination shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the natural world sparked your curiosity, and how you think studying the fundamental laws of the universe could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about how something in the natural world worked, and how did you explore that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever wondered how the universe works, and can you share an experience where exploring a scientific concept sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about the natural world, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where exploring the 'why' behind a natural phenomenon sparked your curiosity, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or curiosity that sparked your fascination with understanding the fundamental laws of the universe?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you marveled at a natural phenomenon and felt driven to understand its underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about how something in the natural world worked, and how did you explore that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity about the natural world led you to explore or question something, and how did that shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how might exploring its fundamental laws shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how might exploring these phenomena shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you wondered how something in the natural world worked, and how did you go about exploring that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever wondered how everyday phenomena work, and how understanding these principles could shape your future pursuits or daily life?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how do you see yourself exploring these interests further?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about the natural world, and how might exploring this further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were fascinated by how something in the natural world works, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an everyday phenomenon that sparks your curiosity, and how would you go about investigating its underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an everyday phenomenon that sparked your curiosity, and how would you go about understanding its underlying scientific principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were fascinated by how something in the natural world works, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you marveled at a natural phenomenon, and how it sparked your curiosity to understand the underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or curiosity that sparked your fascination with understanding how the natural world works, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where exploring the 'why' behind a natural phenomenon sparked your curiosity, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about how the natural world works, and how you see this driving your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever found yourself curious about the underlying principles of natural phenomena, and how exploring these might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or moment that sparked your curiosity about the natural world, and how do you see yourself exploring these interests further?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share a moment when you wondered how something in the natural world worked, and how did that curiosity drive you to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about how something in the natural world works, and how you explored that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever wondered how everyday phenomena work, like the motion of a spinning top or the colors of a sunset, and wanted to explore their underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where observing a natural phenomenon sparked your curiosity, and how you explored its underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored the 'why' behind a natural phenomenon, and how it sparked your curiosity about the underlying principles?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about the natural world, and how might exploring its fundamental laws shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever wondered how everyday phenomena work, and can you share an example of something that sparked your curiosity about the natural world?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about how something in the natural world worked, and how did that spark your desire to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about how something in the natural world worked, and how did you explore that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience or discovery that sparked your curiosity about the natural world, and how might exploring this fascination shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Have you ever wondered how the universe works, and can you share an experience where exploring such questions sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where exploring the 'why' behind a natural phenomenon sparked your curiosity, and how might this drive your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing natural phenomenon and walk me through how you would systematically investigate its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you broke down a complex problem into manageable parts to understand its underlying principles?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you applied logical reasoning to solve a complex problem, and how did that shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you observed a natural phenomenon and tried to explain its underlying mechanisms, even if you weren't entirely sure?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you explored a complex scientific concept, like motion or energy, just for the fun of it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach explaining a complex phenomenon, like the motion of a roller coaster, to a curious middle schooler?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to understand a complex phenomenon, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you broke down a complex problem into manageable parts, and how did that process deepen your understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you observed an intriguing natural phenomenon and tried to explain its underlying principles?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you explored a complex scientific concept on your own, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you explored a scientific concept out of curiosity, and how did that experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you observed a natural phenomenon and tried to explain its underlying principles, even if you didn't know the exact science behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through how you would approach solving a complex problem in mechanics, highlighting your analytical and critical thinking skills?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used logical reasoning to understand a complex phenomenon, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when curiosity drove you to explore the 'why' behind a natural phenomenon, and how did you seek answers?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when curiosity led you to explore a complex problem, and how did you systematically break it down to find a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing natural phenomenon and tried to explain its underlying principles using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you broke down a complex problem, like explaining a natural phenomenon, to its fundamental principles?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience spark your curiosity in understanding the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing natural phenomenon and walked us through how you would systematically investigate its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you observed a natural phenomenon and tried to explain its underlying mechanisms, even if you didn't know the exact physics involved?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you explored a complex natural phenomenon, and how would studying its underlying principles shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you explored a complex scientific concept on your own, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing natural phenomenon and walk me through how you would systematically investigate its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach explaining a complex scientific concept, like gravity, to a peer who's struggling to grasp it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you broke down a complex problem into manageable parts - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you broke down a complex problem into simpler parts to understand it better?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you observed a natural phenomenon and tried to explain its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience spark your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you broke down a complex problem into simpler parts to understand it better?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when curiosity drove you to explore the 'why' behind a natural phenomenon, and how did you seek answers?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing natural phenomenon and tried to explain its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through how you'd approach explaining a complex scientific concept, like black holes, to a curious middle-schooler?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you explored a complex concept in science, like the motion of everyday objects, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an example of how you've applied logical reasoning to solve a complex problem, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing natural phenomenon and tried to explain its underlying principles, even if you didn't fully understand them?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you explored or explained a complex scientific concept, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you explored a complex scientific concept on your own? How did you stay motivated to understand it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes, even without prior knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you applied logical reasoning to solve a complex problem, and how did that shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an example of how you've applied logical reasoning to understand a complex phenomenon, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing natural phenomenon and tried to explain its underlying principles, even if you didn't know the exact answer?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you observed a natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you explored or explained a complex phenomenon, like a natural event, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you applied logical reasoning to understand a complex phenomenon, and how did that shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when curiosity drove you to explore the 'why' behind a natural phenomenon, and how did you investigate it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you observed a natural phenomenon and tried to explain its underlying principles, even if you didn't know the exact science behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying principles, even if you didn't know the exact science behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes, even without prior knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used analytical thinking to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used analytical thinking to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience spark your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed an everyday phenomenon and tried to explain its underlying scientific principles to someone else?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing natural phenomenon and walked me through how you would systematically investigate its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes, even without prior knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing natural phenomenon and walk me through how you would systematically investigate its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore the 'why' behind a natural phenomenon, and how did you investigate it?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you applied logical reasoning to solve a complex problem, and how did that shape your approach to understanding the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you applied logical reasoning to solve a complex problem, and how did that shape your curiosity in understanding the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience spark your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored a complex concept, like motion or energy, and how it sparked your curiosity about the natural world?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed a natural phenomenon and tried to explain its underlying causes using logical reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you used analytical thinking to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a time when you observed an intriguing natural phenomenon and tried to logically explain or investigate its underlying causes?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you walk me through a time when you applied logical reasoning to solve a complex problem, and how did that experience shape your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a complex natural phenomenon, and how it sparked your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and what sparked your curiosity in that moment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore or explain a natural phenomenon, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore the 'why' behind a natural phenomenon, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored the 'why' behind a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you explored or explained a complex natural phenomenon, and how did that experience spark your curiosity about the physical world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a complex phenomenon, and how did that spark your curiosity about the natural world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how it sparked your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore or explain a natural phenomenon, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored the 'why' behind a natural phenomenon, and how did that spark curiosity in you?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles in your daily life, sparking curiosity about the natural world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when curiosity drove you to explore or explain a natural phenomenon, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles in your daily life, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and what sparked your curiosity in that moment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore the 'why' behind a natural phenomenon, and how did that shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles in your daily life, sparking your curiosity about the natural world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a complex natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the physical world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and what sparked your curiosity in that moment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore or explain a natural phenomenon, and how did that impact your learning journey?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and what sparked your curiosity in that moment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the natural world sparked your curiosity, and how did that experience influence your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the natural world sparked your curiosity, and how did you seek to understand the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles in a hands-on way, and how did it spark your curiosity about the natural world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a complex natural phenomenon, and how did that spark your curiosity about the physical world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how it sparked your curiosity about the fundamental laws of the universe?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles in a hands-on way, and how it sparked your curiosity about the natural world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing natural phenomenon and tried to explain or understand its underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore the 'why' behind a natural phenomenon, and how did that shape your learning approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore or explain a natural phenomenon, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a complex natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you explored or explained a complex natural phenomenon, and how did that experience shape your curiosity about the physical world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore the 'why' or 'how' behind a natural phenomenon, and what did you discover?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when curiosity drove you to explore or explain a natural phenomenon, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and what sparked your curiosity in that moment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how it sparked your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored the 'why' behind a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and how did that shape your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore the 'why' behind a natural phenomenon, and how did that shape your understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored the 'why' behind a natural phenomenon, and how it sparked your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and what sparked your curiosity in that moment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore the 'why' behind a natural phenomenon, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles in your daily life, sparking curiosity about the natural world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored the 'why' behind a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a complex natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and what sparked your curiosity in that moment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the physical world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored the 'why' behind a natural phenomenon, and how it sparked your curiosity to learn more?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when curiosity about the natural world led you to explore or experiment, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and how did that shape your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and what sparked your curiosity in that moment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when curiosity drove you to explore or explain a natural phenomenon, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and what sparked your curiosity in that moment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles in your daily life, sparking your curiosity about the natural world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored the 'why' behind a natural phenomenon, and how did that spark your curiosity about the physical world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore the 'why' behind a natural phenomenon, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how it sparked your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the physical world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing natural phenomenon and tried to explain its underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and what sparked your curiosity in that moment?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and how did that shape your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore or explain a natural phenomenon, and how did that impact your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when curiosity drove you to explore the 'why' behind a natural phenomenon, and how did you investigate it?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore or explain a natural phenomenon, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where curiosity led you to explore the 'why' or 'how' behind a natural phenomenon, and what did you discover?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles in a hands-on way that sparked your curiosity about the natural world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how did that spark your curiosity about the physical world?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or applied scientific principles to understand a natural phenomenon, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored or explained a natural phenomenon, and how it sparked your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you share an experience where you explored the 'why' behind a natural phenomenon, and how did that spark your curiosity about the underlying principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Physics",
    "school": "NUS",
    "question": "Can you describe a moment when curiosity about the natural world led you to explore or experiment, and how did that experience shape your interests?",
    "criterion": "Experiences"
  }
]