[
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed a current event and thought about how political, legal, or economic systems could be improved, and why does that intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you observed how power, rules, or resources were allocated, and how it sparked your curiosity about their impact on society?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global events, how do you think understanding politics, law, and economics could empower you to drive meaningful change in your community?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example from current events that sparked your curiosity about how laws are made or economies are governed?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity in how societies are governed, laws are formed, or economies function?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflect on a recent news event that sparked your curiosity - how do you think understanding political, legal, or economic systems could help you make a difference in similar situations?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global events, how do you see yourself contributing to shaping policies or laws that impact societies, and what motivates this aspiration?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of a current event or social issue that sparks your curiosity, and how understanding its political, legal, or economic dimensions could empower you to make a difference?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example from your life or observations where you saw the impact of political decisions on economic outcomes or legal systems?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global events, how do you see yourself contributing to shaping policies or laws that impact societies, and why does this excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on your goals, how do you see understanding political systems, legal frameworks, or economic principles shaping your future career or personal impact?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies are governed and resources are allocated?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Imagine you're a policymaker for a day - what societal issue would you prioritize addressing, and how do you think economic principles could inform your solution?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a social or global issue that sparks your curiosity, and how understanding its political, legal, and economic dimensions could help drive meaningful change?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of a current event that sparked your curiosity, and how understanding its political, legal, or economic aspects could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of a social or global issue that sparks your curiosity, and how understanding politics, laws, or economic systems could help address it?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you observed how political decisions, laws, or economic systems impacted your community, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how power, justice, and resources are balanced in society?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Imagine you could reform one law to create a more equitable society; what would it be and how do you think it would impact economic opportunities?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global challenges, how do you see the interconnectedness of political systems, legal frameworks, and economic policies shaping your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed a current event and considered how political, legal, and economic systems interact to shape its outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example from your life or current events where you saw the intersection of power dynamics, legal frameworks, and economic impacts, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you observed inequality or injustice, and how it sparked your curiosity about systems that shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Imagine you could reform one law or policy in your community - what would it be, and how do you think it would impact society?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Imagine you could reform one law in your community; what issue would you tackle and how do you think economics would influence your decision?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you observed inequality or injustice, and how it sparked your curiosity about systems of governance or economic structures?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Could you share an example of a social issue that sparks your curiosity, and how understanding its political, legal, or economic dimensions might shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how political systems, laws, or economic policies shape our society?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how understanding its economic or legal aspects might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global events, how do you see the interconnectedness of political decisions, legal frameworks, and economic systems shaping your desired career path?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Could you share an experience where you noticed the impact of laws or policies on your community, sparking your curiosity in these areas?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflect on a social issue you're passionate about - how do you think understanding political systems, legal frameworks, or economic principles could help drive meaningful change?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how understanding its economic implications might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Could you share an example from your life or observations where the intersection of power dynamics, legal frameworks, or economic systems sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how political systems, laws, or economic policies shape our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how understanding its political, legal, or economic dimensions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global challenges, which aspect of shaping societies through governance, legal frameworks, or economic policies resonates with you the most?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you noticed how power, rules, or resources were distributed unfairly, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global events, how do you see the interplay of political systems, legal frameworks, and economic policies shaping your desired future career?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how power, laws, or economic systems shape our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed a social issue from multiple angles, and how did that shape your perspective on creating positive change in society?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its political, legal, and economic dimensions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed a controversial law or policy in the news, and if so, what sparked your curiosity about its creation or impact?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies are governed?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed a current event and considered how political, legal, or economic systems could be improved to address the issue?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global events, how do you see the interplay of political systems, legal frameworks, and economic policies shaping your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global issues, how do you see yourself contributing to shaping policies, laws, or economic systems that drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding political, legal, or economic systems might help address it?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example from your life or current events that sparked your curiosity about how power, laws, or economic systems shape our society?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how societies are governed, and how you think learning about this could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you observed inequality or injustice, and how it sparked your curiosity about systems of governance or economic structures?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Imagine you could shape one global policy: what issue would you address and how do you think economic and legal systems could help or hinder your approach?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how societies govern themselves, resolve conflicts, or allocate resources, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed a current event and considered how political, legal, or economic systems could be improved to address the issue?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global challenges, which aspect of shaping policies, understanding legal frameworks, or analyzing economic systems excites you the most about driving societal change?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global events, what aspects of how societies are governed or economies function spark your curiosity about shaping future policies?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you observed how laws, economic systems, or political decisions impacted your community, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example from your life or observations where the intersection of power dynamics, societal rules, or resource allocation sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed how laws shape societies or debated economic policies with others, and what sparked your curiosity in these discussions?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global issues, which aspect - political dynamics, legal frameworks, or economic systems - intrigues you the most and why?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its political, legal, and economic dimensions could help address it?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you noticed the impact of political decisions on everyday life, and how did that spark your curiosity in understanding such dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a recent global event that sparked your curiosity, and how understanding its political, legal, or economic dimensions could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Could you share an example from your life or current events that sparked your curiosity about how power, governance, and resource allocation shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Imagine you could reform one law to create a fairer society; what issue would you tackle and how does this reflect your values?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Imagine you're a policymaker for a day - what societal issue would you prioritize tackling, and how do you think economics and legal frameworks could help address it?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Could you share an example from your life or observations where the intersection of governance, legal frameworks, or economic systems sparked your curiosity or concern?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how societies are governed, and how you think learning about governance could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed how laws shape societies or economies, and if so, what sparked your curiosity in these interconnected systems?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global issues, what aspects of governance, justice, or economic systems spark your curiosity, and why do you want to explore them further?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a recent global event that sparked your curiosity, and how you think understanding politics, law, or economics could help address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on global events, which aspect of governance, legal systems, or economic policies sparks your curiosity for further exploration and why?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how political systems, laws, or economic policies shape societies, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Could you share an example from your life where you navigated a rule, policy, or social issue, and how it sparked your curiosity about shaping societal outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed a current event and considered how political, legal, or economic systems could be improved, and what role you'd like to play in that process?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Imagine you're a policymaker for a day - what societal issue would you prioritize tackling, and how do you think laws or economic strategies could drive meaningful change?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how societies are governed, and how you think this relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how societies are governed, and how you think understanding this could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how political systems, laws, or economic policies shape our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example from your life or observations where you saw the intersection of power dynamics, societal rules, or resource allocation, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed how laws shape societal behaviors or considered how economic policies impact global issues, and how might exploring these intersections influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of a current event that sparked your curiosity, and how understanding its political, legal, or economic aspects could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how societies are governed, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how understanding politics, laws, or economic systems might help address it?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how political systems, laws, or economic policies shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Imagine you're a policymaker for a day - what societal issue would you tackle first, and how would you balance individual freedoms with collective well-being?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed a global issue from both political and economic perspectives, and how did that shape your understanding of potential solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a recent global issue that sparked your curiosity, and how understanding its political, legal, or economic aspects could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on global events or personal experiences, what aspects of how societies are governed, laws are created, or economies function spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed a real-world issue that blended political power, legal systems, and economic influences, and if so, what drew you to explore these interconnected dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed a global event and thought about how political, legal, or economic systems could be improved - where do you think you'd start?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how understanding its political, legal, or economic aspects could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global issues, how do you see yourself contributing to shaping policies, laws, or economic systems to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global events, how do you think studying the interplay between political systems, legal frameworks, and economic policies could shape your future impact?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how political systems, legal frameworks, or economic policies shape our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you ever analyzed how laws shape societies or economies, and if so, what sparked your curiosity about these interconnected systems?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of a social issue you're passionate about, and how understanding politics, laws, or economic systems could help drive meaningful change?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example from your life or current events that sparked your curiosity in how political systems, laws, or economic policies shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Reflecting on current global events, what aspects of governance, legal systems, or economic policies intrigue you, and how do you see yourself engaging with these areas in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how did you analyze or respond to it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that conflicted with your personal values, and how did you respond?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how you balanced individual interests with collective outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that conflicted with your personal beliefs, and how did you resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that conflicted with your personal beliefs, and how did you reconcile this?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy you disagreed with, and how did that experience shape your understanding of governance?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that sparked both agreement and disagreement among your peers?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that sparked your curiosity, and how did you engage with its underlying social or economic implications?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or system that seemed unfair, and how did that experience shape your views on governance?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or system, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did you advocate for change?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a current global issue where political, legal, and economic systems intersect, and how you'd approach analyzing its complexities?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or system you disagreed with, and how did that experience shape your perspective on governance?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that sparked your curiosity about how societies balance individual rights with collective interests?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of a social issue you're passionate about, and how you'd balance individual rights with societal interests when addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did that experience shape your views on governance or justice?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or system that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a complex rule or policy, and how did that experience shape your understanding of governance or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or system that seemed unfair, and how would you propose improving it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how did you balance individual interests with collective outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you walk me through a time when you analyzed a complex social issue, and how did you balance competing perspectives to form your opinion?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did you balance competing interests or values?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex group decision - what strategies did you use to balance competing interests effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted your community, and how did you engage with it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or system that seemed unfair, and how did that experience shape your views on governance?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how did you balance individual interests with collective outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did you advocate for change?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or system, and how did that experience shape your understanding of governance or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did that experience shape your views on governance?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or system that seemed unfair, and how would you advocate for change in such situations?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a rule or policy that seemed unfair, and how did you advocate for change?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair - how did you address it and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how did you analyze or respond to it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how would you propose a more equitable solution?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did you apply reasoning, empathy, or strategic thinking to resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a conflict or disagreement, and how did you balance competing interests or values?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or system that seemed unfair, and how would you propose a balanced reform?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that conflicted with your personal beliefs, and how did you resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did you respond to the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or system that seemed unfair, and how would you propose improving it in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how did you adapt to achieve a fair outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example from your life where you navigated a rule or policy that seemed unfair, and how did that experience shape your views?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a conflict of interests among peers, and how did you balance fairness with effective decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how did you analyze or respond to it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did you apply critical thinking to resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how would you propose improving it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of a current global issue that sparks your curiosity, and how you'd analyze it from political, legal, and economic angles?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did you balance individual rights with collective interests?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how would you advocate for change in such situations?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that seemed unfair, and how did that shape your understanding of governance and decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did you apply logical reasoning or empathy to resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that conflicted with your personal beliefs, and how did you reconcile this?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how did you balance individual and collective interests?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of how you navigated a complex rule or policy in your school or community, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did you balance competing interests or values?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a conflict of interests, and how did you balance competing priorities to reach a fair resolution?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted your community, and how would you approach reforming it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did that experience shape your views on governance?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that conflicted with your personal beliefs, and how did you respond?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex decision involving fairness, power dynamics, or resource allocation, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how did you analyze or respond to it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or system, and how did that experience shape your understanding of governance or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that seemed unfair, and how would you propose a balanced solution?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how did you balance individual interests with collective outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that conflicted with your personal beliefs, and how did you respond?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how did you balance individual and collective interests?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how did you balance individual interests with the collective outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that conflicted with your personal beliefs, and how did you reconcile this?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or system that seemed unfair, and how did this experience shape your views on governance or justice?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or system, and how did this experience shape your understanding of governance or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how did you balance individual interests with collective outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did you advocate for change or compliance?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated conflicting opinions or interests, and how you applied logical reasoning to reach a fair resolution?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that conflicted with your personal beliefs, and how did you respond?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex group decision - what strategies did you use to balance competing interests and values?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did you balance competing interests or values?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your approach to understanding diverse perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze and propose a solution to a current social issue, like income inequality, from both ethical and economic perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did you balance competing interests or values?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or system, and how did that experience shape your understanding of governance or fairness?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did you advocate for change or compliance?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that impacted a group, and how did you adapt or influence it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example from your experiences where you navigated a complex rule or policy, and how did that shape your understanding of governance?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or system, and how did that experience shape your understanding of governance or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a conflict of interests, and how did you balance competing priorities or values?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did that experience shape your views on governance?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example from your experiences where you navigated a complex issue involving conflicting priorities, and how did you resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that seemed unfair, and how did you advocate for change or compliance?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did you balance competing interests or values?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that conflicted with your personal beliefs, and how did you respond?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did you apply reasoning, empathy, or ethical considerations to resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example from your experiences where you navigated a complex ethical dilemma, and how did you balance competing interests or values?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a complex rule or policy that impacted your community, and how did you engage with it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex ethical dilemma, and how did you balance competing values or interests?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a conflict of interests or values, and how did you balance competing priorities effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an example of a social issue you're passionate about, and how you'd balance individual freedoms with collective well-being in addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a conflict or disagreement? How did you balance competing interests or values in your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did you apply critical thinking to resolve it effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that conflicted with your personal beliefs, and how did you respond?",
    "criterion": "Skills"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy, and how did that experience shape your understanding of governance or societal structures?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy, and how did that experience shape your views on governance or societal structures?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies are governed or economies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed or economies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you engaged in debates, mock trials, or community projects that sparked your curiosity about how societies balance individual rights with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual rights with collective interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are organized?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue involving power dynamics, rules, or resource allocation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are organized and governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy, and how did that experience shape your views on governance or societal structures?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or system that sparked your curiosity about how power, governance, or resources are allocated?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies are governed or economies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue, and how it sparked your curiosity about shaping societies or economies?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are organized?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or policy, and how did this shape your understanding of governance or societal structures?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue, and how it sparked your curiosity about shaping societal structures?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue, and how it sparked your curiosity about shaping societies or economies?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that felt unfair, and how did this experience shape your views on governance or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that felt unfair, and how did this experience shape your views on governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed or economies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual rights with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual rights with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you engaged in debates, mock trials, or community projects that sparked your curiosity about how societies balance individual rights with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies are governed or economies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue involving rules, power dynamics, or resource allocation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or system that sparked your curiosity about how societies are governed or resources are allocated?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies are governed or economies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are organized?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a moment where you observed or participated in decision-making that impacted a group, and how did this influence your views on governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you engaged in or observed situations where fairness, governance, or resource allocation sparked your curiosity, and how did you respond?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you engaged with a social issue, and how did that experience shape your understanding of governance or societal structures?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you engaged in or observed a situation where political, legal, and economic systems intersected - how did this influence your perspective on societal decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you engaged in any activities where you've analyzed societal structures, debated policy ideas, or explored how laws shape communities, and what sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue involving power dynamics, rules, or resource allocation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated a rule, policy, or social issue that sparked your curiosity about how societies organize and govern themselves?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or policy, and how did this shape your understanding of governance or societal structures?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that you disagreed with, and how did that experience shape your views?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you engaged in debates, mock trials, or community projects that sparked your curiosity about how societies govern and make decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you engaged in debates, mock trials, or community projects that sparked your curiosity about how societies balance individual rights with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Have you engaged in debates, mock trials, or community projects that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies are organized and governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex group decision or conflict, and how did this experience shape your views on governance or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or system that seemed unfair, and how did it shape your views on governance or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies function and make decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did this experience shape your views on governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed or economies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual rights with collective interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies are governed or resources are allocated?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed or economies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you observed or participated in a decision-making process that involved balancing individual interests with societal well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that sparked your curiosity about how societies are governed or economies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue, and how it sparked your curiosity about shaping societal structures?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did this experience shape your views on governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a rule or policy that sparked debate, and how did this experience shape your views on governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy, and how did this experience shape your understanding of governance or societal structures?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or system, and how did this shape your views on governance or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed or economies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies balance individual freedoms with collective well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue involving power dynamics, rules, or resource allocation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did that experience shape your views on governance or justice?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy that sparked your curiosity about how societies are governed or economies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are governed or economies function?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a rule or policy that you disagreed with, and how did you respond?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue, and how it sparked your curiosity about shaping societies or systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are organized and governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or system that seemed unfair, and how did that experience shape your views on governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are organized?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a rule or policy that seemed unfair, and how did that experience shape your views on governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule, policy, or social issue that sparked your curiosity about how societies are organized?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated a rule or policy that seemed unfair, and how did that experience shape your views on governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Politics, Law and Economics",
    "school": "SMU",
    "question": "Can you describe a time when you engaged with or observed a social issue, and how did it shape your understanding of governance, justice, or resource allocation?",
    "criterion": "Experiences"
  }
]