[
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever witnessed an event that made you question how power is distributed in society, and how might studying this phenomenon shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you found yourself drawn to understanding how power dynamics shape societies, and can you share an example from your life that sparked this curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how exploring it further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how power, governance, or policies shape our daily lives or global events?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you think studying it could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you noticed the impact of political decisions on your community, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a social or political issue that sparks your curiosity, and how exploring its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Reflecting on current global events, what sparks your curiosity about how power, policies, and governance shape societies, and how might exploring these themes impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you'd like to contribute to addressing it in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an instance where observing a social or political issue sparked your curiosity, and how you explored it further?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever analyzed a significant global event and imagined how you would address it differently, and what sparked your curiosity in such scenarios?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Reflecting on current global events, what aspects of how power is exercised or policies are shaped intrigue you the most about studying politics?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example from your life or observations where understanding power dynamics or decision-making processes sparked your curiosity about how societies are governed?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever felt passionate about a social issue, and how do you think studying the dynamics of power and governance could empower you to drive change?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Reflecting on current global issues, what aspects of power dynamics or policy-making fascinate you, and how do you see yourself engaging with these in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever been intrigued by how governments make decisions that impact our daily lives, and how would you contribute to shaping better policies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you observed power dynamics at play, and how it sparked your curiosity about systems of governance?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how power, governance, or social movements shape our world?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an instance where you observed power dynamics at play, and how did that spark your curiosity about understanding governance and societal structures?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Reflecting on global events, what aspects of how power is exercised or policies are made spark your curiosity and drive you to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever analyzed a controversial policy or social movement? How did that experience shape your curiosity about power dynamics and governance?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever analyzed a current event and thought about how governments or institutions could respond differently, and what sparked that curiosity in you?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you found yourself drawn to understanding how power dynamics shape societal decisions, and how might exploring these themes impact your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how power, governance, or policies shape societies, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a social issue you're passionate about and how understanding its political dynamics could empower you to drive meaningful change?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you think understanding its complexities could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Reflecting on current global events, what aspects of power dynamics, governance, or social movements genuinely intrigue you, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example from your life or observations where understanding power dynamics or decision-making processes sparked your curiosity about how societies are governed?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever felt strongly about a social issue or policy, and if so, what motivated you to learn more about how such decisions are made?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how power, policies, or social movements shape our world?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example from your life or observations where you saw the impact of political decisions, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how exploring it might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Reflecting on current global issues, what aspects of power, governance, or social change intrigue you the most and why?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you think studying it could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an instance where you observed power dynamics at play, and how did that spark your curiosity about understanding governance systems?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you think understanding its complexities could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Reflecting on global events, which social or political issue sparks your curiosity, and how do you envision contributing to meaningful change in that area?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a social or political issue that sparks your curiosity, and how understanding its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you found yourself drawn to understanding how power dynamics shape societies, and can you share an experience that sparked this curiosity in you?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you noticed power dynamics at play, and how did that spark your curiosity about understanding governance systems?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you think studying it could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Reflecting on current global events, how do you see the study of power dynamics and governance shaping your understanding of societal challenges and future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever witnessed a social movement or policy change that sparked your curiosity, and how do you see yourself contributing to such discussions in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a social or political issue that sparks your curiosity, and how exploring its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an instance where a political event sparked your curiosity, and how you think understanding such events could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how exploring it might shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you'd like to contribute to addressing it in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example from your life where you noticed power dynamics at play, and how did that spark your curiosity about understanding governance and societal structures?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how you think understanding its political dimensions could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how power, governance, or policies shape our societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did this spark your curiosity about systems of power and governance?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share a global or local issue that sparks your curiosity, and how you think studying politics could empower you to make a difference?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a social or political issue that sparks your curiosity, and how understanding its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an instance where you observed power dynamics at play, and how did that spark your curiosity about systems of governance?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever witnessed a social issue that sparked your desire to understand and influence decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever analyzed a controversial policy or social movement? What sparked your curiosity to understand the underlying power dynamics at play?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you found yourself drawn to understanding how power dynamics shape societies, and how might exploring these themes impact your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever analyzed a current event or social movement that sparked your curiosity about how power and policies shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you observed power dynamics at play, and how did that spark your curiosity about understanding governance systems?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you noticed inequality or injustice, and how it sparked your curiosity to understand power dynamics in societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever analyzed a controversial policy or social movement? What sparked your curiosity to understand the underlying power dynamics at play?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you found yourself drawn to understanding how power dynamics shape societies, and can you share an example of this curiosity in action?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a current event or social issue that sparks your curiosity, and how understanding its political dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you think studying it could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever analyzed a controversial policy or social movement that sparked your curiosity about how power and governance shape our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example from current events that sparked your curiosity about how power and policies shape societies, and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever analyzed a current event and imagined how you'd shape policies to address it, and what sparked that curiosity in you?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an instance where you observed power dynamics at play, and how did that experience spark your curiosity about governance or societal structures?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you observed power dynamics at play, and how did that spark your curiosity about how societies are governed?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share a recent global or local event that sparked your curiosity about how power is exercised, and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how power, governance, or policies shape societies, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you observed power dynamics at play, and how did that spark your curiosity about understanding decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever witnessed a social issue that sparked your desire to understand and influence decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how power, governance, or policies shape societies and individual lives?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how power, governance, or policies shape societies and individual lives?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how exploring it further could shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever been intrigued by how societal decisions are made, and do you see yourself contributing to shaping these processes in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever been intrigued by how laws are formed or how social movements drive change, and how might exploring these processes shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example from your life or observations where you saw the impact of policy or governance, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you'd like to contribute to addressing it in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you found yourself drawn to understanding how power dynamics shape societies, and can you share an example that sparked this curiosity in you?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever analyzed a current event and imagined how you'd shape policies to create positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where observing a social issue or political event sparked your curiosity to understand the underlying systems or power dynamics at play?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example from current events that sparked your curiosity about how power is exercised in societies, and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how exploring it further could shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever analyzed a global event and wished you could influence policy decisions? What draws you to understanding power dynamics and governance?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you observed power dynamics at play, and how did that spark your curiosity about systems of governance?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Reflecting on current global events, what aspects of how power is exercised or policies are made intrigue you the most, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever analyzed a current event and wondered how different political systems could lead to better outcomes, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever analyzed a global issue or local policy that sparked your curiosity, and how do you see yourself contributing to such discussions in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever witnessed a social movement or policy change that sparked your curiosity, and how do you think understanding its underlying dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever analyzed a global event or policy debate that sparked your curiosity, and how did it shape your views on governance or civic engagement?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Reflecting on current global events, what aspects of how power is exercised or policies are made intrigue you the most?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a social issue you're passionate about and how understanding political systems could help drive meaningful change in that area?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Reflecting on current global issues, what sparks your curiosity about how power is exercised and policies are shaped in societies today?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about how power and policies shape societies, and how you see yourself engaging with these dynamics in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you'd like to contribute to addressing it in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you found yourself drawn to understanding how power dynamics shape societies, and can you envision applying this understanding to drive change in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you think studying it could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever witnessed an unfair policy or social issue that sparked your desire to understand and potentially influence decision-making processes?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict with someone who held a vastly different viewpoint, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how would you approach understanding its root causes and potential solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a social or political issue that sparks your curiosity, and how you'd go about understanding its complexities?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social issue you're passionate about and how you'd approach advocating for change in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social issue you're passionate about and how you've engaged with it, highlighting your critical thinking and advocacy skills?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict among peers, and how did that experience shape your views on decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did this experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did this experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a social or political issue that sparks your curiosity, and how you'd approach understanding its complexities and potential solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict among peers, and what strategies did you employ to resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social issue you're passionate about and how you'd advocate for change, even in the face of opposing views?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict among peers? How did you approach the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did this shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on effective leadership or governance?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of how you navigated a disagreement on a social issue, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did this experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a social or political issue that sparks your curiosity, and how would you approach understanding its complexities?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on effective governance or leadership?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict with someone holding a vastly different viewpoint, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict with someone holding opposing views, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict - how did you approach it, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a social or political issue you're passionate about and how you'd approach advocating for change, even in the face of disagreement?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did this experience shape your views on power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example from your life where you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did you apply critical thinking to resolve it effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement with someone holding opposing views, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and how did you engage with their perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict among peers - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict with someone holding a vastly different viewpoint, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your approach to understanding differing perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did this experience shape your views on effective leadership or governance?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did this experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a social issue you're passionate about and how you'd advocate for change, highlighting your critical thinking and communication skills?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social issue you're passionate about and how you'd advocate for change, even if faced with strong opposing views?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement with someone holding opposing views, and how did you engage with their perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and how did that shape your understanding of diverse perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and how did you engage with their perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did this shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on effective leadership or governance?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how would you approach understanding its complexities?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how would you approach understanding its root causes and potential solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone who held a vastly different viewpoint, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict with someone who held a vastly different viewpoint, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social issue you're passionate about and how you'd propose influencing change, even with limited resources?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an example of a social issue you're passionate about, and how you'd analyze its root causes and potential solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement with someone holding opposing views, and how did this shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict with someone who held a vastly different viewpoint from yours?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict among peers, and how did you apply critical thinking to resolve it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a social or political issue that sparks your curiosity, and how you'd approach understanding its complexities?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and how did this shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and how did you engage with their perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did this experience shape your views on resolving societal or communal differences?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on decision-making or leadership?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did you engage with differing perspectives to find common ground?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did it shape your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you engaged with or observed a decision-making process that impacted your community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did this shape your views on decision-making or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you engaged with or observed a social or political issue - what sparked your interest and how did you respond?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a moment when you engaged with or observed a political process that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did this shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did this shape your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how it shaped your understanding of different perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a moment when you navigated a disagreement or conflict, and how did this experience shape your views on decision-making or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with or influenced a group decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever engaged in or observed a debate on a social issue that sparked your curiosity about how power and policies shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how it shaped your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did this shape your views on influencing or understanding differing perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a situation involving conflicting opinions or power dynamics, and how did you engage with these differences?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with or influenced a group decision, and how did this shape your views on leadership or governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did that shape your views on decision-making or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate on a social issue - what did you learn from engaging with differing perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how it shaped your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how it shaped your views on decision-making or power dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did it shape your views on decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate on a social issue - what did you learn from engaging with differing viewpoints?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did this shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did this shape your views on resolving differences in society?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did it shape your understanding of differing perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your views on cooperation or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate on a societal issue, and how it shaped your perspective on governance or policy?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how it shaped your views on decision-making or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how it shaped your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a situation involving conflicting opinions or power dynamics, and how did you engage with these differences?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you engaged with or observed a decision-making process that impacted a community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate on a social issue - how did it shape your views or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with a social or political issue, and how did it shape your perspective on community or governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted your community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your views on decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you engaged with or observed a decision-making process that impacted your community, and how did it shape your views?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you engaged in or observed a situation where power dynamics significantly impacted a community's decision-making process, and how did you respond?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did it shape your views on decision-making or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate on a social issue - what did you learn from engaging diverse perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you ever engaged in or observed a debate, discussion, or community initiative that sparked your curiosity about how power and policies shape societies?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a moment when you engaged with or observed a social issue that sparked your curiosity about power dynamics or governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a moment when you observed or participated in a decision-making process that impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you engaged in or observed a situation where power dynamics or policy-making impacted a community - what did you learn from this experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how it shaped your understanding of differing perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you engaged with or observed a social movement or policy debate that sparked your curiosity about how power and governance shape society?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how it shaped your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how it shaped your views on decision-making or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did this shape your views on decision-making or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how it shaped your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you observed or participated in a decision-making process that impacted a group, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did this shape your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did this shape your views on resolving conflicts or influencing decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how it shaped your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how it shaped your views on decision-making or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a situation involving conflicting opinions or power dynamics, and how did you engage with these differences?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how it shaped your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you engaged in or observed a debate, protest, or community campaign that sparked your curiosity about how power and policies shape societies?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you engaged in or observed any activities where people with differing opinions had to work together - what did you learn from this?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate on a societal issue - what did you learn from engaging with differing viewpoints?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with social or political issues, and how did it shape your views on governance or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debated a controversial topic - how did this shape your views on governance or societal structures?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did it shape your views on resolving conflicts or influencing decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you observed or participated in a decision-making process that impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate on a social issue - how did it shape your views?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did it shape your views on decision-making or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a moment when you engaged with or observed a decision-making process that impacted your community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did it shape your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how it shaped your understanding of different perspectives or power dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you engaged with or observed a social or political issue that sparked your curiosity about how power and policies shape societies?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debated a social issue - what did you learn from engaging with differing perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did it shape your views on decision-making or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a moment when you engaged with or observed a social movement or policy debate that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you observed or participated in decision-making processes that impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you observed or participated in a decision-making process that impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you engaged in or observed any situations where power dynamics or decision-making processes fascinated you, and how did you respond?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you observed or participated in decision-making processes that impacted a group, and how did this shape your views?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you describe a time when you engaged with or observed a social or political issue that sparked your curiosity about how power and governance shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did it shape your views on decision-making or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Can you share an experience where you observed or participated in a decision-making process that impacted a group, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "SMU",
    "question": "Have you engaged in or observed a situation where power dynamics influenced decision-making - what did you learn from this experience?",
    "criterion": "Experiences"
  }
]