[
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Reflecting on current global events, what specific issues or themes drive your curiosity to understand how power, governance, or policies shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about how power, policies, or social movements shape our world, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever been intrigued by how decisions are made in societies, and how would you like to contribute to shaping better governance in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life or current events that sparked your curiosity about how power and policies shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Reflecting on current global events, how do you see yourself contributing to or understanding the complexities of governance and policy-making in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you found yourself drawn to understanding how power dynamics shape societies, and how would exploring these themes impact your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life where you observed power dynamics at play, and how did that spark your curiosity about governance and decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you think understanding its complexities could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your own life where you noticed power dynamics at play, and how did that spark your curiosity about understanding governance systems?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Reflecting on current global events, how do you think understanding political systems and policies could shape your future career or personal perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you think studying it could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a global event or policy decision that sparked your curiosity about how power and governance shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a current event or social issue that sparks your curiosity, and how you think understanding its political dimensions could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a global issue and thought about how you'd propose a solution to world leaders?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a current event and wished you could influence the decision-making process behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a controversial policy or social movement that sparked your curiosity about how power and governance shape our lives?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a social or political issue that sparks your curiosity, and how understanding its complexities might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you think studying it could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a current event and thought about how governments could respond differently to address the issue?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a global event or policy decision that sparked your curiosity about how power and governance shape our world?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a social or political issue that sparks your curiosity, and how you think studying it could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Reflecting on current global issues, what aspects of power dynamics or policy-making spark your curiosity for future exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an instance where observing a social or political issue sparked your curiosity, and how you think understanding its complexities could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life or current events that sparked your curiosity about how power and policies shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life or current events that sparked your curiosity about how power, governance, or policies shape our societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever been intrigued by how decisions are made in your community or country, and how you might contribute to shaping these processes in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever witnessed a social issue that sparked your desire to understand how power and policies shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a social issue that sparks your curiosity, and how you think understanding power dynamics could help address it in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you think understanding its complexities could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Reflecting on current global events, what aspects of power, governance, or social change intrigue you, and how might exploring these themes shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever felt passionate about a social issue or current event, and if so, how do you think studying its underlying systems and power dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you observed power dynamics at play, and how did that spark your curiosity about systems of governance?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you observed power dynamics at play, and how did it spark your curiosity about systems of governance?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever found yourself analyzing a global event or debating a social issue? What sparked your curiosity, and how do you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a current event or social issue that sparked your curiosity, and how you think studying politics could help you better understand or address it?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a global event and wondered how power dynamics or policies shaped its outcome, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Could you share a recent global or local event that sparked your curiosity, and how you think understanding its political dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a controversial policy or social movement that sparked your curiosity about how power and governance shape our daily lives?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from current events that sparked your curiosity about how governments shape societal outcomes, and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you'd like to contribute to addressing it in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you found yourself drawn to understanding how power dynamics shape global issues, and how might exploring these themes impact your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a current event and imagined how you'd address it if you were in a position of power?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from current events or your own life that sparked your curiosity about how power and policies shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life where you noticed power dynamics at play, and how did that spark your curiosity about how societies are governed?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about how power, governance, or policies shape societies, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how you think understanding its political dimensions could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you found yourself drawn to understanding how decisions are made in societies, and can you share an experience that sparked this curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a social or political issue that sparks your curiosity, and how understanding its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a significant global event and wondered how different political systems could have led to a better outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever debated a controversial social issue that sparked your curiosity to understand how power dynamics shape societal outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you'd like to contribute to addressing it?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a current event and wondered how different political systems could lead to better outcomes, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever found yourself analyzing a current event or social issue and wanted to understand the underlying power dynamics or decision-making processes at play?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life or observations where you saw the impact of political decisions, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where observing a social or political issue sparked your curiosity, and how you'd like to explore such issues further?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you'd like to contribute to addressing it?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a controversial policy or social movement? What sparked your curiosity to understand the underlying power dynamics at play?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life or current events that sparked your curiosity about how power, governance, or policies shape our society?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a controversial policy or social movement? What sparked your curiosity to understand the underlying power dynamics or motivations at play?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an instance where observing a social or political issue sparked your curiosity, and how you envision exploring such topics further in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life where you noticed power dynamics at play, and how did that spark your curiosity about governance and decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a global event and wondered how individual actions or policies could shape its outcome, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life where you noticed power dynamics at play, and how did that spark your curiosity about governance systems?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you'd like to contribute to addressing it?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Reflecting on current global events, what aspects of power dynamics or policy-making spark your curiosity, and how might exploring these themes shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever debated or discussed a social issue that sparked your curiosity about how power and policies shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever witnessed a social issue that sparked your desire to understand and influence decision-making processes, and how might studying this field help you achieve that?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life or current events that sparked your curiosity about how power, governance, or policies shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you'd like to contribute to addressing it in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life where you noticed power dynamics at play, and how did that spark your curiosity about understanding governance systems?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a global event and wondered how power dynamics or policies shaped its outcome, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life or observations where understanding power dynamics or policy-making sparked your curiosity about shaping societal outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Reflecting on current global events, what aspects of how societies are governed or how policies impact lives intrigue you the most?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a current event and wished you could influence the decision-making process behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you noticed inequality or injustice, and how it sparked your curiosity about how societies are governed?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Reflecting on current global events, what aspects of how societies are governed or how power is exercised spark your curiosity and why?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Reflecting on current global issues, what specific aspects of power dynamics or societal change intrigue you, and how do you see yourself engaging with these topics in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Reflecting on current global issues, what aspects of power dynamics or policy-making spark your curiosity for deeper exploration in your future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with social issues or current events, and how it sparked your curiosity about governance or policy-making?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a global issue or policy debate that sparked your curiosity, and how do you see yourself engaging with such topics in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life or current events that sparked your curiosity about how power, governance, or policies shape societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a global event or policy debate that sparked your curiosity, and how do you think studying its complexities could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you found yourself drawn to understanding how decisions are made in societies, and can you share an example that sparked this curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Could you share an example of a current event or social issue that sparks your curiosity, and how you think understanding its underlying political dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you think understanding its complexities could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a social or political issue that sparks your curiosity, and how exploring its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a controversial policy or social movement? How did that experience spark your curiosity about the forces shaping societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you found yourself drawn to understanding how decisions are made in societies, and how might exploring this curiosity shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Reflecting on current global events, what aspects of power dynamics or policy-making inspire you to learn more about how societies are governed?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you noticed power dynamics at play, and how did that spark your curiosity about understanding governance systems?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an instance where a political event or issue sparked your curiosity, and how you think understanding such issues could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience or issue that sparked your curiosity about how power, governance, or policies shape societies, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you observed power dynamics at play, and how did that spark your curiosity about systems of governance?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a social or political issue that sparks your curiosity, and how understanding its complexities might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever felt passionate about a social issue or policy debate, and how might exploring such topics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Reflecting on global events, what aspects of power dynamics or societal change intrigue you, and how might exploring these themes shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you think understanding its complexities could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with current events or social issues, and how that sparked your curiosity about the systems that govern societies?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a controversial policy or social movement that sparked your curiosity about how power and governance shape societal outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever analyzed a controversial policy or social movement? What sparked your curiosity to understand the underlying power dynamics at play?",
    "criterion": "Interests"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of how you've navigated a disagreement on a social issue, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social issue you're passionate about and how you've analyzed or engaged with its underlying power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a complex social issue; how did you stay informed and what solutions did you propose?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and how did you engage with their perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social issue you're passionate about, and how you've actively engaged with or influenced others about it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement with someone who held a vastly different viewpoint, and how did you approach the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a complex social issue, and how would you approach advocating for change in that situation?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and how did you engage constructively with their perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a social issue you're passionate about and how you'd advocate for change, even if faced with strong opposing views?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict with someone who held a different viewpoint, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on resolving differences in society?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a social issue you're passionate about and how you'd analyze its root causes and potential solutions from multiple perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social or political issue you're passionate about, and how you've engaged with it to drive change?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a social issue you're passionate about and how you'd advocate for change, even in the face of opposing views?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict among peers, and how did that experience shape your views on decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict with someone holding opposing views, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a social or political issue you're passionate about and how you've engaged with it, or would like to in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict with someone holding a vastly different viewpoint, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict with others - what strategies did you use and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social or political issue that sparks your curiosity, and how you'd approach understanding its complexities?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict with someone who held a vastly different viewpoint?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did this experience shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did this experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict with someone who held a vastly different viewpoint from yours?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social issue you're passionate about and how you'd propose influencing change, even with limited resources?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your experiences where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict with others - what strategies did you use to resolve it effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did you apply critical thinking to resolve it effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict among peers, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict with someone who held a vastly different viewpoint?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social issue you're passionate about and how you would approach advocating for change in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and how did you approach the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement with someone holding opposing views, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did this experience shape your views on power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social issue you're passionate about and how you've engaged with it, sparking your interest in understanding governance systems?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict with someone who held a vastly different viewpoint?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on decision-making in groups?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you analyzed a complex social issue; how did you form your opinion, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict among peers, and what strategies did you use to resolve it effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your views on power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a social issue you're passionate about and how you'd propose influencing change, even with limited resources?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict with someone who held a vastly different viewpoint, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and how did you engage with their perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did this experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you navigated a disagreement with someone holding opposing views, and how did that experience shape your approach to understanding different perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example of a social issue you're passionate about and how you'd propose influencing change, given the opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an example from your life where you navigated a disagreement or conflict, and how did that experience shape your views on decision-making in groups?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you walk me through a time when you navigated a disagreement or conflict, and how did that experience shape your understanding of power dynamics or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a social or political issue you're passionate about and how you've engaged with it, sparking your interest in deeper study?",
    "criterion": "Skills"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did this shape your views on decision-making or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you engaged with or observed a social or political issue, and how it sparked your curiosity about governance or power dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you engaged in or observed a situation where power dynamics or decision-making processes fascinated you, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a situation involving differing opinions or power dynamics, and how did you engage with these complexities?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a moment when you observed or participated in a decision-making process that impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you engaged in or observed a debate on a social issue that sparked your interest in how power and policies shape societal outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate on a social issue, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you engaged in or observed any activities where decision-making impacted a group or community, and what did you learn from this experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a group or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you engaged with or observed a social movement or policy debate that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a social issue or policy debate that sparked your curiosity about how power and governance shape society?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a social issue, and how it sparked your curiosity about power dynamics or governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how it shaped your understanding of power dynamics or decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a moment when you observed or participated in a decision-making process that impacted a group, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever engaged in or observed a debate on a social issue that sparked your curiosity about how power and policies shape societies?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate on a social issue, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted your community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did it shape your views on resolving differences in society?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever engaged in or observed a debate on a social issue that sparked your interest in understanding power dynamics or governance systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted your community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in a decision-making process that impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a moment when you engaged with or observed a political issue, and how it sparked your curiosity about governance or societal change?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate on a social issue - what did you learn from engaging with differing viewpoints?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a social or political issue, and how did it shape your perspective on community or governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted your community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in a decision-making process that impacted a group or community, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a moment when you engaged with a social or political issue, and how it shaped your views on governance or activism?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did it shape your views on governance or societal decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate on a social issue, and how did it shape your views?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you engaged with or observed a social or political issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a moment when you engaged with or observed a decision-making process that impacted your community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did this shape your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate on a social issue - what did you learn from engaging with differing viewpoints?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a moment when you engaged with or observed a political issue, and how did it shape your views on governance or civic responsibility?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you engaged with or observed a social issue that sparked your curiosity about how power is exercised in societies?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did this shape your views on resolving conflicts or influencing decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you engaged with or observed a political issue, and how did it shape your understanding of societal structures?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a moment when observing or participating in a decision-making process sparked your curiosity about power dynamics or societal impacts?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did this shape your views on decision-making or power dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a moment when you observed power dynamics at play, and how did that experience shape your curiosity about decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in a decision-making process that impacted a group, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted your community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in a decision-making process that impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you engaged with or observed a social or political issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a social or political issue that sparked your curiosity about how power and policies shape societies?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how it shaped your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in a decision-making process that impacted a group, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how it shaped your views on decision-making or power dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in a decision-making process that impacted a group, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted your community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did it shape your views on decision-making or power dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever engaged in or observed a debate on a social issue that sparked your curiosity about how power and policies shape societies?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a social or political issue, and how it shaped your perspective on governance or civic responsibility?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you ever engaged with or observed a community issue that sparked your curiosity about how power, policies, or social movements shape our lives?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how it shaped your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you engaged with or observed a social or political issue that sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in decision-making processes that impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you engaged in or observed situations where power dynamics or policies impacted a community, and how did that influence your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you engaged with or observed a social or political issue, and how it sparked your curiosity about governance or societal structures?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how it shaped your views on decision-making or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate on a social issue, and how it shaped your views on governance or policy-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate on a social issue, and how it shaped your views on governance or policy-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate, and how did that shape your views on decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you engaged in any activities, such as debates or volunteer work, that sparked your curiosity about how power and policies shape societies?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did it shape your understanding of power dynamics or decision-making processes?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate on a social issue - how did it shape your views on governance or policy?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you engaged with or observed a political issue, and how did that experience shape your views or spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you engaged in or observed any community, school, or online discussions on social issues that sparked your interest in understanding governance and policy-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in a decision-making process that impacted a group, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did that shape your understanding of power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with a social or political issue, and how it shaped your understanding of power dynamics or governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a group or community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Have you engaged in or observed a situation where power dynamics significantly influenced an outcome, and how did this shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you observed or participated in a decision-making process that impacted a group or community?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a time when you engaged with or observed a social or political issue, and how did it shape your perspectives or actions?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or conflict, and how did this shape your views on power dynamics or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted your community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you describe a moment when you engaged with or observed a social or political issue that sparked your curiosity about how societies are governed?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you engaged with or observed a decision-making process that impacted a community, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Political Science",
    "school": "NUS",
    "question": "Can you share an experience where you navigated a disagreement or debate on a societal issue - what did you learn from engaging with differing viewpoints?",
    "criterion": "Experiences"
  }
]