[
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see an interdisciplinary, research-driven education shaping your future goals and personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future aspirations, how do you see a rigorous, interdisciplinary curriculum shaping your growth and preparing you for a dynamic, uncertain career landscape?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see an interdisciplinary, research-driven education shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see an interdisciplinary, research-driven education propelling your growth in a rapidly evolving global landscape?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future goals, how do you see an interdisciplinary, research-driven education shaping your career and personal growth in a rapidly changing world?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see an interdisciplinary, research-driven education shaping your future career and personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you felt a strong desire to excel academically and contribute meaningfully to society, and how did that shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you envision a rigorous, interdisciplinary academic environment shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see an interdisciplinary and research-driven education shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a program emphasizing interdisciplinary studies and leadership development shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see a program that emphasizes interdisciplinary studies and leadership development shaping your career aspirations and personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see an interdisciplinary, research-driven education propelling your growth and impact in a rapidly evolving world?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when exploring interdisciplinary connections sparked your curiosity, and how might such experiences shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you felt driven to excel academically, and how do you see that motivation shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when exploring an interdisciplinary topic sparked your curiosity, and how did that experience shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see a multidisciplinary approach enhancing your career or personal growth in a rapidly evolving global landscape?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you felt challenged to think critically across different subjects, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a holistic, interdisciplinary education fueling your growth and preparing you for a dynamic, impactful career?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your goals, how do you see an interdisciplinary, research-focused education propelling your growth and preparing you for a dynamic, impactful career?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you combined creativity with analytical thinking, and how do you see such skills shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share a moment when you embraced a challenge that pushed your academic boundaries, and how it sparked your curiosity for interdisciplinary learning?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share how pursuing an interdisciplinary curriculum with a research focus might shape your academic journey and future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a challenging, interdisciplinary curriculum shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where exploring multiple disciplines sparked your curiosity, and how do you see this shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you felt challenged to think critically across multiple disciplines, and how did that experience shape your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your goals, how do you see a program emphasizing leadership and interdisciplinary studies shaping your future career and personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you think a holistic, interdisciplinary education would bridge your diverse interests and propel your future growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see an interdisciplinary and research-driven education shaping your future goals and personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging opportunity that aligned with your passions, and how it shaped your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future aspirations, how do you see a research-focused, interdisciplinary education shaping your career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when exploring an interdisciplinary topic sparked your curiosity, and how do you see such explorations shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of how you've pursued a challenging yet rewarding academic or personal project that sparked your curiosity for interdisciplinary learning?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future aspirations, how do you see a rigorous, interdisciplinary learning environment shaping your growth and preparing you for impactful contributions?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see a program that challenges you academically and encourages interdisciplinary exploration shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when exploring interdisciplinary connections sparked your curiosity, and how might such experiences shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see a program that challenges you academically and fosters leadership impacting your personal growth and career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging goal that combined academic rigor with personal growth, and what motivated you?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a research-focused, interdisciplinary curriculum shaping your future career or personal development goals?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see an interdisciplinary, research-focused education shaping your career aspirations and personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see a program that challenges you academically and personally preparing you for a career that aligns with your passions?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging goal that combined academic rigor with personal growth, and how it shaped your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of how you've pursued a challenging academic or personal goal, and how it sparked your curiosity for interdisciplinary learning?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see an interdisciplinary, research-driven education propelling your growth and impact in a rapidly evolving world?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future goals, how do you see an interdisciplinary, research-driven education shaping your career aspirations and personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see an interdisciplinary, research-driven education shaping your future career or personal aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a research-focused, interdisciplinary education shaping your future career or personal growth in a rapidly evolving world?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your goals, how do you see a rigorous, interdisciplinary curriculum shaping your future pursuits and personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your academic journey, what interdisciplinary topics or real-world challenges excite you to explore through a holistic, research-driven undergraduate experience?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future goals, how do you see a rigorous, interdisciplinary curriculum shaping your career aspirations and personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you felt driven to excel beyond expectations, and how do you see this motivation shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you envision a rigorous, interdisciplinary curriculum propelling your growth in a rapidly evolving, complex world?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future goals, what areas of interdisciplinary study or research excite you, and how do you see them shaping your career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you combined academic rigor with innovative thinking, and how it shaped your goals for a multifaceted education?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that combined academic rigor with leadership, and how it shaped your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a holistic, interdisciplinary education shaping your future career and personal growth in a rapidly changing world?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see a programme that challenges you academically and fosters leadership skills shaping your personal growth and career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see a program that combines academic rigor with leadership development shaping your career aspirations and personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a rigorous, interdisciplinary curriculum shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when exploring an interdisciplinary topic sparked your curiosity, and how might such experiences shape your academic journey?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see a program that combines rigorous academics with leadership development shaping your career aspirations and personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future goals, how do you see an interdisciplinary, research-driven education shaping your personal growth and career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see an interdisciplinary, research-driven education shaping your future career or personal aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a multidisciplinary, research-driven education propelling your growth and shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that combined academic rigor with leadership, and how it shaped your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance academic rigor with personal passions, and how did that shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where interdisciplinary learning sparked your curiosity, and how might such opportunities shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see a programme that combines interdisciplinary studies and leadership development shaping your career aspirations and personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you combined intellectual curiosity with leadership, and how it shaped your goals for future impact?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future goals, how do you see a program that emphasizes interdisciplinary learning and leadership development shaping your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a multidisciplinary, research-driven education shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see a future where academic excellence and interdisciplinary learning converge to drive your personal and professional aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your goals, how do you see a rigorous, interdisciplinary curriculum shaping your future career and personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a challenging project or idea that sparked your curiosity, and how you envision pursuing such passions in a rigorous academic environment?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see a program that challenges you to explore multiple disciplines helping you grow both personally and professionally?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see a research-focused, interdisciplinary education shaping your career aspirations and personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future goals, how do you see a rigorous, interdisciplinary academic environment shaping your personal growth and career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging academic goal, and how it sparked your curiosity to explore interdisciplinary approaches to learning?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a challenging intellectual experience that sparked your curiosity, and how you envision similar pursuits shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see an interdisciplinary, research-driven education propelling your growth and shaping your future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a rigorous, interdisciplinary curriculum shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see a challenging, interdisciplinary curriculum shaping your growth and preparing you for a dynamic, impactful career?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see an interdisciplinary, research-driven education propelling your personal growth and career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future aspirations, how do you see an interdisciplinary, research-driven education shaping your career and personal growth in a rapidly evolving world?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a holistic, interdisciplinary education fueling your growth and preparing you for a dynamic, impactful career?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you felt challenged to think critically across different subjects, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future aspirations, how do you see a rigorous, interdisciplinary learning environment shaping your growth and preparing you for impactful contributions?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see a rigorous, interdisciplinary learning environment shaping your personal growth and career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a complex problem that fascinates you, and how you'd approach solving it in a multidisciplinary team?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you felt inspired by interdisciplinary approaches, and how might such experiences shape your future academic pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a holistic, interdisciplinary education fueling your growth and preparing you for a rapidly evolving world?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future aspirations, how do you see an interdisciplinary, research-driven education shaping your personal growth and career trajectory?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see a research-intensive, interdisciplinary programme shaping your career aspirations or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a research-focused, interdisciplinary curriculum shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a multidisciplinary, research-driven education shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your aspirations, how do you see a rigorous, interdisciplinary learning environment shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future goals, how do you see an interdisciplinary approach to learning shaping your career path or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you felt challenged to think critically across multiple disciplines, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you combined academic rigor with innovative thinking, and how it shaped your aspirations for a multidisciplinary future?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you explored an interdisciplinary topic that sparked your curiosity, and how it might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your future, how do you see a program that combines leadership development and interdisciplinary studies shaping your career aspirations and personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced interdisciplinary learning to tackle a complex problem, and how did it shape your approach to future challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you ventured out of your comfort zone to pursue a challenging yet rewarding opportunity, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-initiated project or idea that you've developed, and how you balanced creativity with critical thinking to drive it forward?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a time when you embraced interdisciplinary learning to tackle a complex problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance academic rigor with innovative thinking, and how did you adapt to thrive in both aspects?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance multiple challenging commitments, and how did you adapt to thrive in such an environment?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance multiple passions or interests, and how you envision this skill benefiting your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-driven project where you integrated knowledge from multiple disciplines, and how it shaped your academic or personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance academic rigor with extracurricular responsibilities, and how did you adapt to thrive in both?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced interdisciplinary learning, and how do you think this approach will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a challenging project you led and how you balanced teamwork with independent decision-making to achieve success?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-driven project where you integrated multiple disciplines, and how this approach might shape your future academic or professional pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance multiple demanding commitments, and how did you adapt to thrive in each?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of how you've navigated a complex, open-ended challenge, and what skills did you develop through that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you balanced multiple challenging projects simultaneously, and how did you adapt to new information or unexpected challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-initiated project where you integrated multiple disciplines, and how did this experience shape your approach to complex problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-initiated project where you integrated knowledge from multiple disciplines to address a real-world issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-directed project where you balanced academic rigor with innovative thinking, and how it shaped your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you had to balance multiple challenging projects simultaneously, and how did you adapt to ensure success in each?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-directed project where you integrated multiple disciplines, and how did this experience shape your approach to complex problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a challenging intellectual pursuit you've undertaken and how it has shaped your approach to interdisciplinary learning?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced interdisciplinary learning to tackle a complex challenge, and how did it shape your approach to problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced interdisciplinary learning to tackle a complex problem, and how did this shape your approach to future challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance academic rigor with leadership responsibilities, and how did you adapt to the challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of how you've applied critical thinking to bridge gaps between diverse disciplines, and how this approach might shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of how you've applied critical thinking to bridge diverse perspectives, and how this skill might shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you balanced intellectual curiosity with community impact, and how did this experience shape your aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced interdisciplinary learning to tackle a complex problem, and how did that experience shape your approach to future challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a novel challenge that pushed your intellectual boundaries, and how did that experience shape your growth?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a self-driven project that challenged your perspectives, and how did this experience shape your approach to interdisciplinary learning?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge outside your comfort zone and how it shaped your growth?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge outside your comfort zone, and how did that shape your approach to interdisciplinary learning?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge outside your comfort zone and how it shaped your growth?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced an unconventional challenge that transformed your perspective, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge that pushed you beyond your comfort zone, and how did you adapt to achieve success?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you balanced academic rigor with innovative thinking, and how did this experience shape your approach to complex challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge outside your comfort zone and how it shaped your personal growth or future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of how you've pursued a passion project outside of academics, and how it's shaped your goals for interdisciplinary exploration?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you balanced multiple passions or interests, and how do you see such adaptability shaping your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance multiple challenging projects simultaneously, and how you adapted to thrive in that environment?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you embraced a challenge outside your comfort zone and how it reshaped your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced interdisciplinary learning to tackle a complex problem, and how did it shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance multiple demanding commitments, and how did you adapt to thrive in such a challenging environment?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your achievements, how do you think interdisciplinary learning and leadership development will shape your future goals and impact?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of how you've embraced a challenge outside your comfort zone, and what personal growth or new skills emerged from it?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a self-driven project that challenged your perspectives, and how you adapted to achieve personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you embraced an unconventional challenge that broadened your perspectives, and how it shaped your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance academic rigor with extracurricular passions, and how did that shape your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a challenging project where you had to integrate multiple disciplines, and how did this experience shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you balanced multiple challenging projects simultaneously, and how did you adapt to ensure success in each?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of how you've balanced intellectual curiosity with leadership, and how this blend might shape your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge outside your comfort zone and how it shaped your intellectual curiosity or leadership skills?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your academic journey, how do you think interdisciplinary learning and leadership development can shape your future impact in a rapidly changing world?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-initiated project that challenged your critical thinking and how you adapted to achieve your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment where you ventured out of your comfort zone to pursue an unconventional interest, and how did that shape your aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced interdisciplinary learning, and how did it shape your approach to solving complex, real-world problems?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you had to balance multiple passions or interests, and how did you prioritize them to achieve personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge that pushed you beyond your academic comfort zone, and how did you adapt?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance academic excellence with leadership or community involvement, and how you managed competing priorities?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-initiated project where you integrated knowledge from multiple disciplines to address a real-world problem, highlighting your adaptability and innovative thinking?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you balanced multiple challenging projects simultaneously, and how did you adapt to new information or unexpected obstacles?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance academic rigor with extracurricular commitments, and how did you adapt to thrive in both?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a complex problem you've tackled, and how you adapted your approach when initial solutions didn't work?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge outside your comfort zone, and how did that experience shape your academic or personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance multiple demanding commitments, and how you adapted to thrive in such a dynamic environment?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you balanced academic rigor with innovative thinking, and how did this experience shape your approach to complex challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge outside your comfort zone and how it shaped your intellectual curiosity or growth?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance academic rigor with leadership responsibilities, and how did you adapt to the challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance multiple challenging projects simultaneously, and how did you adapt to new information or unexpected challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of how you've navigated a complex, open-ended challenge, and what skills did you develop through that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a novel challenge that pushed your intellectual boundaries, and how did you adapt to thrive in it?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced interdisciplinary learning to tackle a complex challenge, and how did it shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflecting on your academic journey, how do you think interdisciplinary approaches can enhance your critical thinking for future complex, real-world challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a self-directed project where you balanced academic rigor with innovative thinking, and how did this experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-initiated project where you integrated multiple disciplines to address a real-world issue, and what skills did you develop through this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a challenging academic or personal project where you had to think critically and creatively to achieve success?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge outside your comfort zone and how it shaped your growth or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-driven project where you navigated complex, open-ended challenges, and how you adapted to uncertainty or unexpected outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge that pushed you beyond your comfort zone, and how did you adapt to achieve success?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge outside your comfort zone, and how did that experience shape your goals or perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you balanced multiple demanding projects simultaneously, and how did you adapt to new challenges in those situations?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-directed project where you integrated knowledge from multiple disciplines, and how did this experience shape your approach to complex problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you embraced an unfamiliar challenge? How did you adapt, and what skills did you develop through the process?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance academic rigor with leadership responsibilities, and how did you adapt to thrive in both roles?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance multiple challenging projects simultaneously, and how did you adapt to thrive in such an environment?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of how you've balanced multiple passions or interests in your life, and how this balance might shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a novel challenge that pushed your intellectual boundaries, and how did you adapt to achieve growth?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you embraced a challenge outside your comfort zone, and how it shaped your growth or career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you balanced academic rigor with extracurricular passions, and how did this experience shape your goals for interdisciplinary growth?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge that pushed your intellectual boundaries, and how did that experience shape your academic aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you ventured out of your comfort zone to pursue an unconventional interest, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-driven project where you balanced intellectual curiosity with real-world impact, and what skills did you develop through this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge outside your comfort zone, and how did it shape your approach to learning and growth?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge that pushed you beyond your comfort zone, and how did that experience shape your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of how you've balanced academic rigor with extracurricular passions, and how this balance might shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-initiated project where you integrated multiple disciplines to solve a real-world problem, and what did you learn from the process?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance academic rigor with extracurricular leadership, and how did you grow from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-initiated project where you integrated multiple disciplines to address a real-world issue, and what skills did you develop through this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a self-initiated project that challenged you to integrate knowledge from multiple disciplines, and how did this experience shape your approach to learning?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a challenging project you led, and how you balanced creativity with analytical thinking to achieve a successful outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging academic or personal goal that required resilience and innovative thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance academic rigor with leadership or innovation, and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance academic rigor with leadership responsibilities, and how did you grow from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge outside your comfort zone, and how did it shape your aspirations for a multidisciplinary future?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a challenging academic or personal project where you had to integrate multiple disciplines, and how did this experience shape your growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced interdisciplinary learning or tackled a complex, open-ended challenge that sparked your curiosity for growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your comfort zone, shaping your aspirations for a future leadership role?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a situation where you had to balance academic rigor with extracurricular commitments, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a challenging project or initiative you led, and how it shaped your approach to interdisciplinary learning and leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance academic rigor with leadership or community engagement, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of how you've taken initiative to pursue a challenging opportunity that aligns with your academic passions and why it mattered to you?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you embraced a challenge outside your comfort zone and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a passion project that combined multiple disciplines, and how did it shape your academic or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced interdisciplinary learning or tackled a complex, open-ended challenge that sparked your curiosity for growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge outside your comfort zone, and how it shaped your goals or self-perception?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance academic rigor with leadership responsibilities, and how it shaped your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your comfort zone, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your comfort zone, shaping your aspirations for a dynamic, interdisciplinary future?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that combined academic rigor with personal growth, shaping your aspirations for a multifaceted education?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance academic rigor with personal interests, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging goal that combined academic rigor with personal growth, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed your intellectual boundaries, and how it shaped your academic or personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your comfort zone, and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a passion project that combined multiple disciplines, and how it shaped your academic or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging intellectual interest outside your comfort zone and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced interdisciplinary learning or explored diverse subjects, and how did that shape your academic or personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your comfort zone, and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance academic rigor with leadership roles, and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance multiple challenging projects simultaneously, and how did you adapt to thrive in such situations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed your intellectual boundaries, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed your intellectual boundaries, and how it shaped your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your comfort zone, and how did you grow from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance academic rigor with leadership responsibilities, and how did that shape your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging goal that required balancing multiple priorities, and how did you adapt to succeed?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed your intellectual boundaries, and how it shaped your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed your intellectual boundaries, and how it shaped your academic aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your comfort zone, and how it shaped your growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Reflect on a time you pursued a challenging opportunity beyond your comfort zone - how did this shape your aspirations for interdisciplinary learning and growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you ventured out of your comfort zone to explore an unfamiliar subject or skill, and what did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your comfort zone, shaping your goals for future growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging opportunity that pushed you beyond your comfort zone, shaping your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you had to balance academic rigor with personal interests, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you balanced academic rigor with personal interests, and how did this shape your approach to interdisciplinary learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced interdisciplinary learning or explored unconventional connections between subjects, and how did this shape your academic pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you've pursued a challenging intellectual interest outside the curriculum that might shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge outside your comfort zone, and how did it shape your aspirations for a multifaceted education?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a passion project or explored an academic interest beyond your usual curriculum, and what did you gain from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging opportunity that aligned with your long-term goals, and how it shaped your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that combined academic rigor with personal growth, shaping your aspirations for a multidisciplinary future?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed your intellectual boundaries, and how it shaped your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your academic comfort zone, and how did you grow from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance academic rigor with leadership or community engagement, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging intellectual interest outside of academics, and how it shaped your goals or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your comfort zone, shaping your aspirations for a future leadership role?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging opportunity that aligned with your long-term goals, and how it shaped your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed your intellectual boundaries, and how it shaped your aspirations for interdisciplinary learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed your intellectual boundaries, and how did it shape your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a recent challenge where you had to balance academic rigor with leadership responsibilities, and how did you grow from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that combined academic rigor with personal growth, shaping your aspirations for a multifaceted future?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your comfort zone, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging intellectual interest outside of school, and how it shaped your academic or personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a challenging project or initiative you led, and how it shaped your approach to interdisciplinary collaboration or leadership?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your comfort zone, and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging opportunity that aligned with your long-term goals, and how it shaped your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you've embraced interdisciplinary learning or tackled a complex, open-ended challenge that sparked your curiosity for growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging opportunity that aligned with your long-term goals and how it shaped your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a moment when you pursued a challenge beyond your comfort zone, and how it shaped your aspirations for interdisciplinary learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued an unconventional interest outside your comfort zone, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a challenging project or initiative where you had to integrate knowledge from multiple disciplines, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed your intellectual boundaries, and how it shaped your aspirations for a rigorous academic journey?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge that combined academic rigor with personal growth, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a challenging project or initiative you led outside of academics, and how it shaped your approach to interdisciplinary problem-solving?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge that combined academic rigor with personal growth, and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging goal that combined academic rigor with personal growth, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced interdisciplinary learning, and how do you think this approach will shape your future academic or professional pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced interdisciplinary learning or solved a complex problem, and how it shaped your academic or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced interdisciplinary learning, and how do you think this approach will benefit your future growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced interdisciplinary learning, and how did it shape your approach to tackling complex, real-world problems?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you pursued a passion project that combined multiple disciplines, and how it shaped your approach to learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that combined academic rigor with leadership, shaping your aspirations for interdisciplinary growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance academic rigor with leadership or innovation, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an example of a challenging academic or personal project where you had to integrate multiple disciplines, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge that pushed you beyond your comfort zone, and how did you adapt to achieve success?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your comfort zone, and how it shaped your growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that transformed your perspective, and how it might shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced a challenge that combined academic rigor with leadership, and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced interdisciplinary learning or tackled a complex problem, and how it shaped your academic or personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed your intellectual boundaries, and how it shaped your academic aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed you beyond your comfort zone, shaping your aspirations for a transformative academic journey?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced interdisciplinary learning or tackled a complex, open-ended challenge that resonated with your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging opportunity that combined academic rigor with personal growth, shaping your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you describe a time when you embraced an interdisciplinary approach to solve a complex problem, and how did it shape your learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a passion project outside of academics, and how did it shape your goals for future growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you embraced a challenge that pushed your intellectual boundaries, and how it shaped your aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued an unconventional interest or talent, and how it shaped your goals or self-perception?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging goal, and how did overcoming obstacles shape your aspirations for a dynamic, interdisciplinary future?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a challenging intellectual interest outside your comfort zone, and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you pursued a passion project that required balancing creativity with academic rigor, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you had to balance academic rigor with leadership responsibilities, and how did that shape your growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Premier Scholars Programmes",
    "school": "NTU",
    "question": "Can you share an experience where you've taken the initiative to explore a topic beyond your comfort zone, and how it shaped your goals?",
    "criterion": "Experiences"
  }
]