[
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share a moment when understanding human behavior or motivations intrigued you, and how exploring this curiosity might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share a moment when understanding someone's behavior or thoughts fascinated you, and how did that spark your curiosity about the human mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding human behavior fascinated you, and how exploring this interest could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how would exploring these questions help shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you found human behavior intriguing, and how exploring its 'why' might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging situation, and how did that spark your curiosity about the mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself curious about why people behave the way they do, and how understanding this could impact your future relationships or career?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding human behavior or motivations fascinated you, and how exploring this interest could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever observed a behavior in others or yourself that sparked curiosity, and how do you think understanding its underlying reasons could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever observed a behavior or thought pattern that intrigued you, and what motivated you to understand its underlying causes?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or emotions sparked your curiosity, and how might exploring this field shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how you think exploring this curiosity could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Reflecting on your daily interactions, what aspects of human behavior or mental processes fascinate you the most and why?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share a moment when you were curious about human behavior, and how exploring those questions might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Reflecting on your own experiences, can you describe a moment where understanding human behavior helped you navigate a challenging social situation?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding someone's behavior or mindset fascinated you, and how you think studying this field could impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share a personal experience where understanding human behavior or emotions sparked your curiosity, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or emotions fascinated you, and how exploring this further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or mental processes helped you navigate a challenging situation, sparking your curiosity to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you found human behavior intriguing and how understanding it better could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or motivations helped you navigate a challenging situation, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever observed a behavior that puzzled you, and what sparked your curiosity to understand the underlying motivations or mental processes behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever observed a behavior that puzzled you, and what motivated you to understand the underlying reasons behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding someone's behavior or motivations sparked your curiosity, and how you think exploring this further could impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever observed a behavior that intrigued you, and what sparked your curiosity to understand the underlying motivations or emotions behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share a personal experience that sparked your curiosity about human behavior, and how do you see exploring this field shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how that curiosity might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding someone's behavior or mindset helped you navigate a challenging social situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you were curious about someone's behavior, and how understanding their motivations might help you in your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding someone's behavior or mindset fascinated you, and how you think studying this field could enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you found human behavior intriguing, and how exploring its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever wondered why people behave the way they do, and how understanding this could impact your future interactions or career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself wondering why people behave the way they do, and can you see yourself dedicating time to understanding human behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding someone's behavior or mindset fascinated you, and how exploring this interest could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Reflecting on your personal experiences, how do you think understanding human behavior could help you achieve your future goals or make a positive impact?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how would exploring these questions help shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how you think studying this field could further ignite that curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how understanding this could impact your future interactions or career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you were curious about someone's behavior or motivations, and how exploring that interest might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how would exploring these questions help shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself wondering why people behave the way they do, and how understanding this could shape your future interactions or career?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how would exploring these motivations impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how would exploring the human mind impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share a moment when understanding someone's behavior or mindset fascinated you, and how you think exploring this curiosity could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or emotions sparked your curiosity, and how you think exploring this field could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share a moment when understanding someone's behavior or thoughts fascinated you, and how exploring this curiosity might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or motivations sparked your curiosity, and how might exploring this field further impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself curious about why people behave the way they do, and how understanding this could impact your future interactions or career?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you found human behavior fascinating and how understanding it could impact your future goals or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how might exploring this field shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share a moment when understanding human behavior fascinated you, and how exploring this interest could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or emotions fascinated you, and how exploring this field could enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a social situation, and how did that spark your curiosity about the mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how understanding this could impact your future interactions or career?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding someone's behavior or motivations sparked your curiosity, and how you think exploring this field could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior fascinated you, and how you think exploring this further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Reflecting on your interactions with others, what aspects of human behavior or mental processes intrigue you the most and why do you want to explore them further?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how exploring this interest could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging situation, and how did that spark your curiosity about the mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you found human behavior intriguing, and how exploring its complexities might shape your future goals or self-awareness?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you tried to understand someone's behavior or motivations, and how did that spark your curiosity about the human mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this further could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging social situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever wondered why people behave in certain ways, and how understanding these behaviors could shape your future interactions or career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share a moment when you were curious about why someone behaved a certain way, and how did that spark your interest in understanding human behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Reflecting on your personal experiences, how do you think understanding human behavior could help you achieve your future goals or make a positive impact?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding someone's behavior or motivations sparked your curiosity, and how you think exploring this further could impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you found human behavior intriguing, and how understanding it could impact your future goals or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging situation, and how did that spark your curiosity about the mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share a moment when understanding human behavior fascinated you, and how exploring this curiosity might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever observed a behavior or emotion in yourself or others that sparked curiosity, and how do you think understanding its roots could impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share a personal experience where understanding human behavior or mental processes helped you navigate a challenging situation?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how understanding these behaviors could impact your future interactions or career?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this further could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or motivations sparked your curiosity, and how might exploring this field further impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever observed human behavior that intrigued you, and how do you think understanding its underlying causes could impact your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or emotions helped you, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or motivations sparked your curiosity, and how might exploring this further impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding someone's behavior or mindset fascinated you, and how you think exploring this curiosity could impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or emotions sparked your curiosity, and how might exploring this fascination benefit your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding someone's behavior or thoughts fascinated you, and how you think studying this field could enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or emotions sparked your curiosity, and how exploring this further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding someone's behavior or mindset fascinated you, and how exploring this interest could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or mental processes fascinated you, and how you think exploring this field could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations fascinated you, and how exploring this interest could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or motivations helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior fascinated you, and how exploring this interest could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding someone's behavior or mindset fascinated you, and how exploring this further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how would exploring these motivations impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how you think exploring this curiosity could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share a moment when understanding someone's behavior or mindset fascinated you, and how did that spark your curiosity about human nature?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how might exploring this curiosity benefit your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how you think exploring this field could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in this field?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their emotions or behaviors, and how did that experience shape your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior, and how did that shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively helped someone understand their behavior or emotions, and how did that experience inspire you to learn more?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when observing human behavior sparked your curiosity, and how would you systematically investigate the underlying motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you observed an interesting human behavior and tried to understand the motivations behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you observed an interesting human behavior and tried to understand the motivations behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their feelings or behaviors, and how did that impact your interest in studying human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior, and how did that impact your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an example of a time when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you observed human behavior that intrigued you, and how would you approach understanding the motivations behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and how did that experience shape your interest in this field?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their feelings or behaviors, and how did that impact your interest in human mindset?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in studying human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior, and how did that experience spark your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively supported a friend through a tough emotional situation, and what did you learn about human behavior from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior, and how did that shape your interest in human motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where observing human behavior sparked your curiosity, and how you think understanding it could benefit your future interactions or career?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior, and how did that experience shape your interest in human motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively supported a friend in distress, and what did you learn about human behavior from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and what strategies did you use in that situation?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively supported a friend or family member through a difficult emotional situation?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience spark your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you tried to understand someone's behavior or perspective that was very different from your own?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding someone's behavior or emotions helped you navigate a challenging social situation?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience spark your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you helped someone understand their behavior or emotions, and how did that experience shape your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you helped someone understand their behavior or emotions, and how did that experience spark your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding someone's behavior or motivations helped you navigate a challenging social interaction?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding someone's behavior or motivations helped you navigate a challenging social interaction, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where observing human behavior sparked your curiosity, and how do you think understanding it could benefit your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behavior, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when observing human behavior sparked your curiosity, and how you would systematically explore the underlying motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when observing human behavior sparked your curiosity, and how would you systematically explore the underlying reasons behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience spark your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where observing human behavior sparked your curiosity, and how would you systematically explore the underlying reasons behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you effectively helped someone understand their behavior, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding someone's behavior or motivations helped you navigate a challenging social interaction, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you effectively supported a friend in distress, and what did you learn about human behavior from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in human mindset?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively supported a friend through a tough situation, and what did you learn about human behavior from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in this field?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you observed human behavior that intrigued you, and how you would systematically investigate the underlying reasons behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively supported a friend in distress, and how did that experience shape your understanding of human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and what strategies did you use to support them?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where observing human behavior sparked your curiosity, and how would you systematically investigate the underlying motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where observing human behavior sparked your curiosity, and how would you systematically explore the underlying motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you helped someone understand their feelings or behaviors, and how did that experience shape your interest in studying human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior, and how did that shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively supported a friend or family member through a tough emotional situation, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you effectively helped someone understand their behavior or emotions, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively helped someone understand their emotions or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you tried to understand someone's behavior or perspective that was very different from your own?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding human behavior helped you navigate a challenging social interaction, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you effectively supported a friend in distress, and what did you learn about human behavior from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where understanding someone's behavior or emotions helped you navigate a challenging social interaction, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you effectively helped someone understand their feelings or behaviors, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience spark your curiosity about human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in learning more?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed or influenced human behavior, and what sparked your curiosity about the underlying motivations?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when observing human behavior sparked your curiosity, and how did you explore or learn more about it afterwards?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior that sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you helped someone understand their behavior or emotions, and how did that experience impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a situation where you helped someone understand their behavior or emotions, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you observed an interesting human behavior, and how did that spark your curiosity to learn more about its underlying reasons?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior, and how did that spark your curiosity about the mind or behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior that sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when observing human behavior or personal interactions sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that shape your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience shape your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior, and how did that spark your curiosity about the mind or behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior that sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior that sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when observing human behavior sparked your curiosity, and how did you explore or learn more about it afterwards?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior that sparked your curiosity, and how you think understanding it could impact your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand their emotions or behaviors, and how did that experience impact your curiosity about human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in learning more about human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when observing human behavior sparked your curiosity, and how you explored or learned more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand their feelings or behaviors, and how did that experience impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed or interacted with someone from a different background - how did it shape your understanding of human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand their feelings or behaviors, and how did that experience impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior that sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you observed an interesting human behavior, and how did it spark your curiosity to learn more about the mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you observed an intriguing human behavior and wondered about its underlying causes or motivations?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior, and how it sparked your curiosity about the mind or behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed or interacted with someone whose behavior or decision-making process intrigued you, and how did that spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where observing human behavior or helping someone influenced your curiosity about the mind or behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior that sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where observing human behavior sparked your curiosity, and how you think understanding people better could shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior that sparked your curiosity, and how you think understanding it could impact your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that shape your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you observed human behavior that sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where observing human behavior or a personal interaction sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand their feelings or behaviors, and how did that experience impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about human minds?",
    "criterion": "Experiences"
  }
]