[
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these themes shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where understanding social dynamics or cultural differences helped you navigate a challenging situation?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Reflecting on your own community, what social issues intrigue you to understand and address, potentially shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring such dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an everyday social issue that intrigues you, and how understanding its complexities might shape your future goals or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Have you ever observed social inequalities in your community, and how do you think studying human societies could help address such issues in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Have you ever noticed social inequalities in your community, and how do you think understanding these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where observing social interactions sparked your curiosity, and how might exploring these dynamics further enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how might exploring such dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human interactions sparked your curiosity, and how you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how understanding its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how might exploring these dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how do you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Have you ever noticed social inequalities in your community, and how do you think studying human societies could empower you to address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Have you ever noticed social inequalities in your community, and how do you think understanding these issues could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore these interests further?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these themes shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how do you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Have you ever observed social inequalities or cultural differences that sparked your curiosity to understand how societies function and evolve?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how might exploring these dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human interactions sparked your curiosity, and how you think studying these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Reflecting on your own community, what social issues fascinate you to explore further, and how do you think understanding these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human interactions sparked your curiosity, and how exploring these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a social issue you're passionate about understanding or addressing, and how studying human societies might help you make a meaningful impact?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying this could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Have you ever observed social inequalities or cultural differences that sparked your curiosity to understand the underlying reasons and potential solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how exploring these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Have you ever observed social inequalities in your community, and how do you think studying human societies could help address such issues in your future endeavors?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Have you ever noticed social inequalities in your daily life, and how do you think understanding these issues could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did that experience shape your thoughts about your future studies or career?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Have you ever noticed social inequalities in your community, and how do you think studying human societies could help address such issues in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these themes further enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these themes shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a moment when observing human behavior sparked your curiosity, and how exploring such dynamics might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Reflecting on your own community, what social issues intrigue you to understand better, and how do you think studying human behaviors could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these themes further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Reflecting on your daily life, what social issues or patterns have sparked your curiosity, and how do you hope to explore them further in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Have you ever observed social inequalities in your community, and how do you think studying human societies could help address such issues in your future endeavors?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human behavior or social interactions sparked your curiosity, and how you think exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of a social issue you're passionate about, and how studying human societies might help you address it in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where understanding social dynamics or cultural differences sparked your curiosity, and how might exploring these themes further impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might studying these dynamics shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how exploring these dynamics could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human interactions or societal norms sparked your curiosity, and how might exploring these dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where you noticed social inequalities, and how do you think understanding these issues could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these themes further enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Reflecting on your daily life, what aspects of how people interact, behave, or shape societies fascinate you the most and why?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how studying these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how understanding it better could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Have you ever observed social differences in your community, and how do you think understanding these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Have you ever noticed social inequalities in your community, and how do you think studying human societies could help address such issues in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Reflecting on your observations of social interactions, what aspects of how societies function or change spark your curiosity and desire to explore further?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did that moment influence your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its complexities might shape your future goals or daily interactions?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Reflect on a social issue you're passionate about - how do you think studying human societies and behaviors could empower you to drive meaningful change?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how might exploring these dynamics shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of a social issue that intrigues you, and how understanding its complexities might shape your future goals or worldview?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human interactions sparked your curiosity, and how studying these dynamics could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a social issue that sparks your curiosity, and how exploring its complexities might shape your future goals or worldview?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where understanding social dynamics or cultural differences helped you navigate a challenging situation?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying human societies could enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these themes shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where you noticed social inequalities or cultural differences, and how did that spark your curiosity about human societies?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these themes further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Have you ever noticed social inequalities in your daily life, and how do you think studying human societies could help address such issues in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how you think studying human behavior could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how exploring its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity about how societies function?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Reflecting on your own community experiences, what aspects of how societies function or inequality arises would you explore further to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its complexities might shape your future goals or worldview?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Reflecting on your own community, what social issues intrigue you to understand better, and how do you think studying human societies could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where observing social interactions sparked your curiosity, and how might exploring this fascination shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where understanding social groups or cultural differences sparked your curiosity, and how might exploring this further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding human behaviors might help address it in your future endeavors?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might studying human societies further ignite that interest?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social differences or interactions sparked your curiosity, and how might exploring these dynamics shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Reflect on a time you noticed social inequalities; how do you think understanding these dynamics could shape your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Reflecting on your own community, what social issues intrigue you, and how do you think studying human behaviors could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how you think studying these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you explored these interests further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you systematically explore this fascination?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how would you analyze these dynamics in a new, unfamiliar environment?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how did you explore or make sense of what you noticed?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how would you systematically explore this fascination in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing human interactions in your daily life sparked your curiosity, and how would you analyze that situation?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore or reflect on these observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your community sparked your curiosity, and how you think studying these dynamics could shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior and societal norms?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions around you sparked curiosity, and how would you explore this further in an academic setting?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing human interactions sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you analyze these dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where you observed social differences, and how would you investigate the root causes if given the opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how did you explore or make sense of what you saw?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore or reflect on these observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore these observations further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior or societal norms?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you systematically explore this observation?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior or societal norms?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of a social issue that intrigues you, and how you'd approach understanding its root causes and impacts?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your community sparked your curiosity, and how would you systematically explore this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your community sparked your curiosity, and how would you systematically explore this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing human interactions in a public space sparked your curiosity, and how would you systematically study this phenomenon?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity to understand human behavior better?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your community sparked your curiosity, and how did you explore or respond to these observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when you noticed social inequalities, and how would you approach understanding the root causes of such issues?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions around you sparked curiosity, and how would you systematically explore those observations further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of a social issue that intrigues you, and how you'd approach understanding its root causes and impact on communities?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore or learn from this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how you'd systematically explore the underlying dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where observing social interactions helped you understand a group's behavior or norms?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you investigate this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you investigate this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you analyze those dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you explore this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions around you sparked curiosity, and how you might explore this further in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore these observations further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior or societal norms?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn more?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior and societal structures?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing human interactions in your daily life sparked your curiosity, and how did you explore those observations further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore these observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where observing social interactions helped you understand a group's behavior or norms better?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you systematically explore this fascination?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how would you analyze the underlying dynamics at play?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where you observed social differences or inequalities, and how would you go about understanding the root causes?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where you observed social differences, and how would you analyze their impact on individual opportunities?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of a social issue that fascinates you, and how you'd approach understanding its root causes in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how would you systematically study this phenomenon?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity to understand human behavior better?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying human behavior could shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity to understand human behavior better?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing human interactions in your daily life sparked your curiosity, and how would you systematically explore that interest further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how you would systematically explore the underlying dynamics at play?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions in your community sparked your curiosity, and how did you explore these dynamics further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how you explored or addressed these observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you analyze those dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions around you sparked your curiosity, and how did you explore or make sense of them?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of a social issue that intrigues you, and how would you go about understanding its root causes and impacts?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your community sparked your curiosity, and how did you explore those observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing human interactions sparked your curiosity, and how would you systematically study this phenomenon?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of a social issue that intrigues you, and how you would approach understanding its root causes and impact on communities?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you explored or addressed it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human interactions sparked your curiosity, and how would you systematically study those dynamics if given the opportunity?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing human interactions in your daily life sparked your curiosity, and how you would systematically explore this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of a social issue that intrigues you, and how you'd approach understanding its root causes in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how you explored or addressed those observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how you'd approach understanding its root causes in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior or societal norms?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how you'd apply those insights to address a community challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing human interactions in a public space sparked your curiosity, and how would you analyze the social dynamics at play?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing human interactions in your daily life sparked your curiosity, and how you would investigate this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing human interactions sparked your curiosity, and how would you systematically explore the underlying social dynamics at play?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions in your daily life sparked your curiosity, and how did you explore these observations further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions around you sparked curiosity, and how did you explore or make sense of those observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing human interactions in your daily life sparked your curiosity, and how did you explore those observations further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how you explored or addressed it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did that shape your views on society?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human behavior or social interactions sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social differences or interactions sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore these interests further?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human interactions or social issues sparked your curiosity, and how did you engage with or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore these interests further?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you engage with the situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing human interactions or social norms sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human interactions or social issues sparked your curiosity, and how did you engage with or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human interactions or social issues sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or reflect on it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you engage with or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human interactions or social dynamics sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or reflect on it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or reflect on it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human interactions or social issues sparked your curiosity, and how did you explore or address it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human behavior or social interactions sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social differences or interactions sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did that shape your views on society?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did that shape your understanding of human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore these interests further?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to this interest?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social differences or inequalities sparked your curiosity, and how did you explore or address it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or reflect on this further?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore these interests further?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human behavior or social interactions sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human interactions or social issues sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you share an experience where observing human interactions or cultural differences sparked your curiosity, and how you explored or learned from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "NUS",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  }
]