[
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these themes shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where understanding social dynamics or cultural differences sparked your curiosity, and how you think exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where understanding social dynamics or cultural differences helped you navigate a challenging situation?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Have you ever observed social inequalities in your community, and how do you think studying human societies could empower you to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Have you ever noticed social inequalities in your community, and how do you think understanding these dynamics could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its complexities might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Have you ever observed social differences in your community that sparked your curiosity to understand the underlying reasons or patterns behind them?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did that experience influence your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an everyday observation that sparked your curiosity about how societies function, and how might exploring this further impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these themes further enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where understanding social dynamics or cultural differences helped you navigate a challenging situation?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how exploring its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where understanding social dynamics or human behavior sparked your curiosity, and how might exploring this further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a social issue that fascinates you, and how understanding its complexities might shape your future goals or worldview?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how you think studying human behavior could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these themes further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these themes shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how you think studying human behavior could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how might exploring such dynamics shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how you think studying human behavior could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring such dynamics might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these themes shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring such dynamics could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social differences or interactions sparked your curiosity, and how might studying these dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Reflect on a time you noticed social inequality; what sparked your curiosity to understand the root causes of such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social differences or interactions sparked your curiosity, and how might exploring such dynamics shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Have you ever observed social inequalities in your community, and how do you think understanding these dynamics could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human behavior sparked your curiosity, and how you think studying this could shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social differences or interactions sparked your curiosity, and how might exploring these dynamics shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a social issue that sparks your curiosity, and how understanding its complexities might shape your future goals or worldview?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where understanding social dynamics or cultural differences sparked your curiosity about how societies function?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics further enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where understanding social dynamics or cultural differences helped you navigate a challenging situation?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where understanding social dynamics or cultural differences helped you navigate a challenging situation?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Reflecting on your daily interactions, what aspects of how people behave or societal norms intrigue you, and how might exploring these interests shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social differences or interactions sparked your curiosity, and how might exploring these dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions sparked your curiosity, and how do you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore those interests further?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human behavior or social interactions sparked your curiosity, and how exploring this further might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Reflecting on your daily interactions, what aspects of how people behave or societal norms intrigue you, and how might studying these dynamics shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how might exploring these dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how you think studying human behavior could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how might studying these dynamics shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where understanding social dynamics or cultural differences helped you navigate a situation, and why was that insight valuable?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where understanding social dynamics or cultural differences sparked your curiosity, and how might exploring this further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Have you ever noticed social inequalities in your community, and how do you think studying human societies could help you address such issues in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an everyday observation of social interactions that sparked your curiosity, and how exploring such dynamics might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions or social issues sparked your curiosity, and how might exploring these dynamics shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying human societies could enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions or social issues sparked your curiosity, and how exploring this further might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how studying human behavior might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Reflecting on your daily interactions, what aspects of how people behave or societal norms intrigue you, and how might studying these dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a social issue you're passionate about and how studying human behavior might help you drive meaningful change in that area?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore this fascination?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how might exploring human behavior further shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying human behavior could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a moment when observing social interactions sparked your curiosity, and how you think studying these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how might exploring these dynamics shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of a social issue that intrigues you, and how understanding its root causes might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Have you ever observed social inequalities or cultural differences that sparked your curiosity, and how do you think studying these aspects could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how understanding its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social dynamics or cultural differences sparked your curiosity, and how might exploring this further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions sparked your curiosity, and how you think studying these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Have you ever noticed social inequalities or cultural differences in your daily life, and how do you think studying these phenomena could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human behavior or social interactions sparked your curiosity, and how you think studying these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where understanding social differences or behaviors sparked your curiosity, and how might exploring these themes further enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions or societal issues sparked your curiosity, and how you think studying these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how exploring these dynamics could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human behavior or social interactions sparked your curiosity, and how might exploring these dynamics further enrich your life?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying these dynamics could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might studying human behavior shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where understanding social dynamics or cultural differences sparked your curiosity, and how might exploring this further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how might exploring these dynamics shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Have you ever noticed social inequalities or cultural differences in your daily life that sparked your curiosity to understand human societies better?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of a social issue that sparks your curiosity, and how understanding its complexities might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions sparked your curiosity, and how studying these dynamics could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where understanding social dynamics or cultural differences sparked your curiosity, and how might exploring these themes further impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of how observing social interactions in your daily life has influenced your understanding of human behavior or societal norms?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity to understand human behavior better?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how did you explore or make sense of what you noticed?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing human interactions in a public space sparked your curiosity, and how would you analyze that situation today?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you analyze those dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how would you systematically explore the underlying dynamics at play?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you explore this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how you'd apply those insights to address a community issue?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where you observed social differences, and how would you analyze their impact on individual opportunities?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how you explored or reflected on these observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how you explored or reflected on these observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of how observing social interactions in your daily life has influenced your understanding of human behavior or societal norms?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore or make sense of them?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of a social issue that intrigues you, and how you'd approach understanding its root causes in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing human interactions sparked your curiosity, and how would you systematically study this phenomenon?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of a social issue you're passionate about and how you'd approach understanding its root causes in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions helped you understand a community's values or norms?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions around you sparked curiosity, and how would you explore this further in an academic setting?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think studying these dynamics could shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how would you systematically explore the underlying dynamics at play?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how you'd apply that curiosity to understand societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing a social group or interaction sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of a social issue you're passionate about and how you'd approach understanding its root causes in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions in a public space sparked your curiosity, and how would you systematically study this phenomenon?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore or make sense of them?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing human interactions in a public space sparked your curiosity, and how did you explore those observations further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity to understand human behavior better?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing human interactions or social norms sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you systematically explore this phenomenon further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how you explored these observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how you explored or addressed these observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing human interactions or social norms sparked your curiosity, and how you explored or addressed these observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions sparked your curiosity, and how would you apply those insights to drive positive social change?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where you observed social differences, and how would you investigate the root causes if given the chance?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how you think studying these dynamics could shape your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your community sparked your curiosity, and how would you systematically explore this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions in your daily life sparked your curiosity, and how you think studying human behavior could shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior or societal norms?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing human interactions in your daily life sparked your curiosity, and how would you systematically explore this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where you observed social differences or inequalities, and how would you analyze or address them in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore or make sense of them?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your community sparked your curiosity, and how you'd investigate the underlying dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions in your daily life sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where you noticed social inequalities, and how would you go about addressing them in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you analyze those dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn more?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions in your daily life sparked your curiosity, and how you'd apply that insight to drive positive change?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing human interactions in your daily life sparked your curiosity, and how would you explore this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how did you explore or learn more about the underlying dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions around you sparked your curiosity, and how did you explore or make sense of those observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your community sparked your curiosity, and how would you systematically explore this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of a social issue that intrigues you, and how you'd approach understanding its root causes and potential solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of a social issue that intrigues you, and how would you approach understanding its root causes and impacts on communities?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of a social issue that intrigues you, and how you'd approach understanding its root causes in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior and relationships?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing human interactions sparked your curiosity, and how would you systematically explore the underlying social dynamics at play?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you systematically study this phenomenon?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of a social issue that intrigues you, and how would you go about understanding its root causes in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where you observed social inequalities, and how would you approach understanding the root causes?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your community sparked your curiosity, and how would you systematically explore this fascination?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions around you sparked curiosity, and how would you systematically explore those dynamics further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where you noticed social inequalities, and how would you go about understanding the root causes?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your community sparked your curiosity, and how would you systematically explore this phenomenon?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how did you explore or reflect on these observations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior or societal norms?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing human interactions sparked your curiosity, and how did you explore or make sense of what you noticed?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions around you sparked curiosity, and how would you systematically explore those dynamics further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you systematically explore this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of how observing social interactions in your daily life has helped you better understand people's behaviors or motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions sparked your curiosity, and how you'd apply this curiosity to understand societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how you'd investigate them further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where you observed social inequalities, and how would you approach understanding the root causes?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing human interactions in your daily life sparked your curiosity, and how would you explore this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you analyze those dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing human interactions sparked your curiosity, and how would you systematically explore those dynamics further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how would you explore this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example of how observing social interactions in your daily life has sparked your curiosity about human behavior or societal norms?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions in your daily life sparked your curiosity, and how you'd explore this further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how you explored or addressed it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions in your daily life sparked your curiosity, and how you'd apply this curiosity to understand societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an example from your life where observing social interactions or cultural differences sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions or societal norms sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social dynamics or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human behavior or social interactions sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you engage with or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did that shape your perspective on community dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social dynamics or cultural differences sparked your curiosity, and how did you engage with the situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to these observations?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you engage with or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions or social issues sparked your curiosity, and how did you engage with or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you engage with or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to that interest?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from this experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions or social dynamics sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social dynamics or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions or social issues sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions or social issues sparked your curiosity, and how did you engage with or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social dynamics or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social dynamics or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you engage with or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human behavior or social interactions sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you engage with the situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you describe a time when observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing human interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you engage with or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or respond to it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sociology",
    "school": "SMU",
    "question": "Can you share an experience where observing social interactions or cultural differences sparked your curiosity, and how did you explore or learn from it?",
    "criterion": "Experiences"
  }
]