[
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the cultures, histories, or societies of Southeast Asia, and how exploring this region further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia, and how do you think this exploration could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever wondered how understanding the diverse cultures and histories of Southeast Asia could shape your global perspective or career opportunities?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the cultures, histories, or societies of Southeast Asia, and how do you see this interest shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia, and how exploring this region further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or contemporary issues of Southeast Asia that spark your curiosity for deeper learning?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the diverse cultures, histories, or societies of Southeast Asia?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that sparked your curiosity about its regional dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures or histories of Southeast Asia, and how do you think this exploration could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that sparked your curiosity and why?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that sparked your curiosity for deeper learning?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that spark your curiosity for deeper learning?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures of Southeast Asia, and how do you think understanding this region could shape your global perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures or histories of Southeast Asia, and how might this exploration shape your future goals or perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that sparked your curiosity or inspired personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures of Southeast Asia, and how might this exposure shape your global perspective or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Could you share how exploring the diverse cultures, histories, or contemporary issues of Southeast Asia might enrich your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how the diverse cultures, histories, or current events in Southeast Asia might shape your global perspective or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures of Southeast Asia, and how do you think understanding this region could shape your global perspective or career?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures of Southeast Asia, and how do you think understanding this region could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how the cultural diversity of Southeast Asia shapes identities, and how exploring this could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the diverse cultures, histories, or current events of Southeast Asia, and how might exploring these interests shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia, and if so, what sparked your curiosity about this region?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how historical events in Southeast Asia continue to influence the region's cultures and societies today?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the diverse cultures, histories, or current events of Southeast Asian countries, and why does exploring these aspects excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the diverse cultures of Southeast Asia, and how do you see this knowledge shaping your global perspectives or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia, and how might these explorations shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the cultures, histories, or societies of Southeast Asia, and how might exploring this region further shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the cultural diversity of Southeast Asia, and how might exploring its histories and societies shape your global perspective?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the diverse cultures, histories, or societies of Southeast Asia?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored how the cultural, historical, or political dynamics of Southeast Asia could enrich your career or personal growth in a globalized world?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the diverse cultures, histories, or contemporary issues of Southeast Asia?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored how understanding the diverse cultures and histories of Southeast Asia could enrich your global perspective or shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures of Southeast Asia, and how might understanding this region shape your future career or personal journey?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you encountered any cultural practices or historical events from Southeast Asia that sparked your curiosity and why did they resonate with you?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how historical events in Southeast Asia might shape your understanding of its diverse cultures today?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the diverse cultures, histories, or current events of Southeast Asia that spark your curiosity about its regional significance?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that sparked your curiosity for deeper learning?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures of Southeast Asia, and how do you think understanding this region could shape your global perspective and career?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how historical events in Southeast Asia continue to influence the region's cultures and societies today?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that sparked your curiosity about its regional significance?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures of Southeast Asia, and how do you think understanding this region could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you encountered any aspect of Southeast Asian culture, history, or society that fascinates you, and how might exploring it further shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that spark your curiosity for deeper understanding?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the diverse cultures, histories, or current events of Southeast Asia, and how might exploring these themes shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the diverse cultures, histories, or current events of Southeast Asia, and how might exploring these aspects shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia, and how might these aspects shape your future goals or perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia, and if so, what sparked your curiosity about this region?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that sparked your curiosity for deeper learning?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that sparked your curiosity about its people and societies?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Reflecting on your own heritage or travels, what aspects of Southeast Asia's diverse cultures or histories genuinely fascinate you, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia, and how might these explorations shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the diverse cultures of Southeast Asia, and how might understanding this region shape your global perspectives or career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the diverse cultures or historical events in Southeast Asia, and how might exploring these aspects shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you encountered any cultural practices or historical events in Southeast Asia that sparked your curiosity, and how might exploring these further enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience or topic related to Southeast Asian cultures, histories, or societies that genuinely fascinates you and why?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that sparked your curiosity to learn more about this region?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the diverse cultures, histories, or contemporary issues of Southeast Asia?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the cultural, historical, or political aspects of Southeast Asia that excite you, and how might these interests shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures or histories of Southeast Asia, and how might this exploration shape your global perspective or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that sparked your curiosity for deeper understanding?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever encountered a cultural practice or historical event in Southeast Asia that sparked your curiosity, and how did it influence your desire to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures or historical events of Southeast Asia that sparked your curiosity about their impact on our globalized world?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures of Southeast Asia, and how do you think this exploration could shape your global perspective and career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you encountered any cultural or historical aspects of Southeast Asia that sparked your curiosity, and how do you see exploring these further shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share a moment when learning about a Southeast Asian culture sparked your curiosity, and how exploring it further might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures or histories of Southeast Asia, and how do you think this exploration could enrich your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that sparked your curiosity, and how do you see this fascination shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you encountered any cultural, historical, or social aspects of Southeast Asia that sparked your curiosity, and how might exploring these further enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Reflecting on your personal experiences or interests, how do you think exploring the diverse cultures, histories, and societies of Southeast Asia could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the diverse cultures, histories, or societies of Southeast Asia, and how exploring this region further might enrich your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia, and how might these explorations shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the cultures, histories, or contemporary issues of Southeast Asian societies?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you encountered a moment where understanding a Southeast Asian culture or history deeply fascinated you, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how historical events in Southeast Asia continue to shape the region's diverse cultures and societies today?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that sparked your curiosity and why do they fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the cultural diversity or historical events of Southeast Asia, and how might exploring these aspects shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how cultural, historical, or political events in Southeast Asia might shape your global perspective or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever encountered a cultural practice from Southeast Asia that fascinated you, and how do you think exploring such diversity could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures or histories of Southeast Asia, and how might this exploration shape your global perspective or career?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the diverse cultures, histories, or contemporary issues of Southeast Asian regions?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that spark your curiosity about its complexities and connections to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the diverse cultures, histories, or societies of Southeast Asia, and how might exploring these interests further enrich your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures of Southeast Asia, and how might understanding these differences shape your global perspectives or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that sparked your curiosity for deeper learning?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures or histories of Southeast Asian countries, and how might this exploration shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored how understanding diverse Southeast Asian cultures might shape your global perspectives or career paths in a rapidly changing world?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures of Southeast Asia, and how do you think this exploration could enrich your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how historical events in Southeast Asia influence its modern-day cultures, and how exploring this intersection could shape your global perspective?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures, histories, or current events of Southeast Asia that spark your curiosity and relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been curious about how historical events in Southeast Asia continue to shape the region's diverse cultures and societies today?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you encountered any aspect of Southeast Asian culture, history, or society that fascinates you, and how might exploring this region deepen your understanding of our interconnected world?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever been fascinated by the diverse cultures, histories, or current events of Southeast Asia, and how might exploring these aspects enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you encountered any cultural practices or historical events in Southeast Asia that sparked your curiosity, and how do you see exploring these further enriching your future?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored how understanding the diverse cultures and histories of Southeast Asia might shape your global perspective or career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the diverse cultures of Southeast Asia, and how do you think understanding this region could enrich your future career or personal journey?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you encountered any cultural practices or historical events in Southeast Asia that sparked your curiosity, and how do you see exploring them shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you encountered any cultural practices or historical events in Southeast Asia that sparked your curiosity, and how might exploring these further enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience or encounter that sparked your curiosity about the diverse cultures, histories, or contemporary issues of Southeast Asia?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Could you share an aspect of Southeast Asian culture, history, or society that genuinely fascinates you and how exploring it might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture helped you understand a social issue, and how would you apply that insight in a multicultural setting?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a diverse culture or history sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture, different from your own, has sparked your curiosity or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Southeast Asian culture challenged your assumptions, and how did that shape your worldview?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture different from your own sparked your curiosity, and how did you explore it further?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture, different from your own, has influenced your perspective or decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Southeast Asian culture or history sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture helped you understand a social issue, and how would you apply that insight in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture, different from your own, has influenced your perspective or sparked your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Southeast Asian culture or history sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture different from your own sparked your curiosity, and how did you deepen your understanding of it?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Southeast Asian culture challenged your assumptions, and how did that shape your worldview?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture sparked your curiosity, and how do you think this relates to understanding regional dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a Southeast Asian culture, and how it sparked your curiosity about the region's diversity and interconnectedness?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Southeast Asian culture or history sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think understanding diverse Southeast Asian perspectives could enrich your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about diverse cultures has influenced your perspective, and how might this skill benefit your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Could you share an example of how learning about a region's history and culture has influenced your perspective on global issues or your own identity?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the cultural differences within your own community, and how might understanding these nuances shape your approach to working in a diverse Southeast Asian?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture sparked your curiosity, and how did that shape your goals or perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture, different from your own, has sparked your curiosity or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture or history has influenced your perspective or sparked your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about diverse cultures has influenced your perspective, and how might this skill benefit your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Southeast Asian culture surprised you, and how that sparked your curiosity for deeper exploration?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture, different from your own, has sparked your curiosity or challenged your perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring diverse cultures or histories has sparked your curiosity, and how might this interest shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture different from your own sparked curiosity, and how might such exploration shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Southeast Asian culture sparked your curiosity, and how might exploring such cultures shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about diverse cultures has influenced your perspective, and how might this shape your future interactions in a multicultural setting?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture, different from your own, has broadened your perspective or sparked your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a cultural practice different from your own, and how it broadened your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about diverse cultures has influenced your perspective, and how might this shape your future interactions or career?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture or historical event has influenced your perspective or sparked your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture different from yours sparked curiosity, and how did you deepen that interest?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Southeast Asian culture challenged your assumptions, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a region's culture, history, or languages has sparked your curiosity or influenced your goals?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the cultural differences within your own community, and how might understanding these differences shape your approach to a diverse, interconnected world?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or history sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Could you share an example of how learning about diverse cultures has influenced your perspective, and how might this shape your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a cultural practice different from your own, and how it broadened your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think understanding Southeast Asia's diverse societies could enrich your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a cultural practice different from your own, and how it shaped your perspective on diversity?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a Southeast Asian culture, and how did that shape your curiosity about the region's diverse societies?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture sparked your curiosity, and how do you think exploring diverse societies will shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture different from your own sparked your curiosity, and how you think this relates to your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture or history has broadened your perspective or sparked your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a region's culture or history has influenced your perspective, and how might this curiosity shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture, different from your own, has sparked your curiosity or challenged your assumptions?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or history sparked your curiosity, and how do you think this relates to your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture different from yours sparked curiosity, and how did that shape your views on community or identity?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a diverse culture or history sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how understanding a region's cultural diversity has influenced your perspective or decision-making in a personal or academic?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or historical event sparked your curiosity, and how did you delve deeper into it?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the cultural diversity of Southeast Asia in your studies or travels, and how might this exposure shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture, different from your own, has influenced your perspective or sparked your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Could you share how exploring the diverse cultures and histories of Southeast Asia might shape your global perspective or influence your future career choices?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever navigated a cultural misunderstanding? How would you approach building bridges between diverse Southeast Asian communities in your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a cultural difference that sparked your curiosity, and how you adapted to or learned from it?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture challenged your assumptions, and how did that shape your worldview?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about diverse cultures has influenced your perspective, and how might this skill benefit your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about diverse cultures has broadened your perspective, and how might this skill benefit your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture helped you navigate a challenging social situation, and how did you apply that understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a diverse culture or history sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture or history has influenced your perspective or sparked your curiosity somehow?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring diverse cultures or histories has influenced your perspective, and how might this curiosity shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about diverse cultures has influenced your perspective, and how might this shape your future interactions or career choices?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture or history has broadened your perspective or sparked your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a Southeast Asian culture different from your own, and how it broadened your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Southeast Asian culture sparked your curiosity, and how you think this curiosity might shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture or history sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture, different from your own, has broadened your perspective or sparked your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about diverse cultures has influenced your perspective, and how might this curiosity benefit your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about diverse cultures has influenced your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you navigated cultural differences, and how do you think understanding diverse Southeast Asian perspectives could enrich your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring diverse cultures, like those in your community, has sparked your curiosity about the interconnectedness of societies?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Southeast Asian culture or history sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a culture different from your own challenged your assumptions, and how did that shape your worldview?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a diverse culture or history sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how understanding a diverse culture, different from your own, has influenced your perspective or decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a Southeast Asian culture different from your own, and how did that shape your perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture helped you adapt or solve a problem, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture, different from your own, has broadened your perspective or sparked your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a different culture sparked your curiosity, and how do you think this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about diverse cultures has broadened your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Southeast Asian culture or history sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring diverse cultures or histories has influenced your perspective, and how you think this curiosity could shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Southeast Asian culture sparked your curiosity, and how you think this curiosity could shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how exploring a region's history and culture has influenced your perspectives, and how might this curiosity shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about diverse cultures has broadened your perspective, and how might this curiosity benefit your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture different from your own sparked your curiosity, and how did you engage with it?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a Southeast Asian culture different from your own, and how it sparked your curiosity about the region?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how understanding diverse cultural perspectives has helped you navigate a challenging social situation, and how might this skill be valuable in your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a cultural practice different from your own, and how it broadened your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored the cultural diversity of Southeast Asia, and how do you think understanding this region could shape your global perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example from your life where exploring a diverse culture or history sparked your curiosity, and how did you delve deeper into it?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a different culture helped you understand a global issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about a Southeast Asian culture or history has broadened your perspective, and how might this continue to shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture different from your own sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an example of how learning about diverse cultures has influenced your perspective, and how might this continue to shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a culture different from yours sparked curiosity, and how might such exploration shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asian cultures, and how do you think exploring this region will shape your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, language, or history sparked your curiosity, and how might this interest shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or current events in ways that sparked your curiosity or influenced your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages that sparked your curiosity, and how might these experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia's diverse cultures, and how exploring this region might shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia's diverse cultures or histories, and how it might shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or social issue sparked your curiosity about its connections to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with or explored the cultures, histories, or contemporary issues of Southeast Asian countries in ways that sparked your curiosity or passion?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the history, cultures, or current events of Southeast Asian countries in ways that sparked your curiosity or inspired future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia's diverse cultures, and how might exploring this region further enrich your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the cultural, historical, or social aspects of Southeast Asia through travel, projects, or personal interests that sparked your curiosity about the region?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about the cultures, histories, or societies of Southeast Asia, and how did it impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how might this interest shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with or explored the diverse cultures, histories, or contemporary issues of Southeast Asia through travel, school projects, or personal interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the diverse cultures, histories, or current events of Southeast Asia through travel, reading, or projects that sparked your curiosity about the region?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages in ways that sparked your curiosity about the region's complexities and your potential role within them?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or social issue sparked your curiosity or challenged your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages in ways that sparked your curiosity or challenged your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever engaged with Southeast Asian cultures, histories, or languages outside of academics, and how did these experiences shape your interests or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged in any cultural, historical, or language-related activities that sparked your curiosity about the diverse societies of Southeast Asia?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asian cultures, and how do you think exploring this region will shape your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored or interacted with Southeast Asian cultures, and how did it shape your interests or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia's diverse cultures or histories, and how might this interest shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or social issue sparked your curiosity or challenged your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever engaged with or explored the diverse cultures, histories, or current events of Southeast Asia in a way that sparked your curiosity for deeper learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever explored or been exposed to the diverse cultures, histories, or social issues of Southeast Asia that sparked your curiosity about its complexities?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored or wish to explore the cultural, historical, or political aspects of Southeast Asia, and how might this shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged in activities or learning that sparked your curiosity about the cultures, histories, or contemporary issues of Southeast Asian countries?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia's diverse cultures, and how exploring this region might shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages in ways that sparked your curiosity about the region's diversity and its global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia's cultures, histories, or societies, and how it might shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages outside of school, and how might these experiences shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages in ways that sparked your curiosity or shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages in ways that sparked your curiosity about the region's diverse societies and your potential role within them?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored a Southeast Asian culture, and how did it spark your curiosity about the region's diversity?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages in ways that sparked your curiosity about the region's complexities and your potential role within them?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or current events in ways that sparked your curiosity about the region's complexities and your role in them?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia's diverse cultures, and how might exploring this region further enrich your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the history, cultures, or current events of Southeast Asian countries in ways that sparked your curiosity or sense of connection?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, community, or issue sparked your curiosity, and how did you engage with it?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how did it impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia's diverse cultures, and how do you see this curiosity shaping your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the cultural, historical, or social aspects of Southeast Asia through travel, projects, or personal interests that sparked your curiosity about the region?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages outside of academics, and how might these interactions shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages that sparked your curiosity about the region's diverse societies and their global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the history, cultures, or current events of Southeast Asian countries in ways that sparked your curiosity or broadened your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the cultural, historical, or social aspects of Southeast Asia through travel, school projects, or personal interests that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages in ways that sparked your curiosity about the region's diversity and its global significance?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the cultural, historical, or social aspects of Southeast Asia through travel, school projects, or personal interests that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia's diverse cultures, histories, or societies, and how it relates to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages in ways that sparked your curiosity about the region's diverse societies and your potential role within them?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored or interacted with Southeast Asian cultures, and how did it spark your curiosity about the region's diversity?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia's diverse cultures, and how exploring this region might shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity about its people, traditions, or regional dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages in ways that sparked your curiosity about the region's diverse societies and your potential role within them?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages through travel, school projects, or personal interests that sparked your curiosity about the region?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asian cultures, and how do you think exploring this region will shape your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, community, or issue sparked your curiosity or challenged your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with or explored the cultures, histories, or contemporary issues of Southeast Asia in ways that sparked your curiosity or passion?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages in ways that sparked your curiosity about the region's role in your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged in any cultural exchanges, language learning, or community projects that sparked your curiosity about the diverse societies of Southeast Asia?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored or interacted with Southeast Asian cultures, and how did it spark your curiosity about the region's diversity?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored or would you like to engage with the diverse cultures, histories, or languages of Southeast Asia, and how might this shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the diverse cultures, histories, or languages of Southeast Asia through travel, reading, or community engagement that sparked your curiosity about the region?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored the culture, history, or society of Southeast Asia, and how it sparked your curiosity for deeper learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where you explored or interacted with Southeast Asian cultures, and how did it spark your curiosity about the region's diversity?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages in ways that sparked your curiosity about the region's diverse societies and your potential role within them?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages outside of school, and how might these experiences shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where learning about a Southeast Asian culture, history, or society sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored or lived in culturally diverse Southeast Asian communities, and how might these experiences shape your future goals or worldview?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages outside of school, and how might these experiences shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the diverse cultures, histories, or contemporary issues of Southeast Asia through travel, school projects, or personal interests that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored the cultures, histories, or current events of Southeast Asian countries in ways that sparked your curiosity or influenced your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you ever engaged with or learned about the cultures, histories, or current events of Southeast Asian countries that sparked your curiosity or interest?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored or been exposed to the diverse cultures, histories, or current events of Southeast Asia, and how might these experiences shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia's cultures, histories, or contemporary issues, and how did it impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how did it shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia's diverse cultures, and how exploring them might shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity about the region's diversity and your potential role within it?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or current events in ways that sparked your curiosity or influenced your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored or been exposed to the diverse cultures, histories, or languages of Southeast Asia that sparked your curiosity in this region?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged with Southeast Asian cultures, histories, or languages in ways that sparked your curiosity about the region's diversity and its global connections?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience that sparked your curiosity about Southeast Asia's diverse cultures, and how might exploring this region further shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you explored or encountered the diverse cultures, histories, or current events of Southeast Asia in ways that sparked your curiosity or personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or social issue sparked your curiosity or challenged your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Have you engaged in any cultural exchanges, language learning, or community projects related to Southeast Asia that sparked your curiosity about the region?",
    "criterion": "Experiences"
  },
  {
    "major": "Southeast Asian Studies",
    "school": "NUS",
    "question": "Can you share an experience where exploring a Southeast Asian culture, history, or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  }
]