[
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an everyday moment that made you think about how communities could thrive more sustainably, and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Reflecting on your daily life, what environmental or social challenges do you wish you could address through your future career, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an everyday moment that made you think about how societies balance growth with environmental or social well-being, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue, and how you think individuals like yourself could contribute to positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about balancing human needs with environmental well-being, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about creating a more environmentally conscious and socially responsible future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue in your community, and how would you contribute to solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an everyday experience that made you think about the long-term impact of human actions on communities or the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or observation that sparked your curiosity about creating a better future for communities and the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an everyday moment that made you think about how communities can thrive without harming the planet, and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an everyday experience that made you realize the impact of human actions on the environment, sparking your curiosity to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you noticed an environmental or social issue, and how would you contribute to solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about balancing human needs with environmental well-being, and how you'd like to contribute to this balance in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue in your community, and how it sparked your desire to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or observation that sparked your curiosity about how societies balance human needs with environmental well-being, and why it resonates with you?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue, and how you think your future career could contribute to solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a moment when you realized the impact of human actions on the environment, and how it influenced your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue in your community - how did it spark your curiosity to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a moment when you noticed an environmental or social issue in your community, and how you'd aspire to contribute to its solution?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you noticed an environmental or social issue, and how would you contribute to addressing it in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about balancing human needs with environmental protection, and how you'd like to contribute to this balance in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a moment when you realized the impact of human actions on the environment, and how it sparked your curiosity about creating positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Reflecting on your daily life, what environmental or social issues spark your curiosity, and how do you envision contributing to positive change in these areas?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or observation that sparked your curiosity about creating long-term positive impacts on communities and the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed a social or environmental issue, and how you think individuals can contribute to positive change in such situations?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a moment when you noticed an environmental or social issue in your community, and how you think it could be addressed in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you noticed an environmental or social issue, and how you think individuals can contribute to positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a moment when you realized the impact of human actions on the environment, and how it sparked your curiosity about creating positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed the impact of human actions on the environment, and how it shaped your thoughts on responsible living?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed social or environmental issues in your community, and how you think individuals can drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed social or environmental inequality, and how do you think you could contribute to positive change in such situations?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a moment when you noticed an environmental or social issue in your community, and how you think it could be addressed?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an everyday situation where you noticed the impact of human behavior on the environment, and how did that influence your actions or thoughts?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about creating a more environmentally and socially responsible future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a moment when you witnessed social or environmental inequality, and how it sparked your desire to drive positive change in communities?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about environmental or social issues, and how do you see yourself contributing to positive change in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you noticed a social or environmental issue, and how you think it could be addressed in a way that benefits both people and the planet?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about creating positive social or environmental impact, and how might you build on that in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or observation that sparked your curiosity about creating positive environmental or social impact, and how might you build on that in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Reflecting on your daily life, how do you envision contributing to a more environmentally conscious and socially responsible future in your career or community?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you noticed an environmental or social issue, and how you'd like to contribute to solving similar problems in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about balancing human needs with environmental well-being, and how you'd like to explore this further?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue, and how you think your future career could contribute to solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about balancing human needs with environmental well-being, and how you'd like to contribute to this balance in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an everyday action you'd change to benefit the environment and how you think studying related concepts could shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how did it make you feel, and what did you do?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a moment when you realized the impact of human actions on the environment and how it shaped your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you witnessed the impact of human actions on the environment, and how it sparked your curiosity about creating a better future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about creating a better future for communities, and how do you see yourself contributing?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed the impact of human actions on the environment and how it influenced your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Reflect on a time you noticed an environmental or social issue in your community - what motivated you to learn more or take action?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue in your community, and how you think it could be addressed?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed social or environmental inequality, and how you think your future career could address such issues?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue, and how you think individuals like yourself could drive positive change in such situations?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or idea that sparked your curiosity about creating positive social and environmental impact, and how might you build on this in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you realized the impact of human actions on the environment, and how it shaped your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue, and how you think individuals like yourself could contribute to positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a recent experience where you noticed the impact of human behavior on the environment, and how it influenced your daily choices?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue in your community, and how you think it could be addressed?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed the impact of human actions on your community, and how it sparked your curiosity about creating positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an everyday situation where you noticed environmental or social inequality, and how would you improve it if given the chance?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue, and how you think your future career could contribute to solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an everyday action you'd change to benefit the environment and how you see that choice impacting your future lifestyle?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about balancing human needs with environmental protection, and how might you contribute to this balance in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about creating a better future for communities, and how do you see yourself contributing to this goal?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a moment when you realized the impact of human actions on the environment, and how it sparked your desire to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about creating positive social or environmental impact, and how might you build on that in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue, and how you think your future career could contribute to solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue in your community, and how you think it could be addressed?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed a social or environmental issue, and how you think individuals like yourself can contribute to positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an everyday moment that sparked your curiosity about creating a better future for communities, and how might you build on that in the next decade?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or issue that sparked your curiosity about balancing human needs with environmental protection, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue, and how you think individuals can contribute to positive change in such situations?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue in your community, and how you think it could be addressed in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed the impact of human actions on your community, and how it sparked your curiosity about creating positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about creating positive social or environmental change, and how might you build on that in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a moment when you realized the impact of human actions on the environment, and how it sparked your desire to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an everyday moment that made you realize the impact of human actions on the environment, and how you'd like to address such issues in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue, and how you think your future career could contribute to solving it?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or observation that sparked your curiosity about creating long-term positive impacts on communities and the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue in your community and how you'd like to contribute to solving similar problems in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or observation that sparked your curiosity about creating a better future for communities and the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you noticed an environmental or social issue, and how you think individuals can contribute to positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or observation that sparked your curiosity about how societies balance human needs with environmental well-being?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a moment when you noticed an environmental or social issue in your community, and how you think individuals like yourself could drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed the impact of human actions on the environment, and how did it shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about balancing human needs with environmental well-being, and how might you explore this further?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue, and what motivated you to learn or act more about it?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed social or environmental inequality, and how it sparked your curiosity to drive positive change in communities?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about creating positive social or environmental change, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or idea that sparked your curiosity about creating a better future for communities and the environment?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue, and how you think individuals can contribute to positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an everyday moment that made you think about how communities could thrive more sustainably, and what role you'd like to play in that?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an everyday action you'd change to benefit the environment and how you see that choice impacting your future lifestyle?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue, and how do you think individuals like yourself can contribute to positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a moment when you realized the impact of human actions on the environment, and how did that influence your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about environmental or social issues, and how do you see yourself contributing to positive change in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed the impact of human behavior on the environment and how it sparked your curiosity about creating positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue in your community, and how you think it could be addressed?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue in your community, and how you think it could be addressed?",
    "criterion": "Interests"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and how you would approach addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you noticed an environmental or social issue, and how would you approach solving it collaboratively?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and how you would approach addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you promoted or observed sustainability in your community, and how did it shape your perspective on balancing human needs with environmental protection?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you promoted or observed a practice that supports environmental or social well-being, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to a community or environmental initiative, and what skills did you develop through this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and brainstorm ways you'd address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose a balanced solution?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and how you would approach solving it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've applied creative problem-solving to address an environmental or social issue in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community, and how would you propose addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and how you would approach solving it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental issue in your community - how would you propose a solution that benefits both people and the planet?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to a more environmentally conscious or socially responsible initiative, and what motivated you?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you contribute to addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community, and how would you propose a balanced solution?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you promoted environmental or social awareness, and how did that experience shape your values?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to environmental or social well-being in your community, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and brainstormed potential solutions, even if small-scale?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you promoted environmental or social awareness in your community, and how did it shape your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose a balanced solution?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community, and how you would approach addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and brainstormed potential solutions to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and how you would approach solving it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you identified an environmental or social issue in your community and how you would propose addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental issue in your community and how you would approach solving it collaboratively?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you noticed an environmental or social issue, and how would you propose a community-driven solution?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you identified a social or environmental issue and what steps you took to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose a balanced solution?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose a balanced solution that benefits all stakeholders?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you identified an environmental or social issue in your community and brainstormed innovative solutions to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you identified a social or environmental issue and what steps you took to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you identified a community issue and brainstormed innovative, environmentally conscious solutions to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose a balanced solution?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community, and how would you approach solving it collaboratively?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you contributed to or observed a community addressing an environmental or social challenge, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you identified an environmental or social issue and proposed a creative solution to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose addressing it sustainably?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and how you would approach addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you promoted environmental or social awareness, and how did that experience shape your values?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've promoted environmental or social awareness in your community, and what motivated you to take action?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you promoted or observed sustainability in your community, and how did it shape your perspective on responsible living?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental issue in your community - how would you propose a solution that benefits both people and the planet?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to a more eco-friendly community, and how you think such efforts could impact your future career choices?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose a balanced solution?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you identified an environmental or social issue in your community and brainstormed innovative solutions to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and brainstormed ways to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community or environmental initiative, and how did this shape your perspective on responsible citizenship?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and how you would approach addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and how you would propose addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you identified an environmental issue in your community and brainstormed innovative solutions to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your experiences where you promoted environmental or social awareness, and how did you measure its impact?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've promoted environmental or social awareness in your community, and what motivated you to take action?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you identified an environmental or social issue in your community and brainstormed innovative solutions to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your daily life where you've reduced waste or conserved resources, and how did that experience shape your habits?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue in your community and how you would approach solving it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue in your community, and how would you propose a small-scale solution?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to a community initiative, and what skills did you develop that could help drive social change?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community, and how you would approach addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental issue in your community - how would you propose a solution that balances human needs and sustainability?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your daily life where you've made a conscious choice to reduce waste, and how did that experience shape your habits?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've promoted environmental or social awareness in your community, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to a community or environmental initiative, and what skills did you develop through that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and how you would approach solving it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community, and how would you propose a small-scale solution?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've promoted environmental or social awareness in your community, and what motivated you to take action?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose a balanced solution?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community initiative and how it shaped your understanding of balancing human needs with environmental limits?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and how you would approach solving it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community, and how you would approach addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your daily life where you've observed a social or environmental issue, and how you think individuals like yourself could contribute to positive change?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to a more environmentally conscious or socially responsible initiative, and what motivated your actions?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and how you would approach solving it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you contribute to solving it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've promoted sustainability in your daily life, and how do you see this value shaping your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you identified an environmental or social issue in your community and brainstormed potential solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental issue in your community - how would you propose a balanced solution that benefits both people and the planet?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and brainstormed innovative, practical solutions to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've applied creative problem-solving to address an environmental or social issue in your community?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your daily life where you've reduced waste or conserved resources, and how did that experience shape your habits?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've promoted sustainability in your daily life, and how do you see this habit impacting your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community, and how would you propose addressing it collaboratively?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you propose addressing it sustainably?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you promoted positive change in your community, and how do you think such efforts could impact your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you noticed an environmental or social issue in your community and brainstorm how you might contribute to a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how would you address it innovatively?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you identified an environmental or social issue in your community and how you would propose addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example from your life where you identified an environmental or social issue and proposed a creative solution to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to a cause larger than yourself, and how did that experience shape your values?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've promoted sustainability in your daily life, and how do you see this value shaping your future career choices?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community and how you would approach addressing it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to a community initiative, and how you think such efforts could shape a more sustainable future?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you identified an environmental or social issue in your community and brainstormed innovative solutions to address it?",
    "criterion": "Skills"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community or environmental initiative, and how did it shape your goals for creating positive impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or project that positively impacted your community or environment, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community or environment-focused initiative, and how it shaped your perspective on balancing human needs with sustainability?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community or initiative that aligns with your vision for a better future?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community initiative, and how did it shape your perspective on balancing human needs with environmental responsibilities?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community or environmental initiative, and how it shaped your perspective on responsible citizenship?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community or environmental initiative, and how did it shape your perspective on responsible living?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed a community addressing environmental or social challenges, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to or observed efforts to balance human well-being with environmental concerns in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human well-being with environmental protection, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental or social well-being, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community initiative or project that aligned with your values, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to address social or environmental issues in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or initiative that you believe positively impacted your community or environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or project that aligned with your values, and how it shaped your perspective on community impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to environmental or social well-being, and how did it shape your goals for creating positive impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community or initiative that aligns with your vision for a more sustainable future?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community initiative or made a personal choice that positively impacted the environment or society?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed a community addressing environmental or social challenges, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community or environmental initiative, and how did it shape your perspective on responsible living?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental protection, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or project that positively impacted your community or environment, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental protection, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community or environmental initiative, and how it shaped your perspective on collective responsibility?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to or observed efforts to balance human needs with environmental concerns in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or project that you believe made a positive impact on your community or environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you contributed to or observed an initiative that promoted environmental or social well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to environmental or social well-being, and how did it shape your goals for creating positive impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or project that positively impacted your community or environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you contributed to or observed an initiative that promoted environmental or social well-being in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental protection, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to environmental or social well-being, and how did it shape your goals for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to or observed efforts to balance human needs with environmental concerns in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to or observed sustainability efforts in your community, and what sparked your interest in these initiatives?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental protection, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental or social well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or project that you believe made a positive impact on your community or environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to creating positive social or environmental impact, and what motivated you to take action?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to environmental or social well-being, and how did this shape your perspective on responsible citizenship?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or project that you believe made a positive impact on your community or environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to environmental or social well-being, and how did it shape your goals for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or project that promotes social or environmental well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to or observed efforts to balance human well-being with environmental concerns in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to or observed efforts to balance human needs with environmental protection in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to creating positive social or environmental impact, and what motivated your actions?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community or environmental initiative, and how did it shape your perspective on responsible citizenship?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community initiative or project that promoted environmental or social well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental or social well-being, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to or observed sustainability efforts in your community, and what motivated your involvement?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community initiative, and how did it shape your perspective on balancing human needs with environmental concerns?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you contributed to or observed an initiative that promoted environmental or social well-being in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to creating positive change in your community, and how did this impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to environmental or social well-being, and how did this shape your goals for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental or social well-being, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to address environmental or social challenges in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental protection, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental or social well-being, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community initiative, and how did that shape your views on balancing human needs with environmental limits?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental concerns, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community or environmental initiative, and how it shaped your perspective on responsible citizenship?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human well-being with environmental protection, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental or social well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental protection, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental concerns, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you noticed an environmental or social issue in your community - how did you respond, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental or social well-being, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or project that you believe positively impacted your community or environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to or observed sustainability efforts in your community, and what motivated your involvement?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental concerns in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you describe a time when you contributed to or observed efforts to address social or environmental challenges in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or project that you believe made a positive impact on your community or environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an example of how you've contributed to or observed efforts to balance human needs with environmental concerns in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental or social well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to address social or environmental challenges in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or initiative that you believe positively impacts your community or environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental concerns in your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community or environmental initiative, and how did it shape your perspective on responsible citizenship?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or project that positively impacted your community or environment, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental or social well-being, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental or social well-being, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to environmental or social well-being, and how did this shape your goals for creating positive impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental or social well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or project that you believe made a positive social or environmental impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to creating positive social or environmental change, and how did this shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community initiative, and how did it shape your views on balancing human needs with environmental limits?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental protection, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or project that you believe made a positive impact on your community or environment?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental or social well-being, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental protection, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental protection, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a cause or community that you felt passionate about, and how did this shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community initiative, and how did it shape your views on balancing human needs with environmental concerns?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental protection, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental or social well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community initiative that aligned with your values, and how did it shape your perspective on collective responsibility?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community initiative that promoted environmental or social well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to a community initiative, and how did that shape your views on balancing human needs with environmental limits?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to creating positive social or environmental impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to environmental or social good, and how did it shape your aspirations for creating positive change?",
    "criterion": "Experiences"
  },
  {
    "major": "Sustainable Societies",
    "school": "SMU",
    "question": "Can you share an experience where you contributed to or observed efforts to balance human needs with environmental protection, and what did you learn from it?",
    "criterion": "Experiences"
  }
]