[
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever been fascinated by a language or culture that's not your own, and how would exploring one deeply impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think studying a language and its cultural heritage can shape your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or past experiences, how do you think exploring a language and its cultural heritage could enrich your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning or sharing about your cultural heritage sparked your curiosity, and how might you build on that in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your heritage, how do you think exploring the language, literature, and culture of Tamil communities can enrich your personal growth and future career?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning or sharing about a language or culture sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you explored how studying a language and its cultural heritage can shape your future career or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your cultural heritage, how do you see exploring the language, literature, and traditions of Tamil communities enriching your personal growth and future career?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever been fascinated by the cultural heritage of Tamil communities, and how would exploring this interest shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or experiences, how do you think exploring the language, culture, and history of Tamil communities could enrich your future personal or professional journey?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored how a language shapes cultural identity, and how would you contribute to preserving it in a multilingual society?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage or a language sparked curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or experiences, what aspects of Tamil culture, language, or teaching others inspire you to pursue further learning and sharing in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share a personal experience or moment that sparked your curiosity in Tamil language, culture, or education, and how do you see this interest evolving in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked joy or curiosity in you?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think exploring the language, culture, and heritage of Tamil communities could enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever imagined teaching or sharing your passion for the Tamil language and culture with others, and how might that shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever been fascinated by a language's power to shape culture and identity, and how would you share that passion with others?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever considered how exploring your heritage language could enrich your identity and open doors to connect with diverse communities in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your cultural heritage, how do you think exploring a language and its educational practices could shape your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a language or culture sparked your curiosity, and how you think exploring such interests could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the language, literature, and culture of Tamil communities might enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or volunteer work, how might exploring the language, culture, or history of Tamil communities enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning or sharing your Tamil heritage sparked joy or curiosity, and how might you build on that in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a language or culture sparked your curiosity, and how you think exploring it further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever imagined teaching or sharing your passion for Tamil language and culture with others - what inspired this desire in you?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored how language shapes cultural identity, and how would you contribute to preserving or promoting a language that's meaningful to you?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored how learning a heritage language like Tamil can shape your identity or impact communities, and how would you share that passion with others?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked your curiosity, and how might this passion influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a language or culture sparked your curiosity, and how might exploring such interests shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage or a language sparked curiosity in you, and how you see this shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring Tamil language or culture sparked your curiosity, and how might this continue to inspire your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning or sharing about your cultural heritage sparked joy, and how might you inspire others through similar moments?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think learning a heritage language like Tamil could enrich your personal growth or future career paths?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever considered how exploring a language's cultural heritage could shape your identity or career, and why does this resonate with you?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Tamil language and culture might enrich your personal growth or future career paths?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored how learning a heritage language like Tamil can shape your identity or impact your community, and why does this resonate with you?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the language, culture, and educational aspects of a diverse community might shape your future aspirations or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your cultural heritage, how do you think exploring the language, literature, and traditions of Tamil communities could enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning or sharing about a language or culture sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about your heritage language or culture sparked your curiosity, and how might this enthusiasm shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or experiences, how do you think exploring the language, culture, and education of a specific community could enrich your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or past experiences, how might exploring the language, culture, or history of Tamil communities enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or volunteer work, how do you see exploring Tamil language and culture impacting your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your heritage or cultural experiences, how do you think exploring a language and its educational applications could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked joy or curiosity in you?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture or language sparked your curiosity, and how you think exploring it further could enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked your curiosity, and how might this continue to inspire you in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Tamil language and culture might shape your future aspirations or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own heritage, how do you think studying a language and its cultural?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or past experiences, how do you think learning a heritage language like Tamil could enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning or sharing about your cultural heritage sparked joy or curiosity in you or others?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked your curiosity, and how might this passion guide your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the language, culture, and history of Tamil communities might enrich your personal growth or future career paths?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a language or culture sparked your curiosity, and how you think exploring such interests could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever considered how exploring your cultural heritage could enrich your future teaching practices or community engagement?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your heritage or cultural passions, how do you see exploring a language and its educational practices shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you explored how language shapes cultural identity, and could you see yourself inspiring others to appreciate their heritage through education?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or experiences, what aspects of language, culture, or education inspire you to pursue a field that combines them?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share a personal experience or encounter that sparked your curiosity in Tamil language or culture, and how do you see it shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a language or culture sparked your curiosity, and how you envision this passion shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or experiences, how do you see the study of a language and its cultural heritage shaping your future goals or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring Tamil language or culture sparked your curiosity, and how might nurturing this passion shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture or language sparked your curiosity, and how might exploring such interests shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored how language shapes cultural identity, and how would you share that passion with future generations through teaching?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or experiences, how do you see the study of language, culture, and education intersecting with your future aspirations or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored how language shapes cultural identity, and how would you apply this understanding in an educational setting?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your heritage or cultural explorations, how do you think studying a specific language and its educational practices could enrich your personal growth or future career?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the language, culture, and heritage of Tamil communities might enrich your personal growth or future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or experiences, how might studying a language and its cultural heritage shape your future goals or personal development?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the language, culture, or history of Tamil communities might enrich your personal growth or future career paths?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or volunteer work, how might exploring a language and its cultural heritage impact your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in Tamil language or culture, and how do you see this passion evolving in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked your curiosity, and how might this continue to inspire your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or past experiences, what draws you to exploring the language, culture, or educational aspects of Tamil heritage in your future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a language or culture sparked your curiosity, and how you think exploring such interests could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever considered how exploring a language's cultural heritage can shape your identity or inform your approach to teaching and learning?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture or language sparked your curiosity, and how you think exploring this further could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you found yourself drawn to exploring Tamil culture, language, or history, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you explored how learning a heritage language like Tamil can shape your identity or impact your community engagement in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share a personal experience or story that sparked your curiosity in Tamil language or culture, and how do you see this interest shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a language sparked your curiosity, and how might this continue to inspire you in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored the rich cultural heritage of Tamil language and its impact on community identity, and how might this inspire your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies or volunteer work, how might exploring the language, culture, or history of Tamil communities enrich your future career or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever considered how exploring your heritage language could shape your teaching style or impact future generations of Tamil speakers?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring Tamil language or culture sparked your curiosity, and how do you see this passion influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share a personal experience where learning or sharing about a language or culture sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your passions, how do you see exploring the language, literature, and cultural heritage of Tamil communities shaping your future goals or personal identity?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think exploring the language, culture, and education of Tamil communities could enrich your future personal or professional life?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored or been inspired by Tamil language, literature, or culture, and how do you see this influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning about a culture or language sparked your curiosity, and how might exploring such interests shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever been fascinated by a language or culture that's not your own, and how would exploring one deeply impact your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning or sharing about your cultural heritage sparked your curiosity, and how might this continue to inspire you in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience or encounter that sparked your curiosity in Tamil culture, language, or education, and how might this interest shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a language sparked your curiosity, and how might this continue to inspire you in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how learning a heritage language like Tamil has influenced your perspective, and how you'd inspire others to explore their cultural roots?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity in you, and how you think this could shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring your cultural heritage has influenced your teaching or learning approach, and how might this shape your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language deepened your understanding of yourself or others, and how might this continue to shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a second language sparked curiosity in you, and how you'd apply that enthusiasm to inspire others?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage language sparked curiosity, and how you think it could shape your future interactions or career?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a new language sparked curiosity in you, and how might this shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've used your Tamil language skills to connect with others or your community, and how did that experience impact you?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a second language sparked curiosity in you, and how you think this relates to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a second language sparked personal growth, and how might this curiosity benefit your future teaching practices?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a new language sparked curiosity in you, and how you think this relates to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning a language or cultural practice deeply impacted you, and how you might inspire similar growth in others?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage language sparked curiosity, and how would you pass on that enthusiasm to younger learners?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity, and how you think this passion could enrich your future teaching or community engagement?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've used a language to connect with others, and how this experience might shape your approach to teaching or cultural exchange?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively taught or learned about a cultural heritage, and how it impacted your understanding of diverse traditions?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural or linguistic concept to someone unfamiliar with it, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively taught or learned about your cultural heritage, and how it shaped your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring your cultural heritage through language has shaped your identity, and how you'd inspire others to do the same?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring your cultural heritage has influenced your perspective on education or community engagement?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a complex cultural concept to someone unfamiliar with it, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring your cultural heritage has influenced your perspective on teaching or learning, and why does this matter to you?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage, such as through language or tradition, inspired you to teach or share it with others?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've used your knowledge of Tamil language or culture to help others, and how do you see this skill evolving in your future?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied your knowledge of Tamil language or culture to help others or address a community issue?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning a language or cultural practice deeply impacted you, and how you'd inspire others to explore similar experiences?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a new language sparked curiosity in you, and how you think this relates to your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring your cultural heritage has influenced your teaching or learning style, and how might this impact your future interactions?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural or language concept to someone unfamiliar with it, and how did you approach the situation?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've used your knowledge of Tamil language or culture to positively impact your community or help others?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a second language sparked curiosity in you, and how might this relate to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively taught or learned about a cultural heritage, and how did it impact your understanding of diverse traditions?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've used your knowledge of Tamil language or culture to positively impact your community or a peer?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage language or culture sparked curiosity in you, and how might you inspire others to do the same?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a complex Tamil cultural concept to someone unfamiliar with it, and how did you ensure understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked a desire to teach or share it with others?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a new language sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively taught or learned a cultural aspect of Tamil, and how did it impact your understanding of the language?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity in you, and how you'd inspire others to do the same?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring your cultural heritage through language has shaped your identity, and how you might inspire others to do the same?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a complex Tamil cultural concept to someone unfamiliar with it, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a complex idea in Tamil, and how did you ensure your audience understood it?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural value or tradition to someone unfamiliar with it, and how did you approach this?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural value or tradition to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others deepened your understanding of a language or community?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning or teaching a language, like Tamil, sparked your curiosity, and how you think it shaped your communication skills?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a new language sparked curiosity in you, and how might this drive your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a new language sparked curiosity in you, and how might you inspire others in a similar way?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively taught or learned a cultural practice, and how it shaped your perspective on language preservation?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've used a language to connect with others, and how this experience might shape your approach to teaching or cultural exchange?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've used your language skills to bridge a communication gap, and how you think this skill will grow in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural value or tradition to someone from a different background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity in you, and how might this passion impact your future endeavors?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning or teaching a language, like Tamil, helped you connect with others or your heritage, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively engaged with your cultural heritage, and how did that shape your interest in teaching or sharing it with others?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your curiosity, and how might this shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a new language sparked curiosity in you, and how you think it could shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring your cultural heritage has influenced your communication style or teaching approach in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning or teaching a language, particularly Tamil, sparked your curiosity, and how you envision nurturing this passion in others?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied your knowledge of Tamil language or culture to help others, and how did it impact your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively taught or learned about your heritage, and how did it shape your understanding of cultural identity?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a new language sparked curiosity in you, and how you think this relates to inspiring others?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone unfamiliar with it, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've used a language to bridge cultural gaps, and how this experience might shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively engaged with your cultural heritage, and how might such interactions shape your future educational pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a language sparked curiosity in you, and how might this drive your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a new language sparked curiosity in you, and how you think this relates to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural value or tradition to someone unfamiliar with it, and what did you learn from the encounter?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage, such as through language or traditions, inspired you to teach or share it with others?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage, such as a language or tradition, sparked curiosity in you, and how you shared this with others?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how your passion for the Tamil language has influenced your goals, and how you plan to inspire others through education?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural or historical concept to a peer, and how did that experience shape your teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural concept to someone unfamiliar with it, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a complex Tamil cultural concept to someone unfamiliar with it, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how exploring your cultural heritage has influenced your communication style or teaching approach in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a new language sparked curiosity in you, and how might this shape your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity in you, and how might this drive your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage, such as a language or tradition, sparked your curiosity to teach or learn more?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring the Tamil language and its cultural heritage might shape your personal growth or future career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively engaged with your cultural heritage, and how do you think such experiences shape one's identity?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've used a language to connect with others or your heritage, and how you hope to deepen this connection in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring your cultural heritage through language has influenced your goals, and how you'd apply this passion in an educational setting?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively taught or learned a cultural aspect of Tamil, and how it impacted your understanding of the language?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where learning a language or culture deeply impacted you, and how you might inspire similar growth in others through education?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning a language or culture has impacted your life, and how you might inspire others to explore their heritage?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural or linguistic concept to someone unfamiliar with it, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a second language sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively taught or learned about a cultural heritage, and how it shaped your perspective on education's role in preserving traditions?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a complex idea in Tamil, and how did you adapt it for a younger audience?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a new language sparked curiosity, and how you think it could shape your future?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively taught or learned about a language or culture, and how it shaped your personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've applied your knowledge of Tamil language or culture to connect with others or your community?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a second language sparked curiosity in you, and how you think this relates to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you effectively communicated a cultural value or tradition to someone from a different background, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've used your language skills to connect with others, and how might this skill evolve in a multicultural learning environment?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an example of how learning or teaching a language has influenced your perspective, and how you think this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity in you, and how might this enthusiasm benefit your future community engagements?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a new language sparked curiosity in you, and how might this drive your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a second language sparked curiosity in you, and how you'd apply that enthusiasm in a teaching role?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share how exploring your cultural heritage through language has influenced your personal growth or sparked career aspirations?",
    "criterion": "Skills"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a second language impacted your personal growth or view on education?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language sparked your interest in pursuing a similar path?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language sparked your interest in furthering your studies in this area?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explored or celebrated your cultural heritage, and how did it shape your interest in teaching or sharing it with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a field that combines language, culture, and education?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language sparked your curiosity for future growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a language deeply interested you, and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you participated in or led any initiatives that promote language, culture, or education, and how did these experiences shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in any activities, such as language clubs or community events, that sparked your interest in promoting or exploring Tamil language and culture?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a field related to language and education?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a field that combines language and education?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your curiosity or sense of purpose?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in activities or projects that involve promoting cultural heritage, education, or community engagement, and how did they inspire your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage or a second language sparked personal growth, and how might this continue to shape your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a second language impacted your personal growth or view on education?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted you?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you participated in or led any initiatives that promote language, cultural heritage, or community education, and how did these experiences shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity, and how you think this relates to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity, and how you think this relates to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity, and how you think it could shape your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity, and how you think this relates to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted you?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted you?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in language, education, or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a field that combines language, culture, and education?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in any activities or projects that involved sharing your knowledge of Tamil language or culture with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage or a language sparked curiosity, and how you think this relates to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in any activities, such as language clubs or community events, that sparked your interest in exploring or sharing Tamil culture and language?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language sparked your interest in bridging education and cultural preservation?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a field that combines language, culture, and education?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage or a language sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a field related to language and education?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you participated in or led any cultural events, language workshops, or community projects that deepened your connection with Tamil heritage and inspired others?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in any activities that sparked your curiosity about Tamil language, culture, or teaching others, shaping your aspirations for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in learning or sharing more?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language ignited a passion in you, and how might this passion shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a second language sparked curiosity, and how might that relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you ever explored or shared your passion for the Tamil language and culture with others, and how did that experience impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language sparked your curiosity for future growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a language ignited your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in any activities where you taught or shared aspects of your culture, language, or heritage with others, and what did you learn from those experiences?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in learning or sharing more?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity in you, and how might this continue to inspire your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your curiosity or developed your communication skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked a desire to teach or share it with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a field that combines language and education?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a second language sparked personal growth or inspired your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage or a cultural interest helped shape your goals for teaching or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage or a language sparked curiosity, and how you think this relates to your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage language or culture sparked curiosity in teaching or sharing it with others, and why?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a field that combines language, culture, and education?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked a desire to teach or share it with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a language deeply impacted your perspective, and how might this shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage or a language sparked curiosity, and how might that passion guide your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you participated in or led any initiatives that promote cultural heritage or language preservation, and how did these experiences shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language sparked your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your curiosity or skills that you believe will be valuable in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language sparked your interest in further study or community engagement?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a second language sparked curiosity in you, and how might this continue to inspire your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted you or shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage or a language sparked your curiosity, and how might this continue to inspire your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in any activities that sparked your curiosity about Tamil language, culture, or teaching, shaping your aspirations for the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a field related to language and education?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language sparked your curiosity or sense of purpose?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted you, shaping your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in pursuing a field that combines language and education?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a language deeply interested you, and how it shaped your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your curiosity or skills in a meaningful way?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage or a language sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in any activities or projects that involved sharing or learning about your cultural heritage, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage language or culture sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted your personal growth or career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language deeply impacted you or your community?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about it sparked your interest in language preservation or education pathways?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or teaching others about a language sparked your curiosity for future growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or a language sparked curiosity in you, and how might this continue to inspire your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked curiosity in you, and how might this continue to inspire your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your heritage or a second language sparked curiosity, and how might that shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked your curiosity, and how might this continue to inspire you?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in any activities or projects that involved teaching, learning, or sharing aspects of your cultural heritage with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in activities or projects that deepened your connection with the Tamil language or culture, and how did these experiences impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring your cultural heritage or language sparked a desire to teach or share it with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Tamil Studies and Education",
    "school": "NTU",
    "question": "Have you engaged in any activities where sharing or learning about Tamil language and culture inspired personal growth or sparked career aspirations?",
    "criterion": "Experiences"
  }
]