[
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex science concept to someone else, and how did that spark your interest in teaching and learning?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies, how might exploring the 'why' behind everyday chemical reactions inspire your future teaching approaches?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found chemistry fascinating and how you would creatively teach it to someone who finds it challenging?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions or teaching others sparked your curiosity, and how might this enthusiasm shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand a complex chemistry concept, and how did that moment spark your interest in teaching?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did that spark your interest in teaching and learning?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when learning or teaching chemistry sparked your curiosity, and how you envision inspiring others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies, how do you see exploring the 'why' behind chemical reactions shaping your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the 'why' behind a chemical reaction or phenomenon sparked your curiosity, and how you'd pass on that excitement to others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed explaining a scientific concept to others, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a scientific concept, like a chemical reaction, sparked your curiosity, and how you envisioned sharing that excitement with others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring chemical reactions sparked your curiosity, and how would you pass on that excitement to others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the 'why' behind a chemical reaction sparked your curiosity, and how you'd pass on that excitement to others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand a complex chemistry concept, and what motivated you to share your knowledge?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found chemistry concepts fascinating and how you would creatively explain them to someone who's struggling?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed explaining a scientific concept to others, and how did that moment spark your curiosity to teach and learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand a complex science concept, and how did that moment spark your interest in teaching and learning?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions sparked your curiosity, and how would you inspire others to feel the same?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed learning or teaching chemistry, and how do you see this passion shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions sparked your curiosity, and how would you inspire others to discover that same excitement?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a scientific concept sparked your curiosity, and how would you creatively teach it to others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a scientific concept, like a chemical reaction, sparked your curiosity, and how would you creatively teach it to others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a scientific concept, like a chemical reaction, sparked your curiosity to teach it to others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found chemistry concepts fascinating and how you would creatively explain them to others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions or teaching others sparked your curiosity, and how might these passions shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone, and how did that moment spark your interest in teaching?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found chemistry fascinating and how you would creatively explain a complex concept to someone who's never studied it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when you found chemistry fascinating and how you would creatively explain a complex concept to someone who's never studied it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found chemistry fascinating and how you would creatively explain a complex concept to someone who's new to the subject?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when explaining a complex science concept to others sparked your curiosity, and how that experience shaped your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions or teaching others sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Reflect on a time science sparked your curiosity - how might sharing that excitement with others shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone understand a complex chemistry concept, and how did that moment spark your interest in teaching?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in explaining a complex science concept to someone else, and how did that moment inspire you?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that make you feel about teaching?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and what did you enjoy most about that process?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in explaining a scientific concept to someone else, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in explaining a scientific concept to others, and how it sparked your curiosity for teaching and learning?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring the 'why' behind a chemical reaction sparked your curiosity, and how might that drive you to inspire others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when you found chemistry fascinating and how you'd creatively explain it to someone who's never studied it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies, how might exploring the 'why' behind chemical reactions inspire your future teaching approaches or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that spark your interest in teaching?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in explaining a scientific concept to someone else, and how did that moment shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in explaining a scientific concept to others, and how did that moment shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions sparked your curiosity, and how you envision sharing that excitement with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in explaining a complex scientific concept to someone else, and what sparked that enthusiasm in you?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Reflecting on your hobbies, how might exploring the 'why' behind chemical reactions inspire your future teaching approaches or personal curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in both learning chemistry concepts and explaining them to others, and why did it resonate with you?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in explaining a scientific concept to others, and how did that moment shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions sparked your curiosity, and how do you envision sharing that excitement with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when you found chemistry fascinating and how you would creatively explain it to someone who's never studied it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a scientific concept, like a chemical reaction, sparked your curiosity to teach it to others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed explaining a scientific concept to someone, and how did that moment spark your interest in teaching and learning?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found chemistry fascinating and how you would creatively explain a complex concept to someone who's new to the subject?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and what did you enjoy about that process?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions sparked your curiosity, and how would you creatively teach this concept to others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions or teaching others sparked your curiosity, and how do you see this passion guiding your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions or teaching others sparked your curiosity, and how might this passion shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in both learning chemistry concepts and helping others understand them?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in both explaining a scientific concept and seeing someone else understand it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when you found chemistry fascinating and how you would creatively explain that concept to someone who's never studied it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring chemical concepts sparked your curiosity, and how would you creatively teach it to others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when chemistry sparked your curiosity, and how do you envision inspiring others to explore this fascination in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when you found chemistry fascinating and how you would spark that same curiosity in someone who finds it challenging?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in explaining a complex chemistry concept to someone else, and why did it excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in both learning chemistry concepts and explaining them to others, and how this sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions or teaching someone a new concept sparked your curiosity, and how might this passion shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex science concept to someone else, and what did you enjoy most about that process?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in both learning chemistry concepts and explaining them to others, sparking their curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring chemical concepts sparked your curiosity, and how would you creatively teach it to others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a scientific concept sparked your curiosity, and how would you creatively teach it to others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you connected a chemistry concept to a real-life situation, and how teaching it to others sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed explaining a scientific concept to others, and how did that moment spark your curiosity about teaching?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex science concept to others, and how did that make you feel about teaching and learning?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in both learning chemistry concepts and explaining them to others, and why it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions or teaching others sparked your curiosity, and how might these passions shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a scientific concept sparked your curiosity, and how you envision sharing that excitement with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone, and what did you enjoy about that process?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you made a complex scientific concept, like a chemistry principle, engaging and accessible to others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand a complex Chemistry concept, and how did that experience shape your teaching aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else - what did you enjoy about it?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed explaining a scientific concept to others, and how did that make you feel about teaching?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when learning or teaching chemistry sparked your curiosity, and how do you see this passion evolving in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed explaining a scientific concept to others, and how did that make you feel about teaching and learning?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and what did you enjoy about that process?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you found joy in explaining a scientific concept to others, and how it sparked your curiosity about teaching and learning?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions sparked your curiosity, and how might teaching others about science impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when you found chemistry fascinating and how you'd creatively teach it to spark curiosity in others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed explaining a scientific concept to someone else, and how did that make you feel?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a scientific concept sparked your curiosity, and how you envision sharing that excitement with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions or teaching others sparked your curiosity, and how might this passion shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did that spark your interest in teaching and learning?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Reflecting on your favorite learning moments, how do you think combining your passion for chemistry with teaching skills could impact your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when you enjoyed explaining a scientific concept to someone else, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions or teaching others sparked your curiosity, and how do you see this passion evolving in your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring chemical reactions sparked your curiosity, and how you envision sharing that excitement with others in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where exploring a scientific concept, like a chemical reaction, sparked your curiosity to teach or share it with others?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share a moment when exploring chemical reactions sparked your curiosity, and how would you inspire others to feel the same way?",
    "criterion": "Interests"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex scientific concept to someone with little background knowledge, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex scientific concept to someone else, and how did you adapt your approach to their understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept, like chemical reactions, to a younger student, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex science concept to someone, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex scientific concept to someone with little background knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex science concept to someone else, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex science concept to someone with little background in it, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex chemistry concept to someone else, and how did you assess their understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex scientific concept to someone with little background in it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex scientific concept to someone with little background in the subject?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand a complex chemistry concept, and how did that experience shape your teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex chemistry concept to a peer, and how did that impact their understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex scientific concept to someone else, and how did you assess their understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex chemistry concept to a peer or sibling, and how did they respond?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex chemistry concept to someone else, and how did that shape your teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex scientific concept to someone with little background, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex science concept to someone else, and how did you ensure they understood it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex science concept to someone, and how would you adapt it for different learners?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you creatively explained a complex science concept to someone else, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex scientific concept to someone with little background in the subject?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex science concept to a younger student, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex chemistry concept to someone else, and how did that experience shape your teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex scientific concept to someone with little background knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex scientific concept to someone with little background knowledge, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex science concept to a peer or younger student, and how did they respond?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did you adapt your teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex chemistry concept to a peer, and how would you adapt your teaching approach for students with varying learning styles?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex scientific concept to someone unfamiliar with it, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explained a complex scientific concept to someone else - what strategies did you use and why?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex scientific concept to someone with little background knowledge, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex scientific concept to someone with little background in it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex scientific concept to someone with little background knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex chemistry concept to a peer, and how did you adapt your approach based on their feedback?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex science concept to someone with little background, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex chemistry concept to a peer, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex science concept to someone with little background in it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex scientific concept to someone with no prior knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex chemistry concept to someone else, and how did you ensure they understood it effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex science concept to someone else, and how did you ensure they understood it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex scientific concept to someone with little background knowledge, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex scientific concept to someone with little background knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex scientific concept to someone with little background knowledge, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex chemistry concept to a peer, and how would you adapt this approach for students of different learning styles?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex scientific concept to someone with little background knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex scientific concept to someone with little background in it, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex chemistry concept to someone, and how did you assess their understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex scientific concept to someone unfamiliar with it, and how did that impact your teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explained a complex scientific concept to someone else - what strategies did you use, and how did you assess their understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explained a complex chemistry concept to someone else - what strategies did you use and why were they effective?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex chemistry concept to someone else, and what did you learn from that interaction?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you creatively explained a complex scientific concept to someone else, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex scientific concept to someone with little background in it, and what did you learn from this encounter?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex scientific concept to someone who struggled with it, and what did you learn from that?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex science concept to someone younger, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex scientific concept to someone else, and how did you ensure they understood it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex science concept to someone else - how did you ensure they understood, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand a complex chemistry concept, and what strategies did you use to make it engaging?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex scientific concept to a friend or family member, and how did you adapt your teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex chemistry concept to someone else, and how did that experience shape your teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone with little background in it, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex science concept to someone with little background in it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you creatively explained a complex scientific concept to someone, and how did you assess their understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex science concept to someone else, and how did you adapt your approach to their understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex scientific concept to someone with little background in it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex science concept to someone with little background knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex scientific concept to someone unfamiliar with it, and what did you learn from this?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex scientific concept to someone with little background knowledge, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex science concept to someone else, and how did you assess their understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex chemistry concept to someone else, and how did you assess their understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex science concept to someone with little background, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex scientific concept to someone with little background knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex scientific concept to someone with little background, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex science concept to someone with little background in it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explained a complex scientific concept to someone else, and how did you adapt your approach to their understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex scientific concept to someone else, and how did you adapt your approach to their understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex chemistry concept to someone with little scientific background, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone with little background knowledge, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex science concept to someone with little background in it, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex scientific concept to someone with little background in it, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explained a complex scientific concept to someone else, and how did you adapt your approach to ensure they understood?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex scientific concept to someone with little prior knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex scientific concept to someone with little background knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you creatively explained a scientific concept to someone else, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex scientific concept to someone with little background in the subject?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex scientific concept to someone without a science background, and how did you adapt your approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex chemistry concept to someone with no prior knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex chemistry concept to a peer, and how did that shape your teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex scientific concept to someone with little background knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex chemistry concept to a peer or sibling, and how did you assess their understanding?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex scientific concept to someone with little background in it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex science concept to someone else, and how did you ensure they understood it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you creatively explained a complex scientific concept to someone with little background knowledge, and how did it help you grow?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explained a complex scientific concept to someone else - how did you simplify it and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex scientific concept to someone with little background in it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex science concept to someone who found it challenging, and what did you learn from this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex science concept to someone with little background, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex chemistry concept to someone else, and how did that help you grow?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you creatively explained a complex science concept to someone else, and how did that experience shape your teaching style?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to a younger student, and how did you adapt your teaching approach?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a time when you explained a complex scientific concept to someone else, and how did you adapt your approach to ensure they understood?",
    "criterion": "Skills"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex science concept to someone, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a scientific concept, and how did that shape your interest in inspiring others through education?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a scientific concept, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept, like a chemical reaction, to someone unfamiliar with the topic?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to others, and how did that shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a scientific concept, and how did that shape your interest in sharing knowledge?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that shape your teaching approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept, like a chemistry principle, to someone with little background in it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught or explained a chemistry concept to someone else, and how did that impact your own understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex science concept to someone else, and how did that shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a scientific concept, and how did that shape your interest in both teaching and chemistry?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept, like a chemistry principle, to someone else, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught or explained a chemistry concept to someone else, and how did that impact your own understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex science concept to others, and how did that shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that shape your teaching approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a scientific concept, and how did that shape your interest in sharing knowledge with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept, like a chemical reaction, to someone with little background knowledge?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a scientific concept, and how did that shape your interest in sharing knowledge?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a scientific concept, and how did that shape your interest in both teaching and chemistry?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a complex chemistry concept to someone else, and how did that shape your own understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a scientific concept to others, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught or explained a chemistry concept to someone else, and what did you learn from that interaction?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex scientific concept to someone else, and what did you learn from that interaction?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a scientific concept to someone, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that shape your teaching approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand a complex chemistry concept, and how did that experience shape your teaching approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex science concept to someone else, and what did you learn from that interaction?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a complex chemistry concept to someone else, and how did that impact your own understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did that shape your teaching approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex science concept to someone else, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept to someone else, and how did that shape your own understanding of the subject?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that impact your own understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a scientific concept to others, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept, like a chemical reaction, to someone unfamiliar with the topic?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex science concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you combined your curiosity for science with a desire to teach or share knowledge with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept, like a chemistry principle, to someone else, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to others, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex science concept to someone, and what did you learn from that interaction?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a scientific concept to others, and how did this shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you creatively explained a complex chemistry concept to someone else, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that impact your own understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand a complex chemistry concept, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explained a complex science concept to someone else, and how did that experience shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a scientific concept, and how did that shape your interest in teaching and learning science?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did that shape your teaching approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you helped someone understand a complex Chemistry concept, and how did that experience shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a complex chemistry concept to someone else, and how did that shape your own understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept to someone else, and how did that shape your own understanding of the subject?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept, like a simple chemistry reaction, to someone else, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a scientific concept, and how did that shape your interest in sharing knowledge?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex science concept to others, and what did you learn from that interaction?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept, like a chemical reaction, to someone with little background knowledge?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex chemistry concept to someone else, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a scientific concept, and how did that shape your interest in sharing knowledge with others?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept to someone else, and how did that shape your interest in both learning and teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an example of how you've creatively explained a complex chemistry concept to someone else, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex science concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did that shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a scientific concept, and how did that shape your interest in teaching and learning chemistry?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a scientific concept, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explained a complex scientific concept to someone else, and how did that experience shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a scientific concept, and how did that shape your approach to learning and teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a complex chemistry concept, and how did that impact your own understanding of the subject?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept to someone else, and how did that shape your understanding of the subject?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept to someone else, and how did that shape your own understanding of the subject matter?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught or explained a scientific concept to someone else, and how did that shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a complex chemistry concept to someone else, and how did that shape your understanding of the subject?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that impact your own understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept to someone, and how did that shape your approach to learning and teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a complex chemistry concept to someone else, and how did that shape your own understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a scientific concept to someone else, and how did that shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a complex chemistry concept to someone else, and how did that shape your own understanding?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex scientific concept to someone else, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex chemistry concept to someone else, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a complex scientific concept to others, and what did you learn from that interaction?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught someone a complex chemistry concept in a simple way, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you creatively explained a scientific concept to others, and how did that shape your interest in teaching and learning?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you describe a moment when you explained a complex scientific concept to someone else, and how did that experience shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept to someone else, and how did that shape your own understanding of the subject?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you explained a complex chemistry concept to someone else, and how did that shape your interest in teaching?",
    "criterion": "Experiences"
  },
  {
    "major": "Chemistry and Education",
    "school": "NTU",
    "question": "Can you share an experience where you taught a scientific concept to someone else, and how did that shape your own understanding of the subject?",
    "criterion": "Experiences"
  }
]