[
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored traditional remedies or holistic health practices that sparked your curiosity about blending ancient wisdom with modern healthcare solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored traditional remedies or holistic healing practices that sparked your curiosity about how ancient wisdom can inform modern healthcare solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored traditional healing practices or holistic wellness that sparked your curiosity about integrating them into your future career or lifestyle?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored traditional healing practices that balance body and mind, and how might integrating such approaches impact your future healthcare career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever witnessed the impact of traditional healing practices, and how might this inspire your future approach to healthcare?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used traditional remedies or holistic practices that sparked your curiosity about how ancient healing methods can complement modern healthcare?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever helped someone recover from an illness using natural remedies, and what sparked your curiosity about holistic healing approaches?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used traditional remedies or holistic approaches to improve your own health, sparking an interest in exploring these practices further?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been intrigued by how traditional practices can complement modern healthcare, and how might you contribute to this integration in your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies that sparked your curiosity about holistic healing and its role in modern healthcare?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored holistic health practices or traditional remedies that spark your curiosity about integrating ancient wisdom with modern wellness approaches?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored traditional healing practices that balance body and mind, and how might this holistic approach shape your future career or personal well-being?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever helped someone using a holistic approach, and what sparked your curiosity to explore traditional healing practices in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in traditional healing practices, and how do you see this interest evolving in your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been fascinated by holistic healing approaches that balance body and mind, and how might this curiosity shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might that intersection inspire your career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored alternative healing methods, and what draws you to understanding the body's balance in a holistic way?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored alternative healing practices, and how do you think integrating traditional remedies with modern healthcare could shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where traditional practices or holistic well-being sparked your curiosity, and how might you explore this further in your future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored traditional healing practices that balance body and mind, and how might such holistic approaches shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been fascinated by holistic healing approaches, and how might integrating traditional practices into modern healthcare inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever helped someone recover from an illness using a holistic approach, and what sparked your curiosity about traditional healing practices?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored how traditional healing practices could shape your future career or personal well-being, and if so, what intrigues you about this holistic approach?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored traditional healing practices that combine physical and spiritual well-being, and how might this holistic approach inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies that sparked your curiosity about how ancient practices can complement modern healthcare?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been fascinated by holistic healing approaches, and how would you see yourself contributing to or learning from these practices in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity about holistic health practices, and how do you see this influencing your future path?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed the impact of traditional remedies, and how might this experience shape your future pursuit of holistic healthcare practices?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever helped someone recover from an illness using a holistic approach, and what sparked your curiosity about traditional healing methods?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been fascinated by holistic healing approaches that combine tradition and modernity, and how might this influence your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and what draws you to exploring this blend in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever witnessed the impact of traditional remedies on someone's well-being, and how might that inspire your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored how traditional healing practices could shape your future career in healthcare, and what draws you to this holistic approach?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies in your life, and how might this experience inspire your future career path?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been fascinated by holistic healing approaches and how ancient practices can complement modern healthcare, sparking a desire to explore this field further?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where traditional practices or holistic health approaches sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored how traditional healing practices align with modern healthcare, and how might this blend shape your future professional aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies; how might exploring ancient healing practices shape your future or daily life?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored traditional healing practices or holistic wellness that sparked your curiosity about integrating them into your future career or personal life?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience or moment that sparked your curiosity in traditional healing practices and how you see this influencing your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed the impact of traditional remedies, and how might exploring these practices align with your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever witnessed the impact of traditional remedies on someone's health, and how might this inspire your future approach to healthcare?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored how traditional healing practices could shape your future career or personal well-being, and if so, what excites you about this connection?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever helped someone using a holistic approach, and what sparked your curiosity to explore traditional healing practices further?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share a personal experience or encounter that sparked your curiosity in traditional healing practices and their role in modern healthcare?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been fascinated by how traditional practices can complement modern healthcare, and how might this blend shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been fascinated by holistic healing approaches that balance body and mind, and how might this inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored traditional healing practices that balance body and mind, and how might such knowledge shape your future career or personal well-being?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might this blend impact your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored alternative healing methods or philosophies that could shape your future approach to healthcare and wellness?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored alternative healing methods, and how might integrating traditional practices with modern healthcare influence your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored traditional healing practices, and how might integrating these with modern healthcare influence your future career path?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies; how might this experience shape your approach to holistic healthcare practices?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever helped someone recover from an illness using alternative remedies, and how did that experience shape your views on holistic healthcare?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored holistic health practices that combine tradition and science, and how might such an approach shape your future career or personal well-being?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies that sparked your curiosity, and how might you see yourself contributing to or learning from such practices?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share how understanding traditional healing practices might shape your future goals or personal well-being?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored alternative healing methods, and how might integrating traditional practices with modern healthcare influence your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever helped someone recover from an illness using alternative remedies, and what sparked your curiosity about holistic healing approaches?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been curious about holistic healing approaches, and how would you see yourself contributing to or learning from such practices in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might this blend impact your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies that sparked your curiosity about holistic health practices, and how might this inspire your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever helped someone recover from an illness using natural remedies, and how did that experience spark your curiosity about holistic healing?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been curious about how traditional healing practices could complement modern healthcare, and how you might contribute to this integration in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or seen traditional remedies that sparked your curiosity about how they work and their role in modern healthcare?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been curious about how traditional practices can complement modern healthcare, and how you might contribute to this integration in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been fascinated by holistic healing approaches and how they can complement modern healthcare in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies that sparked your curiosity about holistic healthcare practices and their role in modern society?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been fascinated by how traditional practices can complement modern healthcare, and how might you contribute to this integration in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed the impact of traditional remedies, and how might this influence your pursuit of a holistic healthcare career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored holistic healing practices, and how do you think integrating traditional remedies with modern healthcare could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where traditional remedies or holistic health practices sparked your curiosity, and how might this shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored holistic healing methods or philosophies that could shape your approach to healthcare and wellness in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you witnessed the impact of traditional healing practices, and how did it spark your curiosity about holistic healthcare approaches?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been fascinated by holistic healing approaches and wondered how ancient practices can complement modern healthcare, inspiring your career path?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored traditional remedies or holistic healing practices that sparked your curiosity about integrating ancient wisdom with modern healthcare?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored traditional healing practices that combine physical, emotional, and spiritual well-being, and how might this holistic approach inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored holistic health practices, and how might integrating traditional healing methods shape your future role in healthcare?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or seen someone benefit from traditional remedies, and how might this spark your curiosity to explore their scientific foundations?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored alternative healing methods or wellness practices that sparked your curiosity about integrating tradition and health in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or seen traditional remedies in your life, and how might exploring their scientific foundations shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been fascinated by holistic healing approaches, and how might studying ancient practices influence your future healthcare career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever been fascinated by holistic healing approaches and wondered how traditional practices can complement modern healthcare in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies that sparked your curiosity, and how might exploring these traditions shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might this blend impact your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored traditional healing practices, and how do you think they could complement modern healthcare in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever considered how traditional healing practices could complement modern healthcare, and how might that intersection inspire your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed alternative healing methods - how might these experiences shape your approach to blending tradition with modern healthcare?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using holistic or natural remedies, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever helped someone using a holistic approach, and how did that experience shape your view on balancing body, mind, and wellness?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone feel better, and how did that experience shape your interest in holistic healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you observed the impact of holistic wellness on someone's health, and how did that influence your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on balancing body and mind?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on balancing body and mind?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on balancing body and mind?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used herbal remedies or acupuncture to manage a personal health issue, and how did this experience shape your views on holistic healthcare?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used herbal remedies or acupuncture to manage a health issue, and how did that experience shape your views on holistic healthcare?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed alternative healing practices that sparked your curiosity, and how do you think they could complement modern healthcare approaches?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used alternative remedies for wellness, and how do you think integrating traditional practices with modern healthcare could benefit society?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever witnessed or experienced the impact of traditional remedies on someone's health, and how might this influence your approach to patient care?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed alternative healing methods - how might these experiences shape your approach to blending tradition with modern healthcare practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you observed or participated in holistic healing, and how did it influence your views on balancing health?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone using a holistic approach, and how did that experience shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did this shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you describe a time when you observed or experienced the impact of traditional practices on someone's well-being, and how did that influence your curiosity?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever helped someone using a holistic approach, and how did that experience shape your view on balancing body, mind, and wellness?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using holistic or alternative approaches, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone using a holistic approach, and how did that experience shape your view on wellness?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you describe a time when you observed or experienced the benefits of holistic health approaches, and how might this shape your future practice?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone recover from an illness, and how did that shape your approach to holistic healthcare?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed alternative healing practices that inspired your curiosity about holistic healthcare approaches?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed traditional remedies in your daily life, and how do you think they could complement modern healthcare approaches?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies in your life, and how do you think they could complement modern healthcare approaches?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed alternative healing methods - how might integrating these experiences shape your approach to holistic healthcare practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone recover from an illness, and how would you integrate traditional healing practices into modern healthcare?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on balancing body and mind?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you combined traditional practices with modern knowledge to improve someone's well-being, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone feel better using a non-Western remedy, and how did that experience inspire you to learn more?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using holistic or alternative approaches, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on balancing body and mind?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using holistic or alternative approaches, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed traditional remedies - how do you think blending ancient practices with modern healthcare could impact your future role?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed alternative therapies - how do you think they could complement modern healthcare in your future practice?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on balancing body and mind?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using holistic or alternative approaches, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed traditional remedies in your life; how do you think they could complement modern healthcare approaches?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone using a holistic approach, and how did that experience shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone using a holistic approach, and how did that experience shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on balancing body and mind?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed alternative healing methods - how do you think they could complement modern healthcare in your future practice?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using holistic or natural remedies, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using holistic or alternative approaches, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone using a holistic approach, and how did that experience shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed traditional remedies; how do you think these practices could influence your approach to healthcare in the future?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone recover from an illness, and how would you integrate traditional healing practices into modern healthcare solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you combined traditional practices with modern understanding to address a health issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did this shape your view on balancing well-being?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on balancing body and mind?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored how traditional healing practices can complement modern healthcare, and how might you contribute to this integration in your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you combined traditional practices with modern knowledge to improve someone's well-being, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed traditional remedies; how do you think they could complement modern healthcare approaches in your future practice?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using holistic or alternative approaches, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you observed the impact of holistic wellness practices, and how might you integrate such approaches into your future healthcare pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on balancing body and mind?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored how traditional healing practices could complement modern healthcare, and how might this integration impact your approach to patient care?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on balancing body and mind?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you combined empathy with analytical thinking to support someone's well-being, and how did this impact your approach to holistic health?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone recover from an illness using a holistic approach, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you observed or participated in holistic healing, and how did it spark your curiosity about blending tradition with modern healthcare?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on balancing body and mind?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you observed or participated in holistic healing practices, and how did it shape your views on balancing body and mind?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone using a holistic approach, and how did that experience shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed alternative remedies for wellness - how might these experiences shape your approach to holistic healthcare practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone recover from an illness using non-Western remedies, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you observed the impact of holistic approaches to health, and how might this shape your future practice?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you blended traditional practices with modern knowledge, and how did this integration shape your understanding of holistic health?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed alternative healing methods - how do you think they could complement modern healthcare in your future practice?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you describe a time when you helped someone using a holistic approach, and how did that experience shape your interest in healing practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you combined empathy with analytical thinking to help someone, and how might this approach apply to holistic healthcare practices?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on balancing body and mind?",
    "criterion": "Skills"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that you think could shape your future approach to healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored any holistic health practices or traditional remedies that sparked your curiosity about integrating ancient wisdom with modern healthcare approaches?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed alternative therapies that blend tradition with wellness, and how might such experiences shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored or been exposed to traditional healing practices that sparked your curiosity about holistic healthcare and its role in modern society?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that could shape your approach to healthcare and patient care in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that blend physical and holistic well-being, and how might this inspire your future path?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed alternative healing practices that sparked your curiosity about integrating tradition and wellness in your future career?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did this shape your interest in healing practices?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices in your community, and how might these experiences shape your future approach to healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed traditional remedies that sparked your curiosity about holistic healthcare, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that blend physical and holistic well-being, and how might this shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or were exposed to traditional healing practices, and how did it spark your curiosity about holistic health?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or were exposed to traditional healing practices, and how did it spark your curiosity about holistic wellness?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies that sparked your curiosity about holistic healing approaches?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional healing practices, and how did it shape your views on integrative healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped others using holistic or traditional practices, and how did it shape your interest in healing?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional practices to improve someone's well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored traditional practices or holistic wellness, and how did it spark your curiosity about healing or health?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or were exposed to traditional healing practices, and how did this spark your curiosity about holistic healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that could shape your approach to healthcare and wellness in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or witnessed the impact of traditional practices on health, and how did that influence your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever helped someone using traditional remedies or holistic practices that sparked your curiosity about blending ancient wisdom with modern healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional healing practices that sparked your curiosity about integrating them into modern healthcare solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that blend physical, emotional, and spiritual well-being, and how might this inspire your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever witnessed or experienced the impact of traditional remedies on someone's health, and how did that influence your curiosity about holistic healing?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been exposed to traditional healing practices that sparked your curiosity about integrating them into modern healthcare solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or witnessed traditional healing practices, and how did it spark your curiosity about holistic health?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed traditional remedies or practices that sparked your curiosity about holistic health approaches?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that blend nature and wellness, and how might this inspire your future studies?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed traditional remedies or practices that sparked your curiosity about holistic healthcare approaches?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or practiced any traditional healing methods that sparked your curiosity about holistic healthcare and its role in modern society?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that blend culture and wellness, and how might this shape your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever witnessed or participated in traditional healing practices that sparked your curiosity about blending ancient wisdom with modern healthcare approaches?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored or been exposed to traditional healing practices that sparked your curiosity about integrating them into modern healthcare solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies or practices that sparked your curiosity about holistic health and wellness?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional practices, and how did it spark your curiosity about holistic healthcare approaches?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed traditional remedies in your daily life that sparked your curiosity about holistic healing approaches?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or witnessed traditional healing practices that sparked your curiosity about their integration with modern healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been exposed to traditional healing practices that spark your curiosity about integrating them into modern healthcare solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored traditional practices or holistic well-being, and how did it shape your curiosity about integrative healthcare paths?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional practices to improve someone's wellbeing, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that could shape your approach to holistic healthcare in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional healing practices, and how did it spark your curiosity about holistic healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did this shape your interest in healing practices?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by holistic healing practices that might shape your future approach to healthcare and wellness?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored any holistic health practices or cultural traditions that spark your curiosity about balancing modern and ancient healing approaches?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional practices to improve someone's well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that could shape your approach to healthcare and wellness in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that might shape your approach to healthcare and wellness in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on balancing well-being?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or witnessed the impact of traditional practices on health, and how did that influence your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies in your life, and how might these experiences shape your approach to healing others?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional healing practices, and how did it shape your views on holistic wellness?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed alternative healing practices that sparked your curiosity about integrating tradition and wellness in your future career?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped others using holistic or traditional practices, and how did this shape your interest in healing professions?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional practices to improve someone's well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed alternative healing practices that sparked your curiosity about integrating tradition and wellness in your future career?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on health and wellness?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that blend natural remedies with holistic well-being, and how might this inspire your future path?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been exposed to traditional healing practices that spark your curiosity about integrating them into modern healthcare solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or practiced any holistic health approaches that blend tradition and science, and how might these experiences shape your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever explored or been exposed to traditional healing practices that sparked your curiosity about integrating them into modern healthcare solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or witnessed traditional healing practices, and how did it spark your curiosity about holistic healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed alternative healing practices that sparked your curiosity about holistic health approaches?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that blend holistic wellness with modern healthcare, and how might this shape your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using holistic or traditional practices, and what sparked your curiosity in these approaches?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did this shape your interest in healing practices?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that blend natural remedies with holistic wellness, and how might this shape your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional healing practices that sparked your curiosity about how ancient remedies can complement modern healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional healing practices, and how did this spark your curiosity about holistic healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional healing practices, and how did it influence your views on holistic healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or witnessed the impact of traditional practices on health, and how did that influence your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that blend natural remedies with holistic wellness, and how might this influence your future path?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or practiced any traditional healing methods that sparked your curiosity about holistic health and wellness?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by holistic healing practices that blend tradition and wellness in your personal or community experiences?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed alternative healing practices that blend tradition and wellness, and how did these experiences shape your views on health?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices in your community, and how might these experiences shape your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you combined traditional practices with modern knowledge to improve someone's well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did this shape your interest in healing practices?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or observed traditional remedies in your daily life that sparked your curiosity about holistic healthcare approaches?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional healing practices, and how did it spark your curiosity about holistic wellness?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies in your life, and how might these experiences shape your approach to holistic healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that could shape your future approach to healthcare and wellness?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional healing practices, and how did this spark your curiosity about holistic healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever witnessed or experienced the impact of traditional remedies on someone's health, and how did that influence your curiosity about holistic wellness?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that blend with modern wellness, and how might this influence your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored traditional healing practices or holistic wellness, and how did it spark your curiosity about integrating these into your future career?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or practiced any traditional healing methods that sparked your curiosity about holistic health and its role in your future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your interest in healing practices?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional practices to improve someone's well-being, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or practiced any traditional healing methods that sparked your curiosity about holistic healthcare approaches?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed alternative healing practices that sparked your curiosity about integrating tradition and wellness in your future career?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you helped someone using a holistic approach, and how did that shape your view on health and wellness?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or been inspired by traditional healing practices that might shape your approach to healthcare in the future?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional practices, and how did it shape your views on holistic well-being or healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you explored or witnessed the impact of traditional healing practices on individuals or communities, and how might this influence your future aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional healing practices, and how did it spark your curiosity about holistic healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or applied traditional health practices, and how did it influence your perspective on wellness?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Can you share an experience where you explored or were exposed to traditional healing practices, and how did that spark your curiosity about holistic healthcare?",
    "criterion": "Experiences"
  },
  {
    "major": "Chinese Medicine",
    "school": "NTU",
    "question": "Have you ever used or witnessed traditional remedies in your life, and how might such experiences shape your approach to holistic healthcare?",
    "criterion": "Experiences"
  }
]