[
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine creating an app that helps people understand their legal rights - what excites you about combining technology and law in innovative ways?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology impacted a social issue, and how you'd like to shape such intersections in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology has impacted a social issue, and how you'd contribute to addressing such challenges in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and ethics, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology has impacted your life, and how you think laws should evolve to address such technological advancements?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine creating an app that revolutionizes how people access legal advice; what excites you about merging technology and law to drive such innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology impacted your life, and how you think laws should evolve to address such technological advancements?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance logical problem-solving with ethical considerations, and how did that experience shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a problem that involved both technology and ethical considerations, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a moment when you realized the impact of technology on societal rules, and how that sparked your curiosity to explore this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you saw technology impacting laws or regulations, and how that sparked your curiosity about their intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or regulation, and how technology could have simplified the process?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology impacted a social issue, and how you think laws could evolve to address such challenges in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a career where technology and justice intersect - what aspects of this unique blend excite you the most about your future professional life?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine developing an app that challenges privacy laws - how would you balance innovation with legal responsibility in such a scenario?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how did that spark your curiosity about the intersection of technology and governance?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a career where technology and justice intersect - what excites you about leveraging coding skills to analyze legal data or develop access-to-justice tools?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a future where technology and legal systems collide - how would you leverage your skills to navigate and innovate at this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you saw technology impacting legal issues, and how did that spark your curiosity about pursuing both fields?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a career where technology and justice intersect - what aspects of this unique blend excite you the most about your future professional life?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a world where technology and legal systems clash; how would you navigate this intersection to drive positive change in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you saw technology impacting laws or governance, and how did that influence your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a future where technology and legal systems clash - how would you navigate this intersection to drive positive change?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a moment when you saw technology impacting everyday life, and how that sparked your curiosity to explore its legal implications?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a career where technology meets legal frameworks - what aspects of this intersection excite you the most about pursuing a field that combines both?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical and non-technical perspectives, and how did that experience spark your curiosity in exploring both?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance logical reasoning with ethical considerations, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how technology could have improved the outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a tech startup faces a legal dispute over data privacy, how would you balance innovation with compliance in this scenario?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a world where technology and legal systems collide - what aspects of this intersection excite or intrigue you about pursuing a career at this unique crossroads?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a moment when you saw technology impacting laws or governance, and how that sparked your curiosity about the intersection of these fields?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a future where technology and legal systems collide - what aspects of this intersection excite or intrigue you about pursuing a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology and legal issues intersected in your life, sparking your curiosity to explore this unique blend further?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine creating an app that helps people understand their legal rights - what excites you about combining technology and law in innovative ways?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine creating an app that simplifies legal processes. What aspects of this project excite you, and how do you see technology shaping the future of law?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Could you share an experience where you navigated a complex rule or system, and how did that spark your curiosity about the intersection of technology and governance?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology impacted a social issue, and how you'd leverage tech to drive positive change in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology and rules intersected in your life, sparking your curiosity to explore this blend further?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology impacted a social issue, and how did that spark your curiosity to explore the intersection of these fields?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology impacted a social issue, and how you'd like to shape such intersections in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how did that spark your curiosity about the intersection of technology and governance?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you saw technology impacting legal issues, and how did that influence your curiosity about their intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you saw technology impacting laws or governance, and how did that spark your curiosity about their intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine creating an app that revolutionizes online privacy - what excites you about combining technology and legal frameworks to drive this innovation?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you saw technology impacting laws or regulations, and how did that spark your curiosity about this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a career where you bridge technology and justice - what excites you about using computational skills to drive legal innovation in your future work?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance technical and non-technical aspects to solve a problem, and how did that shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a moment when technology influenced a rule or law, and how that sparked your curiosity about their intersection in shaping our future?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a career where technology meets legal frameworks - what aspects of this intersection excite or intrigue you about pursuing such a unique path?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology impacted a social issue, and how it sparked your curiosity to explore the intersection of these two fields?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you saw technology impacting laws or regulations, and how did that spark your curiosity about their intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology impacted a social issue, and how you'd leverage tech to drive positive change in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology intersected with rules or governance in your life, sparking your curiosity to explore this fusion further?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a career where you bridge technology and justice - what excites you about shaping the future of legal systems with innovative tech solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine creating an app that helps people understand their legal rights - what excites you about combining technology and law in innovative ways?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a career where technology meets legal frameworks - what excites you about leveraging coding skills to navigate and shape tomorrow's digital laws?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology and legal issues intersected, and how did that spark your curiosity about pursuing both fields?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology impacted a social issue, and how you'd leverage tech to drive positive change in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did that experience shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance logical problem-solving with ethical considerations, and how did that experience shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology and legal issues intersected in your life, sparking your curiosity to explore this unique blend further?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology impacted a social issue, and how you think laws could be adapted to address such challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical knowledge with ethical considerations, and how did that experience shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a career where you bridge technology and justice - what aspects of this intersection excite or motivate you to pursue it?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how did that spark your curiosity about the intersection of technology and governance?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology impacted a social issue, and how you'd leverage tech to drive positive change in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine creating an app that simplifies legal processes - what excites you about blending technology and law to drive societal impact?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a moment when technology impacted a social issue, and how that experience sparked your curiosity to explore the intersection of these two fields?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology influenced a rule or decision, and how did that spark your curiosity about its societal impact?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an example of how you've seen technology impact everyday life, and how that sparked your curiosity to explore its legal implications?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology has impacted a social issue, and how you'd like to contribute to such intersections in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology impacted a social issue, and how you'd want to address such challenges in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology and legal issues intersected in your life, sparking your curiosity to explore this unique blend further?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a career where you bridge technology and justice - what excites you about leveraging coding skills to protect digital rights or fight cybercrime?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you saw technology impacting laws or regulations, and how did that spark your curiosity to explore this intersection further?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a future where technology shapes laws. What excites you about being at the forefront of this intersection, driving change in either field?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how technology could have improved that process for you?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did that experience shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a world where technology outpaces laws - how would you navigate this gap, and what role do you see yourself playing in shaping the future of tech governance?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you saw technology impacting legal issues, and how did that spark your curiosity to explore this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Could you share an experience where technology impacted your daily life, and how you think laws should evolve to address such changes?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and ethics, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a world where technology outpaces laws, how would you navigate the ethical dilemmas that arise, and what role do you see yourself playing in bridging this gap?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you saw how technology impacted rules or laws, and how did that spark your curiosity about their intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you saw technology impacting laws or governance, and how did that spark your curiosity about this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a career where technology meets legal frameworks - what excites you about leveraging coding skills to shape innovative, lawful solutions in our digitally evolving world?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue involving both technology and societal rules, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology has impacted a social issue, and how you think laws should evolve to address such challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Imagine a career where you code the rules that govern online interactions - what excites you about blending technology and legal frameworks?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to balance logical reasoning with ethical considerations, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology has impacted a social issue, and how you'd want to be involved in shaping such outcomes?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or system, and how technology could have improved the outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology has impacted a social issue, and how you think laws should evolve to address such challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where technology impacted a social issue, and how did that spark your curiosity to explore the intersection of tech and governance?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how did that spark your curiosity about the intersection of technology and governance?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology has impacted a social issue, and how you'd want to be involved in shaping such intersections in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how technology could have improved the outcome?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you saw technology impacting laws or social norms, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy online, and how it sparked your curiosity about the intersection of technology and governance?",
    "criterion": "Interests"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you balanced logical reasoning with ethical considerations, and how did you navigate any conflicts that arose?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical knowledge with ethical considerations, and how did you navigate this challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you balanced logical analysis with ethical considerations, and how did that shape your perspective on technology's role in society?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance logical reasoning with ethical considerations, and how did you navigate that dilemma?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical details with ethical considerations, and how did you navigate that challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or regulation, and how did technology help or hinder your understanding of it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical knowledge with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to balance technical details with ethical considerations, and how did you navigate that situation?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance logical analysis with ethical considerations, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical details with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical and non-technical perspectives to solve a problem, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology has impacted your daily life, and how you think laws should evolve to address such technological advancements?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical details with ethical considerations, and how did you navigate this challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology impacted your decision-making, and how did you navigate the ethical implications of that influence?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to balance technical problem-solving with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how did technology help or hinder your understanding of it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology's impact on societal rules fascinated you, and how you'd approach balancing innovation with ethical considerations?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a complex issue involving both technology and ethics, and how did you balance the two?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you balanced logical reasoning with ethical considerations, and how did you navigate any conflicting priorities?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical knowledge with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance logical analysis with ethical considerations, and how did you navigate that dilemma?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical details with ethical considerations, and how did you approach that dilemma?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through how you'd balance the ethical implications of developing AI technology with the legal responsibilities that come with its deployment?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical knowledge with ethical considerations, and how did you navigate that challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology helped you navigate a complex rule or regulation, and how did that experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through how you'd balance the ethical implications of a new technology with its potential legal frameworks in a rapidly evolving digital landscape?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance logical problem-solving with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical and non-technical perspectives, and how did you approach resolving any conflicts that arose?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you balanced logical analysis with ethical considerations, and how did this experience shape your decision-making approach?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical knowledge with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical details with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate this balance?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology impacted a social issue, and how you would balance individual rights with technological innovation in such a scenario?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical and non-technical perspectives to resolve an issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical knowledge with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate this balance?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through a time when you balanced logical reasoning with ethical considerations, and how did you navigate any conflicts that arose?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced analytical and creative thinking in a project, and how this blend might shape your approach to innovative problem-solving in tech-driven fields?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology's role in shaping laws or social norms sparked your curiosity, and how you'd approach balancing innovation with regulation?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology impacted a social issue, and how you'd balance individual rights with technological innovation in such a scenario?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through how you would explain the concept of online privacy to a non-technical friend, and why it matters to you?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an example of how you've balanced analytical thinking with ethical considerations in a project or decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical details with ethical considerations, and how did you navigate that challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through how you would balance the ethical implications of a new technology, like AI-powered surveillance, with its potential legal frameworks?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate this intersection?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through how you would explain a complex technology concept, like AI decision-making, to someone with a non-technical background, like a lawyer?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical knowledge with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical and non-technical aspects to achieve a goal, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance logical reasoning with ethical considerations, and how did you navigate that dilemma?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology impacted a social issue, and how you'd balance individual rights with technological innovation in such a scenario?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical knowledge with ethical considerations, and how did you navigate that challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical knowledge with ethical considerations, and how did you approach this challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a complex rule or policy, and how would you propose simplifying it using technology?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through how you'd balance the ethical implications of a new tech innovation with the legal frameworks that govern its use?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance logical analysis with ethical considerations, and how did you navigate that challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance logical reasoning with ethical considerations, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical details with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through how you would balance the ethical implications of emerging tech, like AI, with the legal frameworks that govern them?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through how you would explain a complex tech concept, like data privacy, to a non-technical person, and why you think this skill is valuable?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you balanced logical reasoning with ethical considerations, and how did you navigate any conflicts that arose?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance logical reasoning with ethical considerations, and how did you navigate that dilemma?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical details with ethical considerations, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you balanced logical analysis with ethical considerations, and how did you navigate any conflicts that arose?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology has impacted your daily life, and how you think laws should evolve to address these changes?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you had to balance logical reasoning with ethical considerations, and how did you navigate this intersection?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology has impacted a social issue, and how you think laws should evolve to address such challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you balanced logical analysis with ethical considerations, and how did you navigate any conflicting priorities?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology has impacted a social issue, and how you would navigate the ethical implications of such a scenario?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical and non-technical perspectives to resolve an issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance ethical considerations with technological possibilities, and how did you navigate that dilemma?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate this balance?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate this challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical details with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue involving both technology and ethical considerations, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical and non-technical perspectives, and how did you navigate the differences?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology has impacted a social issue, and how you would balance individual rights with technological innovation in such a scenario?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you balanced logical reasoning with ethical considerations, and how did that impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through how you would explain the concept of online privacy to a non-technical friend, and why it matters in today's digital age?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through how you'd balance the ethical implications of a new technology, like AI-powered surveillance, with its potential legal frameworks?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology has impacted a social issue, and how you'd balance individual rights with technological innovation in such cases?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you balanced technical problem-solving with ethical considerations, and how did you navigate any conflicting priorities?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance ethical considerations with technological possibilities, and how did you navigate this dilemma?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you walk me through how you'd balance the ethical implications of a new tech innovation with its potential legal consequences in a real-world scenario?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where technology intersected with societal rules, and how would you balance individual freedoms with digital governance in such cases?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical knowledge with ethical considerations, and how did you navigate that?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance logical reasoning with ethical considerations, and how did you navigate this challenge?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical details with ethical considerations, and how did you navigate that balance?",
    "criterion": "Skills"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue involving both technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Have you encountered situations where technology raised legal questions, and how did you navigate or learn from those experiences?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex issue involving both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a situation involving both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue involving both technology and ethical or legal considerations?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how did that impact your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Have you ever used technology to solve a problem or complete a?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue that involved both technology and societal rules, and how did you find the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or regulation in a tech-related?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue involving both technology and societal rules, and how did you find that intersection intriguing?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a situation involving both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue involving both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or system, and how did technology influence your approach to finding a solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a situation involving both technology and ethical decision-making, and how did you balance the two?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue that involved both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a situation involving both technology and ethical decision-making that sparked your interest in their intersection?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue that involved both technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and ethics, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Have you ever navigated a situation where technology and legal or ethical considerations intersected, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and ethics, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue at the intersection of technology and ethics, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Have you encountered situations where technology raised legal concerns, and how did you navigate or learn from those experiences?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and ethics, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and ethics, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a complex rule or regulation, and how did technology influence your approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue that involved both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Have you ever used technology to solve a problem or create something, and how did that experience shape your interest in its potential legal implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Have you ever encountered a situation where technology and legal rights intersected, and how did you navigate or learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to balance technical problem-solving with ethical considerations, and how did you navigate this intersection?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and ethics, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue that involved both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how did that spark your curiosity about the intersection of technology and governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how did that spark your curiosity about the intersection of technology and governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to navigate a complex issue that involved both technology and societal rules, and how you approached it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue involving both technology and ethical considerations, and how you balanced these aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to navigate a complex rule or system, and how you ensured fairness or compliance in your approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue that involved both technology and ethical decision-making, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue that involved both technical and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a situation involving both technology and ethical decision-making, and how did you balance the two?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue involving both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a complex issue that involved both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or policy, and how technology could have improved the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue involving both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a complex issue involving both technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex rule or policy, and how technology could have improved the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and ethics, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue that involved both technical and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Have you ever navigated a situation where technology and legal or ethical considerations intersected, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue that involved both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and ethics, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue that involved both technical and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue involving both technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and ethics, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue that involved both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a situation involving both technology and ethical considerations, and how did you balance the two?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to navigate a complex rule or system, and how you applied logical thinking to find a solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a situation where technology intersected with rules or regulations, and how did you adapt to that intersection?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or policy, and how technology could have improved the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue at the intersection of technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to navigate a complex issue at the intersection of technology and ethics, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue involving both technology and ethics, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Have you ever encountered a situation where technology raised ethical or legal concerns - how did you navigate that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue that involved both technology and ethical or legal considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to navigate a complex issue at the intersection of technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex issue that involved both technical and ethical considerations?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or policy, and how did technology play a role in resolving or complicating the issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a complex issue that involved both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a rule or system, and how did that spark your curiosity about the intersection of technology and governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and ethics, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex issue that involved both technology and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a complex issue that involved both technical and ethical considerations, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and societal rules, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and ethics, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how did technology play a role in your approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a complex issue involving both technology and ethical considerations, and how you balanced the two?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Have you ever encountered a situation where technology raised legal concerns, and how did you navigate or learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex issue at the intersection of technology and ethics, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated a complex issue involving both technology and societal rules, and how you balanced these aspects?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to navigate a complex rule or system, and how did that shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how did that spark your curiosity about the intersection of technology and governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex rule or system, and how did that spark your curiosity about the intersection of technology and governance?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a time when you navigated a complex rule or system, and how did technology influence your approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Have you ever navigated a situation where technology and rules intersected, and how did you adapt to find a balanced solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex issue that involved both technology and ethical considerations?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you share an experience where you had to navigate a rule or policy, and how technology played a role in that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Computing & Law",
    "school": "SMU",
    "question": "Can you describe a situation where you had to navigate a complex issue that involved both technical and ethical considerations?",
    "criterion": "Experiences"
  }
]