[
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or media's impact on society has influenced your career aspirations or personal interests?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic trends influencing media content, and why does this interaction fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or analyzing media consumption habits might influence your future career choices or personal decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how media influences economic decisions, and how did that spark your curiosity in understanding such connections?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed how media influences economic decisions, and what sparked your curiosity in this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how media influences economic trends, and how did that spark your curiosity in exploring this connection further?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media consumption, and why does this intersection intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economics influencing media trends, and how exploring this intersection excites you for future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and how exploring this connection excites you for future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or media consumption habits has influenced your perspective on a real-world issue?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media consumption, and how exploring this intersection excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Could you share an example of how you've observed data or trends influencing decisions in media or everyday life, and why this intrigues you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Could you share an example of how you've seen economic trends influence media consumption habits, and why does this intersection fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic trends influencing media content, and how that sparked your curiosity about their interconnectedness?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or media influences has sparked your curiosity in everyday life or current events?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends shape media content, and why analyzing these connections excites you about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or media influences has sparked your curiosity in everyday life or current events?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Could you share an example of how you've seen economic trends influence media consumption, and why does this intersection intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media consumption, and why does this dynamic intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've used data or analysis to understand a social issue or trend that fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Could you share how analyzing media trends or understanding economic principles might shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how media shapes economic decisions, and how that sparked your curiosity in understanding this connection?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how media shapes public opinion, and how that sparked your curiosity about the economics behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a moment when you noticed how media influences economic decisions, and how that sparked your curiosity to explore this connection further?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and how exploring this intersection excites you about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've used data or trends to inform a personal decision, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and why does this intersection fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've used data or economic principles to understand a media trend or social issue that fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how media shapes economic decisions, and how that sparked your curiosity about this connection?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and why does this dynamic intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and how exploring this intersection excites you about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or analyzing media content has sparked your curiosity or influenced your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or media influences has sparked your curiosity or impacted your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed data or trends influencing decisions in media or everyday life, and why this sparks your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or media consumption habits has influenced your own decisions or sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends shape media content, and how exploring this connection excites you about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Could you share an example of how you've seen economic trends influence media consumption habits, and why does this intersection fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen data or trends shape decision-making in your favorite media platform or hobby, and how does that fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how media shapes economic decisions, and how did that spark your curiosity about their interconnectedness?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic trends influencing media content, and how exploring this intersection excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've used data or analysis to understand a social issue or trend that fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've used data or trends to understand a social issue or media phenomenon that fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how media shapes public opinion, and how this sparked your curiosity about the underlying economic factors at play?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've used data or media to understand a real-world issue, and how it sparked your curiosity about its broader economic implications?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and how exploring this connection excites you for future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic trends influencing media consumption habits, and how exploring this intersection excites your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or media influences has sparked your curiosity in everyday life or current events?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share a moment when you noticed how media shapes public opinion, and how would you analyze its economic impact?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic trends influencing media content, and why exploring this connection excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how media shapes economic trends, and how that sparked your curiosity in understanding this connection?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or media influences has sparked your curiosity in everyday life or current events?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen data or trends shape decision-making in media or everyday life, and why this fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and how exploring this connection excites you about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen data or trends shape decision-making in your favorite media platform or hobby, sparking your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or media consumption habits could influence your future career choices or personal decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and why analyzing these connections excites you about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic trends influencing media consumption habits, and why does this intersection intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or media's influence on public opinion has sparked your curiosity in everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Could you share an example of how you've seen economic trends influence media content, and why does this intersection fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a moment when understanding data trends or media influences sparked your curiosity, and how exploring this further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and why does this interaction spark your curiosity about its broader impacts?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed data or trends influencing decisions in media, and how that sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how media shapes economic decisions, and how that sparked your curiosity to explore this connection further?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share a recent experience where you noticed how media shapes economic trends, and how exploring this connection excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic trends influencing media content, and why does this interaction intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a situation where you found yourself analyzing trends or patterns, and how did that experience spark your curiosity about understanding human behavior or media's influence?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've used data or media to better understand a real-world issue, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and how exploring this intersection excites your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and why exploring this connection excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Could you share an experience where you analyzed how media shapes public perception, and how exploring this further might align with your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how media shapes economic decisions, and how exploring this connection excites your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've used data or media to understand a real-world issue, and what sparked your curiosity in this approach?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how people make choices or noticed trends in media consumption, and how that sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed how media shapes public opinion, and how that sparked your curiosity about the underlying economic drivers?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Could you share how understanding economic trends and analyzing media's impact on society might shape your future goals or daily life decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen data or media influence everyday decisions, and how exploring this intersection excites you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and why does this intersection fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media consumption, and how exploring this intersection excites you for future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how media shapes economic decisions, and how that sparked your curiosity about this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a moment when you noticed how media shapes economic trends, and how exploring this connection excites your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've used data or analysis to understand a social issue or trend that fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and why does this interaction spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've used data or trends to make an informed decision, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how media shapes public opinion on economic issues, and why did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic trends influencing media content, and why does this intersection intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen economic trends influence media content, and why does this intersection fascinate you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've used data or economic principles to understand a media trend or social issue that fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen data or media influence everyday decisions, and how that sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic trends influencing media consumption habits, and why does this intersection intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Could you share an experience where you noticed how media shapes economic decisions, and how did that spark your curiosity in understanding this connection?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or analyzing media consumption habits might shape your future career goals or personal decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic principles influencing media trends, and why does this intersection intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how understanding economic trends or media consumption habits might influence your future career choices or personal decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how media shapes economic trends, and how exploring this connection excites your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economics influencing media trends, and why exploring this connection excites you about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed how media shapes economic decisions, and how exploring this connection excites your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to understand a social issue or media phenomenon that sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've observed economic trends influencing media content, and how exploring this intersection excites your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen data or trends shape public opinion, and how that sparked your curiosity in understanding such dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've used data or analysis to understand a social issue or trend that fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media campaign on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to make a data-driven decision, and how did you communicate its impact to others?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed everyday life data or trends, like social media patterns, to make a more informed decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to understand a trend or behavior, and how did that insight influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media campaign on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed information from social media to inform a decision, and what insights did you gain?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to understand a social trend or issue - what insights did you uncover?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed everyday life scenarios, like consumer behavior or social media trends, to understand broader patterns or insights?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to understand a trend or behavior, and how did that insight influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you had to analyze data and communicate insights effectively to others, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from a news article or social media post to form an opinion or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data or trends, like in news or social media, to form an informed opinion or decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data or trends, like in social media or news, to inform a decision or opinion?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from a news article or social media post to form an opinion or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data or trends, and how did that experience shape your understanding of real-world decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the impact of social media trends on consumer spending habits in your local community?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data or trends to make an informed decision, and how did that impact your outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to understand a social trend or issue - what insights did you uncover?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media campaign on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from social media or news outlets to inform a decision, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from a news article or social media post to form an opinion or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to understand a social issue or trend - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on a local business?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data or trends, like in news or social media, to inform a decision or opinion?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from a news article or social media post to form an opinion or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed everyday life data or trends, and how did that shape your decision-making or perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to understand a social trend or issue - what insights did you uncover?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from a news article or social media post to form an opinion or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media campaign on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to understand a trend or behavior, and how did that insight influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from a news article or social media; how did you evaluate its credibility and potential impact?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data or trends, and how did that insight influence a decision or perspective you held?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to inform a decision, and how would you creatively communicate those insights to a broader audience?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a viral social media campaign on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed information from a news article or social media post to form an opinion, and how did that process influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data or trends to make an informed decision or prediction, and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed everyday life situations, like consumer choices or social media trends, to understand broader patterns or behaviors?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media campaign on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed everyday life scenarios, like social media trends or consumer behavior, to understand broader economic principles at play?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a social media trend or news story; how did you break it down and what insights did you gain?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a viral social media campaign on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media campaign on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to understand a social trend or issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed data or trends to inform a decision, and how did this experience shape your perspective on media's influence?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media campaign on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a viral social media trend on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media campaign on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data or trends, and how would you effectively communicate those insights to a broader audience?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to understand a social trend or issue - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data or trends, like in social media or news, to form an opinion or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from a news article or social media post to form an opinion or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a viral social media trend on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a viral social media trend on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from a news article or social media post to form an opinion or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to understand a social trend or media phenomenon, and what insights did you gain?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data or trends to make an informed decision, and how did that impact your outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from a news article or social media post to form an opinion or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a viral social media trend on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a social media trend or news story to understand its broader economic or societal impact?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed data to understand a social trend, and how you communicated your findings effectively to others?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media campaign on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data or trends, and how would you creatively communicate those insights to a broader audience?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on a local business?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to understand a trend or behavior - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used data or trends to inform a decision, and how did that impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from a news article or social media post to form an opinion or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to understand a social issue or trend, and how did that insight influence your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed data to inform a decision, and how did that experience shape your understanding of consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data or trends, and how would you effectively communicate your findings to a broader audience?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a viral social media trend on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a viral social media trend on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media campaign on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from a news article or social media post to form an opinion or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to inform a decision, and how did you communicate your findings effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data to inform a decision or opinion, and how did that impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from a news article or social media post to form an opinion or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a viral social media campaign on consumer behavior, using examples from your observations?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed data to understand a trend or behavior, and how did that insight influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed a social media trend or news story; what insights did you gain from it?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the economic impact of a trending social media challenge on consumer behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed data or trends, and how you communicated your findings effectively to others?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you walk me through a time when you analyzed information from a news article or social media post to form an opinion or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or daily life, that sparked your curiosity about human behavior or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as trends or data, to inform a decision or create engaging content?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or everyday life, to inform a decision or opinion?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to inform a decision or opinion, and how did that impact your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as trends or data, and communicated your findings in a creative or engaging way?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media consumption or social issues, that sparked your curiosity about their broader economic or societal impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to inform a decision or story, and how did that impact your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or everyday life, that sparked your curiosity about human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how did that shape your understanding of a social or economic issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how did that insight influence a decision or sparked your curiosity about societal behaviors?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in a school project or personal interest, that sparked your curiosity about how people make choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, either in media or daily life, to make an informed decision or understand a social issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how did that insight influence a decision or perspective for you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to understand human behavior, and how did that insight impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to understand a social issue or consumer behavior, and how did you communicate your findings effectively?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, like trends or data, and communicated your findings effectively to others?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how did that shape your understanding of decision-making in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've analyzed data or trends, perhaps in social media or current events, to inform a decision or opinion?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in a school project or hobby, that sparked your curiosity about how people make decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, either in academics or daily life, to make a more informed decision or shaped an opinion?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or daily life, that sparked your curiosity about how people make choices?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, like trends or data, to inform a decision or create engaging content for others?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how did that insight influence a decision or perspective for you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to better understand a social issue or media phenomenon that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media consumption or current events, and how it shaped your understanding of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to inform a decision or perspective, and how did this shape your understanding of a particular issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed data or trends to understand a social issue or consumer behavior, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or everyday life, that sparked your curiosity about societal or economic issues?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or everyday life, and how it influenced your understanding of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information from media sources to inform a decision or opinion, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media consumption or social issues, and how it sparked your curiosity about human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've analyzed information, whether in school or personal projects, to inform a decision or tell a compelling story?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or everyday life, and how it shaped your understanding of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in social media or news, to better understand human behavior or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed data or trends, perhaps in news or social media, to better understand a real-world issue or event?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed data or trends, perhaps in news or social media, to form an opinion or make a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to understand human behavior, and how did that insight surprise or engage you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information from media sources to inform a decision or opinion, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, either in media or everyday life, to make a more informed decision or opinion?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as trends or data, and communicated your findings in a creative or engaging way?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to understand a social issue or consumer behavior, and how did it impact your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how did it influence your decision-making or perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, either in media or everyday life, to make a decision or understand a trend?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information from media sources to form an opinion or make a decision that impacted you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as trends or data, to inform a decision or create engaging content?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as trends or data, from media sources, and how it influenced your decision-making or perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in a school project or hobby, that sparked your curiosity about how media shapes economic decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed data or trends, perhaps in news or social media, to form an opinion or make a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information from media sources to form an opinion or make a decision that impacted you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as trends or data, from social media, news, or current events, and how it shaped your understanding of a topic?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as trends or data, to inform a decision or create engaging content?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to inform a decision or story, and how did that impact your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in social media or news, to inform a decision or spark discussion?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or everyday life, that sparked your curiosity about how people make decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or daily life, that sparked your curiosity about how people or markets behave?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as trends or data, and communicated your findings effectively to others?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as trends or data, and communicated your findings effectively to others?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to inform a decision or perspective, and how did that impact your understanding of the world?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to understand a social issue or consumer behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to understand human behavior, and how did that insight surprise or intrigue you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as a trend or news story, and explain how it shaped your understanding of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, either in media or everyday life, to make a more informed decision or opinion?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to inform a decision or opinion, and how did that impact your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or everyday life, that sparked your curiosity about societal or market behaviors?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how did that shape your understanding of a social or economic issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to understand a social issue or media's impact on behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a situation where you analyzed information from media sources to understand a real-world issue or trend?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or daily life, that sparked your curiosity about how people make decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how did that insight influence a decision or perspective for you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or everyday life, that sparked your curiosity about how people make decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed data or trends, perhaps in a school project or personal interest, that influenced your understanding of media or current events?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, either in media or everyday life, to make a more informed decision or opinion?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as trends or data, to form an opinion or make a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information from media sources to form an opinion or make a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how did that shape your understanding of a particular issue or decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in a school project or hobby, that sparked your curiosity about how people make decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in a school project or personal interest, and how it influenced your understanding of a real-world issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media consumption or social issues, that sparked your curiosity about their broader economic impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to understand human behavior or decision-making, and how did that insight surprise or intrigue you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to understand a social issue or consumer behavior that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as a social media trend or news article, to understand its broader impact on people or society?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how did that insight influence a decision or project you were part of?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or everyday life, that sparked your curiosity about societal or economic patterns?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as trends or data, and communicated your findings effectively to others?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how did that shape your understanding of a social or economic issue?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how did that shape your understanding of people's behaviors or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you describe a time when you analyzed data or trends, perhaps in news or social media, that sparked your curiosity about how people make decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or everyday life, and how it shaped your understanding of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information from media sources to understand a real-world issue or trend, and what insights did you gain?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or everyday life, and how it shaped your understanding of decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as trends or data, and communicated your findings effectively to others?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media or everyday life, that sparked your curiosity about how people make decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to inform a decision or perspective, and how did that impact your understanding of a situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed information, such as a social media trend or a news article, to understand its impact on people's decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media consumption or social issues, that sparked your curiosity about their broader economic impact?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, perhaps in media consumption or social issues, that sparked your curiosity about societal decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends to understand human behavior, and how did this shape your decisions or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an example of how you've used data or analysis to understand a social issue or trend that fascinates you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how did that insight influence a decision or perspective for you?",
    "criterion": "Experiences"
  },
  {
    "major": "Economics and Media Analytics",
    "school": "NTU",
    "question": "Can you share an experience where you analyzed data or trends, and how it influenced your understanding of a social issue or consumer behavior?",
    "criterion": "Experiences"
  }
]