[
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the themes of a novel or the story behind a painting - how might exploring these narratives shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when a literary work or artwork deeply impacted you, and how did that influence your desire to explore its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a book or artwork deeply moved you, and how exploring its?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how a book or artwork has influenced your perspective, and how exploring such connections might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the world of a novel or inspired by a painting? How do you see exploring these creative expressions shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when a book or artwork deeply impacted you, and how did that influence your perspective or curiosity about its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning or unexpected connections between a literary work and a piece of art that inspired you to explore both further?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflecting on your favourite book or artwork, how do you see exploring its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or captivated by a painting, and wondered how they shape our understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Could you share an experience where exploring a literary work or art piece sparked your curiosity, and how might this continue to enrich your life?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when reading a novel or encountering a piece of art profoundly impacted you, and how you think such experiences could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or art pieces, how do you see exploring their historical contexts shaping your understanding of societies and cultures?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or moved by a painting, and wondered how these creative works shape our understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflecting on your favorite book or artwork, how do you think exploring its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the world of a novel or mesmerized by a painting, and wondered how these creative expressions shape our cultural identity?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or an artwork sparked your curiosity, and how did it influence your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or captivated by a painting, and wondered how these creative works shape our understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when a book or artwork deeply moved you, and how did it shape your perspective or spark new interests?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work or artwork deeply resonated with you, and how it influenced your perspective on life or society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or encountering a piece of art challenged your perspective, and how that impacted you?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning or unexpected connections between a novel's themes and a piece of art or historical event?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or mesmerized by a painting, and wondered how they shape our understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or captivated by a painting, and wondered how these creative works shape our understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when a literary work or artwork deeply moved you, and how did that experience shape your curiosity about its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the world of a novel or captivated by the story behind a painting - how do you see exploring these passions shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning in a novel or artwork that challenged your perspectives, and how might exploring such works shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflecting on your favourite book or artwork, how do you think exploring its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning in a novel or artwork that challenged your perspectives, and how might exploring such works shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflecting on a book or artwork that deeply moved you, how do you think exploring its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflect on a moment when a literary work or artwork deeply resonated with you - how did it shape your perspective, and could exploring such connections inspire your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where a literary work or artwork sparked a meaningful conversation for you, and how did it shape your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Could you share an experience where exploring a literary work or an artwork significantly impacted your perspective, and how might such encounters shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning or unexpected connections between a novel's themes and the visual arts, and how might exploring these intersections shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work or artwork deeply resonated with you, and how it influenced your perspective or sparked curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when a book or artwork deeply moved you, and how did that experience shape your curiosity about its historical or cultural?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Could you share an experience where exploring a literary work or artwork sparked your curiosity, and how did it influence your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflecting on your favorite book or artwork, how do you think studying the stories and creative expressions behind them could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when a literary work or artwork deeply impacted you, and how you'd like to explore such connections further in your studies?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when a book or artwork deeply impacted you, and how did that influence your curiosity about the stories behind creative works?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or artwork sparked your curiosity, and how did that shape your perspective or interests?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or inspired by a painting, and wondered how these creative works shape our understanding of society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a novel or viewing a piece of art challenged your perspective, and how did that shape your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning in a novel or artwork that challenged your perspectives, and how might exploring such works shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or art piece sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or artworks, how do you see exploring their historical contexts shaping your understanding of cultures or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or artwork helped you understand a different perspective, and how did that impact you?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflect on a time when a book or artwork deeply moved you - how do you think studying the stories and creative expressions behind them could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflecting on your favorite book or artwork, how do you see exploring its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where a literary work or art piece deeply moved you, and how it influenced your perspective on life or society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or an artwork helped you understand different perspectives, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning or connections between a novel's themes and a painting's imagery, and how might exploring such intersections shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when a book or artwork deeply impacted you, and how did that influence your curiosity about the stories behind creative works?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work or artwork deeply impacted you, and how it influenced your perspective on life or society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work or artwork deeply impacted you, and how did that influence your curiosity about its historical or cultural?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or artwork sparked your curiosity, and how did it influence your perspective or goals?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or art piece sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning or connections between a novel's themes and a piece of art, and how might exploring such intersections shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when a book or artwork deeply impacted you, and how you'd explore its significance in a broader cultural?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the world of a novel or inspired by a painting, and wondered how these creative expressions shape our cultural identities?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning or unexpected connections between a literary work and a piece of art, and how did that shape your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or mesmerized by a painting, and wondered how these creative works shape our understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning or connections between a novel's themes and the historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or artwork sparked your curiosity, and how did it influence your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when reading a novel or viewing a piece of art challenged your perspective, and how that impacted you?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when reading a literary work or encountering a piece of art profoundly impacted you, shaping your perspective or sparking curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or captivated by a painting, and how do you see such experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when a book or artwork deeply impacted you, and how exploring its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how a book or artwork has influenced your perspective, and how you see this shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or artwork challenged your perspective, and how did that impact your personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Could you share an experience where exploring a literary work or artwork sparked your curiosity, and how did it shape your views or aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or captivated by a painting, and wondered how such creative works reflect or shape societal values?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when a book or artwork deeply resonated with you, and how did that experience shape your curiosity about its historical or cultural?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflecting on your favorite book or artwork, how do you think exploring its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Could you share a moment when a book or artwork deeply impacted you, and how you think exploring such works will shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or captivated by a painting, and how do you see exploring these passions shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or artwork deeply impacted your perspective, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflecting on your favorite book or artwork, how do you think exploring its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a book or artwork deeply impacted you, and how you envision such experiences shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the world of a novel or inspired by a painting, and how do you see such creative expressions shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning or unexpected connections between a novel's themes and a piece of art or historical event?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Could you share an experience where exploring a literary work or an artwork sparked new perspectives for you, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when a literary work or artwork deeply resonated with you, and how did that influence your curiosity about its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the themes of a novel or the story behind a painting, and wondered how they shape our cultural understanding?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or captivated by a painting, and wondered how they shape our understanding of society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning in a novel or artwork that sparked your curiosity to explore its historical or cultural?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning in a novel or artwork that challenged your perspectives, and how might exploring such works shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or an artwork sparked your curiosity, and how it influenced your perspective on life or society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or inspired by a painting, and wondered how these creative works shape our understanding of society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work or artwork deeply impacted you, and how it influenced your perspective on life or society?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or moved by a painting, and wondered how such creative works shape our understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflecting on your favorite novel or artwork, how do you see exploring its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share how exploring the stories and creative expressions of different cultures might shape your perspective or career path in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever analyzed a novel or artwork to uncover hidden meanings, and how do you think this skill could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or mesmerized by a painting, and wondered how such creative works shape our understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when reading a novel or analyzing a painting sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever lost yourself in a novel or stood in awe before a painting, and wondered how these creative works shape our understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or captivated by a painting, and wondered how these creative expressions shape our understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Reflecting on a book or artwork that deeply moved you, how do you see exploring its historical?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or mesmerized by a painting, and wondered how they reflect or shape societal values?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share a moment when a book or artwork deeply impacted you, and how that experience might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a social issue or historical?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you discuss how analyzing a novel's themes or a painting's symbolism has influenced your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork deeply impacted your perspective, and how do you think such insights could shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or cultural perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you discuss how analyzing a novel's themes or a painting's symbolism has influenced your perspective on societal issues or personal identity?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork deeply impacted your perspective, and how did that influence your thoughts on its creator's intentions?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work or artwork challenged your perspective, and how did that influence your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a cultural or historical?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork helped you develop a deeper understanding of societal issues or human experiences?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a social issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective on a societal issue or historical event?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or cultural perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you discuss a time when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you discuss how analyzing a novel's themes or a painting's symbolism has influenced your perspective on societal issues or personal identity?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work or artwork challenged your perspective, and how did that influence your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or art piece challenged your perspective, and how did that shape your understanding of its?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has broadened your perspective, and how might this skill enrich your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a societal issue or human experience more deeply?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a social issue or cultural perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you discuss how analyzing a novel's themes or a painting's symbolism has influenced your perspective on societal issues or personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you discuss how analyzing a novel's themes or a painting's symbolism has influenced your perspective on societal issues or personal identity?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork helped you develop a deeper understanding of societal issues or human experiences?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a societal issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork helped you develop a deeper understanding of societal or cultural issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork deeply impacted your perspective, and how might such insights shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work or artwork challenged your perspective, and how you analyzed or reflected on it afterwards?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a different perspective, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you discuss how analyzing a novel's themes or a painting's symbolism has influenced your perspective on societal issues or personal identity?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective on a social issue or personal challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you understand a social issue or cultural perspective differently?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a societal issue or human experience differently?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a social issue or cultural perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective on a social issue or personal belief?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a different perspective, and how did that shape your views?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or cultural movement?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective on a social issue or personal belief?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork deeply impacted your perspective, and how might such insights shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork deepened your understanding of societal or cultural issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or human emotion?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork deepened your understanding of societal or cultural issues, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you discuss a moment when analyzing a literary work or artwork deepened your understanding of societal or cultural issues?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you discuss a moment when analyzing a literary work or artwork helped you better understand a societal issue or cultural movement?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a societal issue, and how did that impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a social issue or historical?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a societal issue or human experience more deeply?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a societal issue or cultural perspective differently?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you discuss how analyzing a novel's themes or a painting's symbolism has influenced your perspective on societal issues or personal growth?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or art piece helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work or artwork deeply resonated with you, and how you analyzed or interpreted its meaning?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a societal issue or cultural perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work or artwork deeply resonated with you, and how you analyzed its themes or historical?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you discuss how analyzing a novel's themes or a painting's symbolism has influenced your perspective on societal issues or personal identity?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a societal issue or human experience differently?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of a literary work or artwork that profoundly impacted you, and how you'd analyze its themes or symbolism in a discussion?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has broadened your perspective on societal issues or human experiences?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective on a social issue or historical event?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you discuss a moment when analyzing a literary work or artwork helped you understand a societal issue or human experience more deeply?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or art piece has influenced your perspective on a societal issue?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a social issue or cultural?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork deepened your understanding of societal or cultural issues, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or art piece has influenced your perspective on societal issues or human experiences?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work or artwork challenged your perspective, and how would you apply that open-mindedness to analyzing unfamiliar texts or art pieces?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a societal issue, and how did that impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective on a social issue or personal belief?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you discuss a moment when a literary work or artwork challenged your perspective, and how this shaped your understanding of its cultural?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work or artwork deeply resonated with you, and how you'd analyze its enduring impact on society today?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a social issue or cultural perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a societal issue or human experience more deeply?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a historical or cultural?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when a literary work or artwork challenged your perspective, and how you applied that newfound insight to a personal or academic project?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or cultural perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork deepened your understanding of societal or cultural issues, and how did that impact you?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a societal issue or human experience differently?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a literary work or artwork has influenced your perspective on societal issues or personal identity?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a cultural or historical?",
    "criterion": "Skills"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or a piece of art helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective or challenged your existing beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or artwork sparked new perspectives for you, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever analyzed a novel, poem, or artwork to uncover hidden meanings, and how did that process impact your perspective on the creator's intent?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or aspect of human nature?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you better understand a societal issue or human experience?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or cultural perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or artwork sparked a new perspective for you, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or aspect of human experience?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a social issue or cultural?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or aspect of human nature?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or a piece of art helped you better understand a societal issue or human emotion?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you understand a societal issue or aspect of human nature?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or aspect of human culture?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or artwork challenged your perspective, and how did that shape your understanding of the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or aspect of human culture?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you understand a societal issue or aspect of human culture better?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever found deeper meaning or unexpected connections between a literary work and a piece of art, and how did that shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or cultural perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork deeply impacted your perspective, and how might such insights shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you understand a societal issue or aspect of human nature differently?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or artwork helped you develop a new perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or art piece helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or artwork challenged your perspectives, and how did that shape your understanding of yourself or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you understand a societal issue or aspect of human experience differently?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you understand a societal issue or influenced your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you understand a different perspective, shaping your views or sparking new interests?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever analyzed a novel or artwork that challenged your perspectives, and how did that shape your understanding of different cultures or societies?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or a piece of art helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or artwork challenged your perspective, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or artwork challenged your perspective, and how did that influence your thoughts on its cultural?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or historical?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or artwork deeply impacted your perspective, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you understand a societal issue or aspect of human experience?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or cultural perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a social issue or cultural?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or artwork sparked your curiosity, and how did you delve deeper into its meaning?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or cultural?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective or challenged your assumptions about the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever analyzed a novel, poem, or artwork that challenged your perspectives, and how did that experience shape your understanding of human expression?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or a piece of art helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or artwork challenged your perspective, and how did that impact your understanding of yourself or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or artwork challenged your perspective, and how did that impact your understanding of yourself or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or artwork helped you understand a different perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever analyzed a novel or artwork that challenged your perspective, and how did that experience shape your understanding of different cultures or societies?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a literary work or artwork helped you understand a social issue or aspect of human experience differently?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a social issue or cultural?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a social issue or cultural perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever analyzed a novel or artwork that challenged your perspectives, and how did that shape your understanding of societal or cultural norms?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or artwork sparked your curiosity, and how did it shape your perspective or interests?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or artistic movement deeply resonated with you, shaping your perspective or sparking curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or a piece of art helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever analyzed a literary work or artwork that challenged your perspectives, and how did that shape your understanding of cultural or historical contexts?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or art piece helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or artwork challenged your perspective, and how did that impact your understanding of yourself or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or artwork helped you develop a new perspective or challenged your existing beliefs?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever analyzed a novel or artwork that challenged your perspective, and how did that experience influence your thoughts or creativity?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work or encountering a piece of art challenged your perspective or sparked a new interest?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or artwork challenged your perspectives, and how did that shape your understanding of yourself or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever analyzed a novel or artwork that challenged your perspective, and how did that shape your understanding of different cultures or histories?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or aspect of human culture?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or art piece sparked your curiosity, and how it influenced your perspective or creativity?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or aspect of human experience?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you understand a societal issue or influenced your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or art piece sparked your curiosity, and how did you delve deeper into its meaning?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective on life or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or artwork helped you understand a different perspective or culture, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective, and how might this skill benefit your future?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or cultural perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a literary work or artwork challenged your perspective, and how did that impact your personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a literary work or artwork sparked your curiosity, and how did you delve deeper into its meaning?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective on a social issue or historical event?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Have you ever analyzed a novel, poem, or artwork that challenged your perspectives, and how did that experience shape your understanding of yourself or society?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a social issue or cultural?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or aspect of human culture?",
    "criterion": "Experiences"
  },
  {
    "major": "English Literature and Art History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a literary work or artwork helped you better understand a societal issue or aspect of human culture?",
    "criterion": "Experiences"
  }
]