[
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past shaping your understanding of the world today?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading a novel or exploring a historical era sparked your curiosity, and how do you see such passions shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever lost track of time reading a novel or exploring historical events, and how do you see such passions shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading literature or exploring historical events sparked your curiosity, and how you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past shaping your understanding of the world and informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite book or historical era, how do you see exploring literature and the past shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or literary work sparked your curiosity, and how did you explore it further?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite book or historical event, how do you see exploring the stories of the past and the power of language shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a historical event or literary work sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you think exploring the stories of the past and the power of language will shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you think exploring the stories of the past and present can shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past shaping your perspective or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past shaping your understanding of the world and informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading a historical text or literary work sparked your curiosity, and how did it influence your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you think exploring the stories of the past and the power of language will shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past and present shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past shaping your understanding of the present?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading a historical novel or essay sparked a new perspective for you, and how did that shape your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favourite book or historical event, how do you think exploring the stories of the past or literature can shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or literary work sparked your curiosity, and how did that influence your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events through literature has influenced your perspective, and how you see this shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favourite books or historical events, how do you see exploring literature and the past shaping your future pursuits or personal perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories and contexts behind them shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the stories of the past or analyzing literature helped you better understand yourself or others?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or historical event, and how might exploring such stories shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or historical event, and how do you think exploring these passions can shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring their cultural contexts shaping your understanding of the world and informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event through literature sparked your curiosity, and how might such intersections shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or literary work that sparked your curiosity, and how exploring it further could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past shaping your understanding of the world or informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past shaping your understanding of the world and its people?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share how exploring the stories of the past or analyzing literary works might shape your perspective or influence your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you think exploring the stories of the past and present can shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or historical event, and how do you see exploring such narratives shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring and analyzing these passions helping you grow in the future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favourite books or historical events, how do you think exploring the stories of the past and the power of language will shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favourite books or historical events, how do you see exploring the stories of the past shaping your understanding of the world today?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favourite books or historical events, how do you see exploring the stories of the past shaping your perspective or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading literature or exploring historical events sparked your curiosity, and how might that passion guide your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever lost track of time reading a novel or exploring a historical era, and how do you see such passions shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did that shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or historical event, and how might exploring such stories shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when exploring a historical event or literary work sparked your curiosity, and how did that shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading a novel or exploring a historical event sparked your curiosity, and how it might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or intrigued by a historical event, and how might exploring such stories shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading literature or exploring historical events sparked your curiosity, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event through literature deepened your understanding of both, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or fascinated by a historical event, and wondered how exploring these passions could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share how exploring the stories of the past or the power of language has sparked your curiosity or influenced your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past shaping your perspective or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading a historical text or literary work sparked your curiosity, and how did it influence your goals or perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favourite books or historical events, how do you think exploring the stories of the past and the power of language will shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where reading a historical text or novel sparked your curiosity, and how it influenced your views on the world?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring literature and the past shaping your future pursuits or personal perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever lost track of time while exploring historical events or analyzing a novel, and how might these passions shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading a historical text or literary work sparked your curiosity, and how it influenced your views or aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite book or historical event, how do you see exploring the stories and contexts of the past shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event through literature sparked your curiosity, and how might this shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see storytelling and the past influencing your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or fascinated by a historical event, and wondered how exploring these passions could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work or exploring a historical event sparked your curiosity, and how it influenced your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it influence your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events through literature has deepened your understanding of a culture or society?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past shaping your understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories and contexts behind them shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever imagined using storytelling to shape perspectives or analyzing the past to inform your future decisions, and how might this resonate with your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past and the power of language shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favourite books or historical events, how do you see exploring the stories of the past and the power of language shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a historical event or literary work sparked your curiosity, and how did that impact your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favourite books or historical events, how do you see exploring the stories of the past and the power of language shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading literature or exploring historical events sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you think exploring the stories of the past and the power of language will shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or intrigued by a historical event, and how do you think exploring such stories can shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favourite books or historical events, how do you see exploring the stories of the past shaping your future perspectives or career?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading a historical novel or essay sparked your curiosity, and how did that experience shape your views on the world?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading a historical novel or essay sparked your curiosity, and how did that influence your desire to explore the past through storytelling?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past and the power of language shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading a novel or historical account sparked your curiosity, and how did that experience influence your goals?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past shaping your understanding of the present and future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favourite books or historical events, how do you see exploring the stories and contexts behind them shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite book or historical era, how do you see storytelling or past events shaping your perspective on current societal issues?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a historical event or literary work sparked your curiosity, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you think exploring their cultural contexts could shape your understanding of society and inform your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events or literary works has influenced your perspective on current societal issues?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite book or historical event, how do you see exploring the stories of the past and the power of language shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favourite books or historical events, how do you see exploring the stories of the past shaping your future perspectives or career?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favourite books or historical events, how do you see exploring the stories and contexts of the past shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share a moment when reading a historical fiction novel or a historical account sparked your curiosity, and how did that shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events through literature has shaped your perspective, and how you see this influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a novel or intrigued by a historical event - how do you see storytelling and the past shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where reading a historical novel or essay sparked your curiosity, and how you think exploring such texts could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring the stories of the past and the power of language shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring their contexts and meanings shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events through literature has shaped your perspective, and how might this continue to influence you?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favourite books or historical events, how do you see exploring the stories of the past shaping your understanding of the world and informing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Have you ever lost track of time reading a novel or exploring historical events, and how do you see these passions shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your favorite books or historical events, how do you see exploring literature and the past shaping your future pursuits or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel sparked a new perspective for you, and how did you apply this insight?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or literary work challenged your perspective, and how you responded to that challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or literary work challenged your perspective, and how did that shape your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical event or literary work helped you better understand a contemporary issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or literary work has helped you better understand a contemporary social issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical event through literature helped you develop a deeper understanding of its cultural significance?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work helped you better understand a contemporary social issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel challenged your perspective, and how did that influence your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on current social issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical event through literature has broadened your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work helped you better understand a contemporary issue or societal challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel challenged your perspective, and how did that shape your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or literary work challenged your perspective, and how did that impact your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work helped you better understand a current social issue or personal challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical event through literature deepened your understanding of both, and how might this skill serve your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you better understand a contemporary issue or societal challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work changed your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work helped you better understand current societal issues or your own perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical event through literature has shaped your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has helped you develop a deeper understanding of contemporary societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical event through literature has deepened your understanding of its cultural impact?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work helped you better understand a contemporary issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on a contemporary issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on contemporary societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or literary work challenged your perspective, and how did that shape your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel challenged your perspective, and how you applied critical thinking to navigate this shift?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work challenged your perspective, and how did that shape your understanding of its relevance today?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on contemporary social issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you better understand a contemporary issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on contemporary social issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on current social issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literature helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or literary work has influenced your perspective on a contemporary issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel deeply impacted your perspective, and how would you analyze its relevance to contemporary society?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or literary work challenged your perspective, and how did you respond to that challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on current societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical event through literature deepened your understanding of both, and how might this skill serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you develop a new perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or literary work changed your perspective, and how would you apply that insight to a modern-day debate?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you better understand a contemporary issue or societal challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel challenged your perspective, and how you applied critical thinking to understand its?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical event through literature helped you understand different perspectives, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on contemporary societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on current social issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you better understand a contemporary social issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical event through literature deepened your understanding of its cultural impact?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on current social issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or event helped you better understand a contemporary social issue, and how did that impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or literary work has influenced your perspective on current social issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on contemporary societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work changed your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literature helped you better understand a current social issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work helped you better understand a contemporary social issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work helped you better understand a contemporary issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has helped you better understand a contemporary social issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel challenged your perspective, and how you applied critical thinking to understand its relevance to contemporary society?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical event through literature has deepened your understanding of its cultural impact?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you develop a new perspective on a contemporary issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel sparked a new perspective for you, and how you applied that insight?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel challenged your perspective, and how you applied critical thinking to reconcile your views?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical event through literature helped you understand different perspectives, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you better understand a contemporary issue or societal challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel sparked your curiosity, and how you explored it further?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you better understand a contemporary issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical event through literature has broadened your perspective, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work helped you better understand a contemporary issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work helped you better understand a contemporary issue or social challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work helped you better understand current social issues or your own perspectives?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical event through literature deepened your understanding of both, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on current social issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or literary work challenged your perspective, and how did that influence your thoughts or actions?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on current social issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on a contemporary issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel challenged your perspective, and how you critically evaluated the author's argument?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical event through literature deepened your understanding of both, and how might this skill serve your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical event through a literary lens deepened your understanding of both, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you develop a new perspective on a contemporary issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or literature has influenced your perspective on current social issues or personal values?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you better understand a contemporary social issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or literary work challenged your perspective, and how did that shape your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literature helped you better understand a contemporary issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or literary work has influenced your perspective on a contemporary social issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literature helped you better understand a contemporary issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on current social issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing a historical text or literary work helped you better understand a current social issue or personal challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel challenged your perspective, and how did that shape your understanding of the world?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or literary work challenged your perspective, and how you critically engaged with it?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or literary work has influenced your perspective on a contemporary issue?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you better understand a contemporary issue or challenge?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or novel sparked your curiosity, and how you explored its themes or?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical text or event has influenced your perspective on current social issues?",
    "criterion": "Skills"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical event or literary work helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a historical event or literary work sparked your curiosity, and how did you delve deeper into it?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you better understand a societal issue or shaped your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical event or literary work has influenced your perspective on current social issues?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your perspective or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did that shape your goals or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a historical event or literary work sparked your curiosity, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event through literature or a literary work through its historical?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did that shape your interests or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where reading a historical text or novel sparked a new perspective for you, and how did that impact your views?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where reading a historical text or novel sparked your curiosity, and how did that shape your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it might shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it shaped your perspectives or interests?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflect on a moment when exploring a historical event or literary work sparked your curiosity - how did this shape your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical event through literature deepened your understanding of its cultural impact?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring historical events through literature deepened your understanding of a societal issue, and how did that impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflect on a moment when analyzing a historical event or literary work deepened your understanding of societal change - how did this shape your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical event or literary work helped you develop a new perspective on current societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring historical events or literary works sparked your curiosity, and how did that shape your goals or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical event or literary work helped you better understand a contemporary issue or societal challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring historical events through literature or writing helped you better understand different perspectives or cultures?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring historical events through literature or writing helped you develop a new perspective or skill?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event through literature or storytelling deepened your understanding of its cultural significance?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events or literary works has influenced your perspective or sparked your curiosity in unexpected ways?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring historical events or literary works helped you develop a new perspective, shaping your interests or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your past, can you share an experience where analyzing a text or historical event deeply impacted your perspective or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring historical events through literature or writing helped you better understand different perspectives or cultures?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where reading a historical text or novel sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical text or literary work helped you better understand a contemporary issue or challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your perspective or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspectives or interests?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your perspective or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events or literary works has influenced your perspective on current social issues or personal values?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where reading a historical text or novel sparked your curiosity, and how did it influence your perspective or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical event or literary work helped you develop a new perspective or challenged your assumptions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event through literature or a literary work through its historical?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a historical event or literary work sparked your curiosity, and how it influenced your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a historical event or literary work sparked your curiosity, and how did that influence your perspective or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical event or literary work helped you better understand a current social issue or personal challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your goals or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your perspective on current societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how reading literature or exploring historical events has influenced your perspective on current social issues?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a literary work or exploring a historical event sparked your curiosity, and how it influenced your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event through literature or storytelling sparked your curiosity or challenged your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when reading a historical text or literary work sparked your curiosity, and how did you explore it further?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where reading a historical text or novel sparked your curiosity, and how did it influence your perspective on the past or present?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing a historical event or literary work has influenced your perspective or decision-making in a personal or academic?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring historical events or literary works sparked your curiosity, and how did that shape your goals or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it influence your perspective or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring historical events or literary works sparked your curiosity, and how did it shape your views or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your perspective or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical event or literary work helped you better understand a contemporary issue or societal challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events or literary works has influenced your perspective on current social issues?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspectives or interests?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did that shape your interests or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your perspectives or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your past, how have your experiences with literature or historical events influenced your perspective on current social issues or your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events or literary works has influenced your perspective on current social issues or personal values?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your views or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events through literature has influenced your perspective on current social issues?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a historical event or literary work sparked your curiosity, and how did that influence your goals or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event through literature or writing helped you develop a new perspective or skill?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a historical event or literary work sparked your curiosity, and how did it influence your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your perspective on current issues?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical event or literary work helped you better understand a contemporary issue or societal challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspective or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your perspective on current issues?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your perspective or decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring historical events or literary works sparked your curiosity, and how did that shape your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did that shape your goals or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how reading a historical text or novel influenced your perspective, and how might this shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did that shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Reflecting on your past, how have your encounters with literature or historical events influenced your perspective on societal issues or personal growth?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how it influenced your views or skills?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring a historical event or literary work sparked your curiosity, and how did that shape your interests or perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an example of how exploring historical events through literature has deepened your understanding of societal changes or human experiences?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing a historical event or literary work helped you better understand current societal issues or your own perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event or literary work sparked your curiosity, and how did it shape your views or goals?",
    "criterion": "Experiences"
  },
  {
    "major": "English and History",
    "school": "NTU",
    "question": "Can you share an experience where exploring a historical event through literature or a literary work through its historical?",
    "criterion": "Experiences"
  }
]