[
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in global markets: what aspects of analyzing international trade trends or managing financial risks excite you about shaping a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Could you share an experience or scenario where you had to analyze global market trends or manage risk, and how it sparked your curiosity about a career in finance?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever been fascinated by how global events impact stock markets, and how would you navigate these dynamics in a future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you navigated uncertain markets or global economic trends, sparking your curiosity in strategic financial decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine managing a global trade portfolio, how would you balance financial risks and opportunities across different international markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a moment when you found global market trends or international trade particularly fascinating, and how you think this curiosity might shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine trading stocks across global markets; what excites you about navigating diverse economies and currencies in a fast-paced, interconnected financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine you're managing a global portfolio; what aspects of navigating diverse markets and currencies excite you about shaping financial strategies worldwide?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever been fascinated by how global events impact financial markets, and how would you navigate such uncertainties in a career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a moment when you were fascinated by global market trends or international trade, and how that sparked your curiosity about a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine managing investments across global markets; what excites you about navigating diverse economies and currencies in a dynamic, interconnected world?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Could you share an experience or moment that sparked your curiosity about global markets or international trade, and how you see this shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever followed global market trends or traded virtual currencies, and how do you see such experiences shaping your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine you're advising a global investor - what excites you about navigating diverse markets, and how might this shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine trading stocks across global markets; what excites you about navigating diverse economies and currencies in a fast-paced, interconnected financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in global markets; what aspects of analyzing international trade trends or managing financial risks excite you about shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Could you share an experience or scenario where you found the dynamics of global markets or international trade particularly intriguing, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a moment when global market trends or currency fluctuations sparked your curiosity, and how you'd like to engage with such dynamics in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about global markets or trading, and how you see yourself engaging with them in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in a global market - what excites you about navigating diverse economies and currencies to drive business decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a moment when you found global market trends or international trade particularly fascinating and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working with global markets daily - what excites you about influencing international trade decisions that impact economies worldwide?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a moment when you were fascinated by global market trends or international trade, and how you think learning about them could shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever followed global market trends or news about international trade, and if so, what sparked your curiosity about their impact on businesses worldwide?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine you're managing a global trade portfolio; what aspects of navigating international markets and financial strategies excite you the most about this role?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever been fascinated by how global events impact stock markets, and how would you navigate such uncertainties in a career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working with global markets daily - what excites you about influencing international trade decisions or navigating their impacts on economies?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a global issue or interacted with different cultures, sparking your curiosity about international markets or trade?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever been fascinated by how global events impact trade flows, and could you see yourself navigating these dynamics in a future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever followed global market trends or news about international trade, and if so, what sparked your curiosity about their impact on businesses worldwide?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever followed global market trends or news about international trade, and if so, what sparked your curiosity about their impact on business decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a moment when you realized how global markets influence everyday life, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated uncertain outcomes, and how does that relate to your curiosity about global market dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in global markets; what excites you about analyzing international trade trends and their impact on economies worldwide?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever followed global market trends or traded currencies online? What excites you about the fast-paced, interconnected world of international finance?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working with global markets: what aspects of international trade dynamics or financial strategies excite you about shaping future economies?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in global markets, what aspects of analyzing international trade trends or managing cross-border investments excite you the most about a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cross-cultural interaction or global issue that sparked your curiosity about international markets or trade dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever been intrigued by how global events impact stock markets or trade policies, and how you might leverage such insights in a future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an example of a global event that sparked your curiosity about how financial markets connect the world, and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in global markets: what excites you about analyzing international trade trends and their impact on business decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in global markets; what aspects of international trade dynamics or financial strategies excite you about shaping future economies?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you navigated global market trends or currencies, sparking your curiosity about international trade dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a situation where you navigated uncertain outcomes, like a game or investment, and how it sparked your curiosity about global markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever been fascinated by how global events impact stock markets or trade policies, and how would you navigate such uncertainties in a career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a moment when global market trends or international trade caught your attention, and how you think they might shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in a global market; what aspects of analyzing international trade trends or managing cross-border investments excite you about shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you navigated global differences, and how does that spark your curiosity about international markets and financial transactions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when global market trends or international trade news sparked your curiosity, and how you explored it further?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine managing global investments; what excites you about navigating diverse markets and currencies to drive growth and inform strategic decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine trading stocks across global markets; what excites you about navigating diverse economies and currencies in a fast-paced, interconnected financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a moment when you were intrigued by global market trends or international trade, and how you think this curiosity could shape your career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you had to analyze global market trends or manage risks, and how did that spark your curiosity about the financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a global issue or interacted with different cultures, and how it sparked your curiosity about international markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in global markets, how do you think analyzing international trade trends could shape your future career or personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine you're tracking global market trends; what excites you about the potential to influence or respond to these shifts in a fast-paced, international environment?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working with global markets daily - what excites you about shaping financial strategies that impact international trade and economies?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex decision involving money or resources, and what sparked your curiosity about global market dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine managing global investments; what aspects of navigating international markets and currencies excite you about shaping future financial strategies?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in global markets; what aspects of analyzing international trade trends or managing cross-border investments excite you about shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a global issue or worked with diverse currencies, sparking your curiosity about international markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you had to make a strategic decision with limited resources, and how does that relate to your aspirations in global markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine you're advising a global investor; what aspects of international markets or trading strategies would you find most intriguing to analyze and why?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in global markets; what aspects of analyzing international trade trends or managing cross-border investments excite you the most about shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever followed global market trends or traded virtual currencies, and how do you think these experiences shape your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or traded something of value, and how did that spark your curiosity about global markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated uncertain markets or made calculated risks, and how did that spark your curiosity about global financial systems?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine you're tracking global market trends; what excites you about how they influence everyday business decisions worldwide?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about global markets and how they impact everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine trading stocks across global markets; what excites you about navigating diverse economies and currencies in a fast-paced, interconnected financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to make a calculated decision involving risk and reward, and how did that experience shape your curiosity about global markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an example of how you've stayed updated on global market trends, and how you see this curiosity shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine managing global investments; what aspects of international markets or financial strategies excite you the most about shaping a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever been fascinated by how global events impact stock markets or trade policies, and how you might navigate these complexities in a future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cross-cultural interaction or global issue that sparked your curiosity about international markets or trade dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine trading stocks across global markets; what excites you about navigating diverse economies and currencies in a fast-paced, interconnected financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Could you share an example of how you've navigated uncertainty in a past decision, and how this relates to your curiosity about global markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a moment when you found global market trends or international trade particularly fascinating and how it sparked your curiosity about a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine managing global investments; what aspects of analyzing international markets or making cross-border financial decisions excite or challenge you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a moment when you realized how global markets influence everyday life, sparking your curiosity about the financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in global markets, what aspects of analyzing international trade trends or managing cross-border investments excite or challenge you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine managing global investments; what aspects of analyzing international markets or mitigating trade risks excite you about shaping future financial strategies?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a situation where you had to make a strategic decision with limited information, and how did that experience spark your curiosity about global markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Could you share an experience where you managed or traded something of value, and what sparked your curiosity about global markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you had to analyze global market trends or manage risk, and how it sparked your curiosity in international finance?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you found global market trends or international trade particularly fascinating and why it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever been intrigued by how global events impact stock markets or trade policies, and how you might leverage this understanding in a future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a moment when you noticed how global events impacted financial markets, and how did that spark your curiosity about the subject?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in global markets, how do you think navigating diverse economies and currencies could challenge or excite you in a future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine trading stocks across global markets; what excites you about navigating diverse economies and currencies in a fast-paced, interconnected financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you navigated global market trends or international transactions, sparking your curiosity about their impact on businesses worldwide?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex financial decision or trade-off, and how did it spark your curiosity about global markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working in global markets; what aspects of analyzing international trade trends or managing cross-border investments excite you about shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity in global markets or international trade, and how you see yourself contributing to this dynamic field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine managing global investments; what excites you about navigating diverse markets and currencies in a fast-paced, interconnected financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine working with global markets daily - what excites you about navigating diverse economies and currencies in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex decision involving money or resources, and what sparked your curiosity about global market dynamics?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a moment when global market trends sparked your curiosity, and how you envision leveraging this fascination in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you had to make a strategic decision involving risk and reward, and how did that shape your curiosity about global markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about global markets, and how you see yourself contributing to or navigating them in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the potential impact of global events on your investment decisions in a simulated trading environment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to make a calculated decision with limited information, and how did you manage the risk involved?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market with fluctuating exchange rates?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential impact of global events on your investment decisions in a simulated trading scenario?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd stay updated on global market trends to make informed decisions in a fast-paced, interconnected trading environment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach learning about global market trends to make informed decisions in a fast-paced, interconnected trading environment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd adapt to a sudden shift in global market trends, and what skills do you think would be crucial in navigating such changes?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the impact of global events on investment decisions, using only the resources you have as a student?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze complex information and make a calculated decision, and how did you ensure it was well-informed?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market with fluctuating exchange rates?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you've never studied before?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed risk or uncertainty, and how did that experience shape your decision-making approach?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing global market trends to inform a hypothetical investment decision in a foreign country?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market with fluctuating exchange rates?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze and mitigate potential risks in a global trade deal, considering fluctuating exchange rates?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of global events on your investment decisions in a simulated trading environment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to make a calculated decision with limited information, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed risk in a personal project or decision, and how did you adapt to unexpected outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd adapt your investment strategy if a global event suddenly impacted trade relations between two countries you're interested in?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or observed a transaction involving different currencies? How did you navigate any challenges that arose from the exchange process?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or traded items of value, and how did you navigate risks or uncertainties in those experiences?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the potential risks and rewards of investing in a foreign market with fluctuating exchange rates?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd stay ahead in a rapidly changing global market, and what skills do you think would be essential for success?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you've never studied before?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the potential risks and rewards of investing in a newly emerging international market?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or tracked a personal budget, investment, or trade? How did you make decisions amidst market fluctuations or risks?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden currency fluctuation on a hypothetical global trade deal you're responsible for?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or traded something of value? How did you make informed decisions, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze complex information to make a strategic decision, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market with fluctuating exchange rates?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine managing a global trade portfolio, how would you balance potential returns with risks like currency fluctuations or geopolitical tensions in your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential impact of a global event, like a trade war, on your investment decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to make a calculated decision with limited information, and how did you assess the potential risks and rewards?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of global events on your investment decisions in a simulated trading environment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of global events on your investment decisions if you were managing a hypothetical international portfolio?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever analyzed or compared financial products from different countries? How did you approach understanding their unique benefits and risks?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd stay updated on global market trends to make informed decisions in a fast-paced, interconnected trading environment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential impact of a global event on your investment decisions in a simulated trading environment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential impact of a global event, like a natural disaster, on international trade dynamics?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed risk in a personal project or investment, and how did you adapt to unexpected changes?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to make a calculated decision with limited information, and how did you assess the potential risks and rewards?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on investing in a foreign stock. How would you approach understanding the risks and opportunities of this international investment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach understanding the risks and opportunities of trading a new foreign currency in a volatile market?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed risk in a personal or group project, and how did that experience shape your decision-making approach?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market with fluctuating exchange rates?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze complex information to make a strategic decision, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market with fluctuating exchange rates?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach analyzing the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the impact of global events on your investment decisions if you were managing a hypothetical international stock portfolio?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on investing in a foreign stock. How would you approach assessing the risks and potential returns in a global market?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a complex situation involving different currencies or international markets?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential impact of a global event, like a natural disaster, on trade dynamics between two countries?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing global market trends to inform a mock investment decision for a hypothetical international trade deal?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on investing in a foreign stock market; what steps would you take to understand the risks and potential returns?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on investing in a foreign stock. How would you approach understanding the risks and opportunities of this international market?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to make a calculated decision with uncertain outcomes, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze and mitigate the risks of investing in a foreign market with fluctuating exchange rates?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you've never studied before?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market with fluctuating exchange rates?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze complex information to make a strategic decision, and how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you would analyze the potential risks and rewards of investing in a foreign market with fluctuating exchange rates?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on investing in a foreign market; what steps would you take to manage the risks involved?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you had to analyze complex information to make a strategic decision, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd adapt to a sudden shift in global market trends, and what strategies you'd use to stay ahead?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd stay updated on global market trends to make informed decisions in a fast-paced, interconnected trading environment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential impact of a global event on your investment decisions in a simulated trading environment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential risks and rewards of investing in a foreign market you're unfamiliar with?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd analyze the potential impact of a global event on your investment decisions in a simulated trading environment?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed risk in a personal or group project, and how did you adapt to unexpected changes?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach analyzing the impact of global events on investment decisions in a rapidly changing market?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you walk me through a time when you navigated a complex, uncertain situation, and how you balanced risk and potential rewards?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Imagine you're advising a friend on investing in a foreign stock market with fluctuating exchange rates; how would you approach this decision?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you engaged in activities or projects that involved analyzing global market trends, managing simulated investments, or negotiating cross-cultural transactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cross-cultural or international scenario that sparked your curiosity about global markets or trade dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a situation where you managed or analyzed financial data, and how did that experience shape your interest in global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex situation involving different currencies, markets, or international news, and how did you adapt?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a strategic decision with limited information, and how did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or traded something of value, like collectibles or currencies, that sparked your curiosity about global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cross-cultural interaction or global issue that sparked your curiosity about international markets or trade relations?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or observed the exchange of goods/services across different countries, and how did this spark your curiosity about global financial systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or traded something of value, like collectibles or currencies, that sparked your interest in global markets or financial strategy?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural differences or global trends, and how did it spark your curiosity about international markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you had to analyze global market trends or manage risk, and how did that shape your interest in pursuing a finance-related career?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cross-cultural interaction or transaction that sparked your curiosity about global markets and financial systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a strategic decision with limited information, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated uncertainty or risk, and how did that shape your approach to decision-making in a global?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you had to analyze global market trends or manage risk, and how it sparked your interest in a finance career?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex decision involving money or resources, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex decision involving risk and reward, and how it shaped your perspective on global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cross-cultural interaction or transaction, and how did it spark your curiosity about global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a situation involving different currencies, exchange rates, or global market trends that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a strategic decision with limited information, and how did you adapt?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cross-cultural interaction or transaction that sparked your curiosity about global markets or financial systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex situation involving money, markets, or global interactions that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a calculated decision with limited information, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed, traded, or analyzed something of value, like a collectible or a virtual item, that sparked your interest in global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you engaged in activities, such as trading simulations or global market research, that sparked your interest in navigating international financial landscapes?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or observed the exchange of goods, services, or currencies across different countries, and how did that experience spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cross-cultural or international interaction that sparked your curiosity about global markets or trade relations?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed, traded, or analyzed something of value, like collectibles or currencies, that sparked your interest in global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed, invested, or traded any form of money or resources, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a situation involving different currencies, trade-offs, or international perspectives that sparked your curiosity about global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex, uncertain situation, and how it sparked your interest in global markets or financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or analyzed financial data, and how did it spark your interest in global markets or trade?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or traded something of value, and how did that experience spark your curiosity about global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or traded anything of value, and how did that experience shape your understanding of global markets or financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cross-cultural interaction or transaction that sparked your curiosity about global financial markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or traded something of value, and how did that experience shape your interest in global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you had to analyze global market trends or manage risk, and how did that shape your interest in pursuing a finance-related career?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex situation involving money, trade, or global interactions that sparked your curiosity about future career possibilities?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or traded something of value, and how did this shape your understanding of global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex situation involving money, trade, or global markets that sparked your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or traded something of value, like collectibles or currencies, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a strategic decision with limited information, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you engaged in activities, such as managing mock investments or analyzing global market trends, that sparked your curiosity about international trade dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or analyzed financial data, and how did it spark your interest in global market dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or tracked financial transactions, and how did this experience shape your interest in global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cross-cultural or international challenge that sparked your curiosity about global markets or trade dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or traded something of value, and what did you learn from that experience about markets or negotiation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a strategic decision with limited information, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you engaged in activities or projects where analyzing global market trends or managing risk sparked your curiosity about shaping international business decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you engaged in activities or projects that involved analyzing global market trends, managing risk, or making strategic financial decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a calculated decision with limited information, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a calculated decision with limited information that might relate to global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or observed the exchange of goods, services, or currencies across different cultures or borders?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated cultural or communication differences, and how it sparked your curiosity about global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex situation involving money, markets, or global interactions that sparked your curiosity about future career possibilities?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you engaged in activities or projects that involve managing risks, analyzing global market trends, or making strategic decisions with limited information?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cross-cultural interaction or international issue that sparked your curiosity about global markets or trade relations?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex situation involving money, markets, or global interactions that sparked your curiosity about future career possibilities?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you engaged in activities or projects that involve analyzing global markets, managing risk, or making strategic financial decisions that impact international outcomes?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a strategic decision with limited information that might relate to global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or traded something of value, and how did that experience spark your curiosity about global markets or financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a strategic decision with limited information, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a strategic decision with limited information that might relate to global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you engaged in any activities, such as trading simulations or global market research, that sparked your curiosity about international financial markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or traded something of value, like collectibles or currencies, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or traded something of value, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you engaged in activities or projects that involve analyzing global market trends, managing risk, or making strategic financial decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you engaged in activities or projects where analyzing global market trends or managing simulated investments sparked your curiosity about international trade dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you had to analyze global market trends or manage risks in a simulated or real-world setting?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you had to analyze global market trends or manage risk, and how it sparked your interest in a finance career?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or observed a transaction involving different currencies, and how did that experience spark your curiosity about global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex decision involving money or resources from different backgrounds or cultures?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you engaged in activities like managing mock investments, analyzing global market trends, or negotiating trades that sparked your interest in international finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cross-cultural or international situation, and how did it spark your curiosity about global financial markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you had to analyze global market trends or manage risk, and how did that shape your interest in a finance career?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a situation involving different currencies, markets, or global events, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex situation involving different currencies, markets, or international trade, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a strategic decision with limited information, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a strategic decision with limited information, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or traded something of value, and how did that experience shape your understanding of global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or traded something of value, and what did you learn from that experience about markets or negotiation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex decision involving money or resources, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a strategic decision with limited information, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a cross-cultural interaction or transaction that sparked your curiosity about global markets and trade dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or analyzed financial data, and how did it spark your curiosity about global market dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you engaged in activities or projects that involve analyzing global market trends, managing risks, or making strategic decisions with international implications?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or analyzed financial data, and how did it spark your interest in global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or tracked financial transactions, even on a small scale, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed risk or made a strategic decision with limited information, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or analyzed financial data, and how did it spark your curiosity about global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or traded something of value, like collectibles or currencies, that taught you about market dynamics or risk?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or traded something of value, like collectibles or currencies, that taught you about risk, strategy, or global market dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or traded something of value, like collectibles or currencies, that sparked your interest in global markets and financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or traded something of value, like collectibles or currencies, that taught you about risk, strategy, or global market dynamics?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex decision involving money or resources, and how did you ensure the best outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex decision involving money, trade, or global markets, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Have you ever managed or traded something of value, like collectibles or currencies, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or traded something of value, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or analyzed financial data, and how did it spark your curiosity about global markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (International Trading)",
    "school": "SMU",
    "question": "Can you share an experience where you navigated a complex decision involving money or resources, and what did you learn from it?",
    "criterion": "Experiences"
  }
]