[
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where managing money or resources sparked your curiosity, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Reflecting on your future goals, what aspects of managing money, analyzing financial markets, or advising clients excite you the most about a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's investment for a year - what excites you about helping them grow their money, and what would you learn from the experience?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or resources sparked your curiosity, and how you think this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine you're managing a friend's investment; what excites you about helping them grow their money, and how would you approach this responsibility?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or resources sparked your curiosity, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Have you ever managed or tracked your own savings or expenses, and if so, what strategies did you find most effective?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a moment when you managed money, and how did that experience spark your curiosity about guiding others' financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or making financial decisions excited you, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or making financial decisions excited or challenged you, and how did that shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money sparked your curiosity, and how you think this interest could shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or making financial decisions sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's investment for a year - what excites you about helping them grow their money, and how would you approach this responsibility?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's savings for a year - what excites you about growing their money, and how would you approach learning the necessary skills?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money sparked your curiosity, and how you think learning about financial systems could shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how you see this interest evolving in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's savings for a year - what excites you about helping them grow their money, and what would you learn from the experience?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's savings for a big purchase - what excites you about helping others make smart financial decisions for their goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's investment for a year - what excites you about helping them grow their money, and what would you enjoy learning to do better?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Could you share an experience or scenario where managing money or resources sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when you managed money, and what sparked your curiosity about how financial systems impact everyday lives or global markets?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or making financial decisions excited you, and how did that spark your curiosity about future career possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see yourself making informed financial decisions that impact businesses or individuals, and what excites you about this responsibility?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or making financial decisions sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see yourself contributing to the flow of money and resources that drive global economies and impact lives?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money or resources, and what sparked your curiosity about the world of banking and financial systems?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's investment for a year - what excites you about helping them grow their money, and what would you enjoy learning to do better?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or making financial decisions sparked your curiosity, and how do you see this interest evolving in your future?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when managing money sparked your curiosity, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see yourself contributing to the world of money management, and what aspects of this field excite you the most?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or making financial decisions sparked your curiosity, and how did that moment shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where managing money or resources sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's investment for a year - what excites you about helping them grow their money, and what would you learn from the experience?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when you managed money, and how did it spark your curiosity about the financial world's role in everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Could you share an experience where managing money or resources sparked your curiosity, and how you see this evolving into a career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or resources sparked your curiosity, and how you think this relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or resources sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when managing money or making financial decisions sparked your curiosity, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a moment when you managed money, even if just in a game, and what excited you about that experience?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how you see this interest shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's savings to help them achieve a big purchase goal - what excites you about advising on financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or making financial decisions excited you, and how you think this curiosity might shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, and how did it spark your curiosity about the financial world's role in everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money sparked your curiosity, and how you see this interest shaping your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or making financial decisions sparked your curiosity, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Could you share an experience where managing money or resources sparked your curiosity, and how do you see this interest evolving in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how it relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's investment; what aspects of helping them grow their money excite you the most about a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's savings to help them achieve a big purchase goal - what excites you about strategizing with money, and how do you see this skill evolving in your future?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how did that moment shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when managing money or resources sparked your curiosity, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where managing money or risk sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or making financial decisions sparked your curiosity, and how do you see this growing into a career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a moment when you realized the impact of financial decisions on individuals or businesses?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience or scenario that sparked your curiosity about how financial systems impact everyday life or global economies?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Reflecting on your future, what aspects of managing money, advising clients, or influencing global markets excite you the most about a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or making financial decisions sparked your curiosity, and how you think this relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how you think this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or resources sparked your curiosity, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's savings for a year - what excites you about helping them grow their money, and what would you learn from the experience?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Could you share an experience or moment that sparked your curiosity about how financial systems or banking practices impact everyday life or global economies?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how it relates to your future career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, and how did that spark your curiosity about the financial world's inner workings?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share a moment when managing money, even if just in a game or simulation, sparked your curiosity about how financial systems work?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see yourself making informed decisions with money, and why does that excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how you see this interest evolving in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how you see this relating to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how it relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how you see this evolving into a future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's investment for a year - what excites you about helping them grow their money, and what would you enjoy learning to do better?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how you think this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's savings for a big purchase - what excites you about helping others make smart financial decisions for their goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Have you ever managed or tracked your own savings or expenses, and if so, what strategies did you find most effective in helping you reach your financial goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how you see this interest shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's savings to help them achieve a big purchase goal - what excites you about advising on financial decisions and their impacts?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how you think this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when managing money or making financial decisions sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how did it influence your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money, even if just your own, sparked your curiosity about its broader impact on businesses or economies?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how might this relate to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's savings to help them achieve a big goal - what excites you about making financial decisions that impact others?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or resources sparked your curiosity, and how do you see this interest shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's investment for a year - what excites you about helping them grow their money, and what would you enjoy learning to do better?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or resources sparked your curiosity, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's investment for a year - what excites you about helping them grow their money, and how would you approach this responsibility?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's investment for a year - what excites you about helping them grow their money, and what would you learn from the experience?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or resources sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, and how did that spark your curiosity about guiding others' financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or resources sparked your curiosity, and how you think this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how you think this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share a moment when managing money or resources sparked your curiosity, and how you think this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience or scenario where you realized the impact of financial decisions on individuals or businesses, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Imagine managing a friend's investment for a year - what excites you about helping them grow their money, and what would you enjoy learning to do better?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience or moment that sparked your curiosity about how financial systems impact everyday life or global economies?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Have you ever managed money or made financial decisions that impacted others, and how did those experiences spark your curiosity about the financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where managing money, even hypothetically, sparked your curiosity, and how it might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or resources sparked your curiosity, and how did that experience shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a moment when you realized the impact of financial decisions on individuals or businesses, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage the financial risks and opportunities of a hypothetical $10,000 investment for a friend's new business venture?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage the financial risks and opportunities of a first-time investor with limited capital?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach investing a hypothetical $10,000, balancing risk and potential returns, and why?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed money, and how would you apply those skills to a career involving financial decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a budget or made a financial decision, and what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed money, even if just in a small way, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage a hypothetical $1,000 investment for a friend's small business, considering risks and returns?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a friend's unexpected inheritance to help them achieve long-term financial goals, considering risk and growth?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage the financial risks and opportunities of a hypothetical $10,000 investment portfolio over the next year?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $1,000 investment over six months, considering risk and return?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach managing a friend's unexpected inheritance to balance risk and growth, reflecting your financial decision-making skills?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage and grow a hypothetical $10,000 investment over the next year, considering risk and return?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, even if just for a small project, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed money, even if just in a simulation or game - what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a budget or made a financial decision, and what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage the financial risks of a first-time investor with limited capital?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach managing a friend's unexpected inheritance to help them achieve long-term financial stability?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a budget or made a financial decision that impacted a group or project?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $1,000 investment over six months, considering risk and growth?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time you managed money, even if just in a personal project, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach managing your first salary to balance saving for long-term goals and everyday expenses?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach managing a friend's unexpected inheritance to help them achieve their long-term financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $10,000 investment for a friend's future business venture, considering risk and return?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would evaluate the financial health of a company you're interested in investing in?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage the financial risks and opportunities of a first-time investor with $10,000 in a volatile market?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach managing a friend's unexpected inheritance to help them achieve long-term financial stability?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage a hypothetical $10,000 investment for a friend's future university fund, considering risk and growth?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a sudden windfall of $10,000, balancing risk and growth to achieve long-term financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, and what did you learn from the experience that could help in a banking role?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage a hypothetical $1,000 investment over six months, considering risk and potential returns?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a budget or made a financial decision, and what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time you managed money, even if just in a personal project, and what strategies would you apply to scale it?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage the financial risks and rewards of investing in a new sustainable energy project with limited data?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $1,000 investment to grow over a year, considering risk and return trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage the financial risks and returns when investing a hypothetical $10,000 for a long-term goal?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage the financial risks and opportunities of a first-time investor with $10,000 to grow over five years?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would evaluate the financial health of a company you're interested in investing in?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage the financial risks and returns when investing a hypothetical $10,000 for a long-term goal?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a budget or made a financial decision? What did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage the financial risks and returns when investing a hypothetical $10,000 for a long-term goal?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage and grow a hypothetical $1,000 investment over the next year?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000, balancing risk and return, and why?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed money, even if just in a personal project, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $1,000 investment for a friend, considering risk and potential returns?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a sudden inheritance of $10,000, balancing risk and growth to achieve long-term financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage a hypothetical $10,000 investment to achieve long-term growth, considering risk and return trade-offs?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a significant amount of money, and what strategies did you use to make informed decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a friend's investment of $1,000 for a year, considering risk and return expectations?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage the financial risks and opportunities of a hypothetical $10,000 investment portfolio for a friend's future business?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage a sudden inheritance of $10,000 to balance risk and growth, reflecting your financial decision-making approach?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed a budget or made a financial decision? How did you approach it and what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed money, and how did that experience shape your understanding of financial decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage the financial risks and opportunities of a first-time investor with a limited budget?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed money, even if just in a personal project - what strategies did you use and why?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage the financial risks and opportunities of a first-time investor with $10,000 to grow over five years?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed money, even if just in a personal project, and what financial decisions did you make?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $1,000 investment for a year, considering risk, growth, and your personal financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a budget or made a financial decision, and what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $1,000 investment for a year, considering risk and growth, to support your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time you managed money, like saving for a goal or budgeting, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage the financial risks and opportunities of investing in a new, unfamiliar market?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, even if just your own, and what strategies did you use to make financial decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach investing a hypothetical $10,000, balancing risk and return to achieve long-term financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a budget or made a financial decision, and what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage the financial risks and opportunities of a first-time investor with a lump sum to invest?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a friend's sudden inheritance to help them achieve long-term financial stability, considering risk and growth?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $10,000 investment for a friend's future business venture, considering risk and return?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, and what strategies would you use to grow a hypothetical $1,000 investment over the next year?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage the financial risks and opportunities of a significant, unexpected inheritance to support your long-term career goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage and grow a hypothetical $1,000 investment over the next year, considering risk and return?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a significant amount of money, and what strategies did you use to make informed financial decisions?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage and grow a hypothetical $10,000 investment over the next year, considering risk and return?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $1,000 investment to achieve long-term growth, and what strategies would you use?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $1,000 investment, balancing risk and return to achieve a long-term goal, like funding your education?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $1,000 investment to grow over a year, considering risk and return?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage the financial risks and opportunities of a hypothetical $10,000 investment portfolio, considering your current knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a budget or made a financial decision, and what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a budget or finances, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000, balancing risk and potential returns, to achieve long-term financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a personal budget or savings goal - what strategies worked, and what would you do differently?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a budget or made a financial decision - what did you learn from the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage a hypothetical $1,000 investment for a year, considering risk and growth opportunities?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage the financial risks and opportunities of a hypothetical $10,000 investment for a social cause you're passionate about?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a budget or made a financial decision that impacted a group or project?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed money, even if just in a personal project, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage and grow $10,000 over a year, considering risk and potential returns?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a friend's unexpected inheritance to help them achieve long-term financial goals, considering risk and growth?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed money, and what did you learn from the experience that could help in a banking role?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a sudden inheritance of $10,000, balancing risk and growth to achieve long-term financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a budget or made a financial decision that impacted a project or group - what did you learn?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed money, even if just for a personal project, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $1,000 investment for a friend, considering risk and return expectations?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, and what did you learn from the experience that could help you in a banking role?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $10,000 investment for a friend's future business venture, considering risks and returns?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach investing a hypothetical $10,000 to balance risk and return, reflecting your understanding of financial decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $1,000 investment, balancing risk and return to achieve a long-term financial goal?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed a personal budget or savings goal - what strategies worked well for you?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $1,000 investment for a year, considering risk and growth, to achieve a personal financial goal?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through a time when you managed money, even if just for a small project - what strategies did you use and why?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you walk me through how you would manage a hypothetical $10,000 investment for a friend's startup, considering risk and return expectations?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or tracked finances, even on a small scale, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, even if just your own, and what did you learn from it about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed, saved, or invested money, and what did you learn from that experience about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, even if just your own, and what did you learn from it about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, saved, or grew money, and what skills did you learn from it that might help in a banking role?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, saved, or grew a sum of money, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or learned about its impact, shaping your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed how financial systems impact everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, took calculated risks, or made financial decisions that impacted a project or goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or tracked finances, even if just for a small project or personal expense - what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, and what did you learn from it about risk, return, or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Have you managed, saved, or invested money in a way that taught you about risk or return, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, even if just your own, and what did you learn from it about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, and what did you learn from it that might help you in a banking career?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, shaping your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or tracked finances, and how did it spark your curiosity about the financial sector's role in everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or tracked money, and how did it spark your curiosity about financial systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made financial decisions, or observed their impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Have you managed, saved, or invested money in any capacity before, and how did those experiences shape your understanding of financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Have you managed money or resources for a group or project before, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or made decisions with money, and how did that experience shape your understanding of financial responsibility?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or tracked money, and how did that experience spark your curiosity about financial systems or careers?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Have you ever managed, saved, or invested money, and how did those experiences shape your understanding of financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, resources, or risk, and how did it shape your understanding of financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, took calculated risks, or made financial decisions that impacted a project or personal goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or observed the management of money, and how did that experience shape your interest in financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or tracked finances, and how did that experience spark your interest in pursuing a career in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a sum of money, and what skills did you develop through that process?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an example of how you've managed or grown a personal 'fund' - like savings, a school project budget, or even a small business venture?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed, saved, or invested money, and what did you learn from that experience about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, even if just your own, and what did you learn from it about financial responsibility?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, even if just your own, and what did you learn from it about financial responsibility?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, saved, or grew money, and what did you learn from it about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, saved, or invested money, and what did you learn from it about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, sparking your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed, saved, or grew funds, and how did that experience shape your interest in financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a sum of money, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or advised on a significant financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, even if just your own, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a sum of money, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed, saved, or grew money, and what did you learn from that experience about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or learned about its impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, saved, or invested money, and what did you learn from it about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, earned, or saved money, and what did you learn from it about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, even if just your own savings, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, took calculated risks, or learned from a financial decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, sparking your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, resources, or risk, and how did it shape your understanding of financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Have you managed money for a school event or personal project? How did you ensure responsible spending and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Have you managed, saved, or invested money in a way that taught you a valuable lesson about financial responsibility or risk?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made financial decisions, or observed their impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or tracked funds, and how did that impact your understanding of financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, sparking your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Have you managed, invested, or grown any funds in a personal or team project, and what financial lessons did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, even if just your own, and what did you learn from it about financial responsibility?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, saved, or grew money, and how did that shape your interest in understanding financial systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, shaping your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or tracked finances, and how did that experience shape your interest in pursuing a career in banking?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, shaping your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, even if just your own, and what did you learn from it about financial responsibility?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, either personally or for a group, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made financial decisions, or observed their impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, even if just your own, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, shaping your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Have you managed, invested, or saved money in a way that sparked your interest in understanding financial systems or markets?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, even if just your own, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made financial decisions, or observed their impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Have you managed, saved, or invested money in a way that taught you a valuable lesson about financial responsibility or risk?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Have you managed, saved, or invested money in a way that taught you a valuable lesson about financial responsibility or risk?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, either your own or for a group, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made financial decisions, or observed their impact, shaping your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, even if just your own, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, even if just your own, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, earned, or invested money, and what did you learn from that situation about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, saved, or grew funds, and what skills did you develop through this process?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an example of a time when you managed money, took calculated risks, or made financial decisions that impacted a project or group?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, either your own or for a group, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, even if just your own, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or influenced a financial decision, and how did it impact your understanding of value or resources?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, saved, or grew money, and how did that shape your understanding of its impact on individuals or businesses?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, even if just your own, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, took calculated risks, or influenced financial decisions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, took calculated risks, or made financial decisions that impacted a project or group, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, made a financial decision, or observed its impact, sparking your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, saved, or grew funds, and how did that shape your interest in understanding financial systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or advised on a financial decision, such as budgeting for an event or personal savings, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, earned, or saved money, and what did you learn from it about the value of financial planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Banking)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, took calculated risks, or made financial decisions that impacted a project or group?",
    "criterion": "Experiences"
  }
]