[
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, what excites you about helping others achieve long-term financial security, and how might this align with your personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Could you share an experience where managing money or resources sparked your curiosity, and how did that moment shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a million dollars - what excites you about helping others achieve their financial goals, and how do you see yourself contributing to that process?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, what aspects of helping others achieve long-term financial goals or navigating investment markets excite you the most?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through a moment when managing money, whether yours or someone else's, sparked your curiosity or taught you a valuable lesson?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money sparked your curiosity, and how you envision helping others achieve financial goals in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever helped manage or advise on money matters for yourself or others - what sparked your curiosity in guiding financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a portfolio for a client with ambitious financial goals; what aspects of this role excite you the most about a career in wealth management?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a friend's inheritance; what aspects of helping them grow their wealth excite you, and how do you see this role fitting your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where managing money sparked your curiosity, and how you think this interest could grow in a career helping others achieve financial goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever helped manage or plan for a significant financial goal, and what sparked your curiosity about guiding others in achieving theirs?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping others achieve their life goals through smart financial decisions - what excites you about guiding people to financial freedom?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their life goals through smart financial planning - what excites you about guiding others to make informed decisions with their money?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Could you share an experience where managing money sparked your curiosity, and how you think it might shape your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a millionaire's wealth portfolio - what aspects of helping others achieve financial goals excite you the most about a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a hypothetical $10,000 portfolio; what aspects of growing wealth excite you, and how do you think this relates to your long-term career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Could you share how managing finances for others or yourself has sparked your curiosity, and how you see this passion evolving in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a million-dollar portfolio; what excites you about helping others achieve long-term financial goals and security?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, what excites you about helping others achieve their long-term financial goals, and how does this align with your personal aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their life goals through smart financial decisions - what excites you about guiding others to financial freedom?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone make a smart financial decision, and how did that moment spark your curiosity about managing wealth?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, what aspects of helping others achieve long-term financial security excite you, and how do you see yourself contributing to this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their life goals through smart financial decisions; what excites you about guiding others to financial freedom?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their life goals through smart financial planning - what excites you about guiding others to make informed decisions with their money?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a millionaire's wealth; what aspects of this role excite you, and how do you think it aligns with your long-term career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future goals, what aspects of helping individuals manage their wealth and achieve financial freedom genuinely excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how you think this relates to your future career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a million dollars; what aspects of helping others achieve financial goals or securing their future excite you the most about a career in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a million-dollar portfolio for a client - what excites you about helping others achieve their financial goals, and how do you stay updated on market trends?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed money, and how did it spark your curiosity about helping others achieve their financial goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Could you share an experience where you helped someone make a smart financial decision, and how did that spark your curiosity about guiding others' wealth?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their life goals through smart financial decisions - what excites you about guiding others to financial freedom?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or making financial decisions sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a moment when you realized the impact of financial planning on someone's life, and how did that inspire your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a client's wealth portfolio; what aspects of helping others achieve financial goals excite you the most about this role?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their life goals through smart financial planning - what excites you about guiding others to make informed money decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see managing wealth for individuals or families aligning with your career aspirations or personal growth goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how did that shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where managing money sparked your curiosity, and how you envision this influencing your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through a moment when managing money, whether yours or someone else's, sparked your curiosity or taught you a valuable lesson?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a portfolio for a client with unique financial goals - what aspects of this challenge excite you about building long-term wealth strategies?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever helped manage money for yourself or others, and what sparked your curiosity about growing wealth over time?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, what excites you about helping others achieve financial security, and how do you see yourself contributing to this goal?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, what excites you about helping individuals achieve their long-term financial goals, and how does this align with your personal aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where managing money, whether yours or someone else's, sparked your curiosity, and how did that moment shape your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their life goals through smart financial planning - what excites you about guiding others in making informed wealth decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or thought about managing money for a family member or friend - what sparked your curiosity about helping others achieve financial goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their life goals through smart financial planning - what excites you about guiding others to make informed money decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their lifelong financial goals - what excites you about guiding others in making smart investment decisions for their future?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a sum of money, and what did you learn from it about your financial decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their life goals through smart financial planning - what excites you about guiding others in making informed decisions with their money?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, what aspects of helping individuals achieve their long-term financial goals excite you about a career in managing wealth?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a client's lifelong savings; what aspects of helping others achieve financial security and growth excite you the most about this responsibility?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a hypothetical $10,000 portfolio; what aspects of growing wealth excite you, and how do you see this aligning with your long-term career goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, what excites you about helping others achieve their long-term financial goals, and how does this align with your personal growth?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through a time when managing money fascinated you, and how you think that curiosity could shape your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their lifelong financial goals - what excites you about guiding others in making smart investment decisions for their future?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever helped manage or plan for a financial goal, and what sparked your curiosity about guiding others in achieving their long-term wealth aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see managing wealth impacting your clients' lives, and what motivates you to take on this responsibility?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you think managing wealth for individuals or families could impact their lives, and why does that interest you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever helped manage money for a family event or personal project - what did you enjoy about that experience?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their life goals through smart financial planning - what excites you about guiding others in making informed decisions with their money?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever helped manage or plan for a financial goal, and what sparked your curiosity about guiding others in achieving theirs?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever helped someone make a smart financial decision, and what sparked your curiosity about guiding others in managing their wealth?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources for yourself or others sparked your curiosity about helping people achieve long-term financial goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money sparked your curiosity, and how you think this interest could grow into a fulfilling career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see managing wealth responsibly impacting your personal growth or career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through a time when managing money sparked your curiosity, and how you think that relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, what aspects of helping individuals achieve their long-term financial goals excite you the most about a career in wealth management?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see yourself helping others achieve their long-term financial goals, and why does this role excite you?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where managing money, whether yours or someone else's, sparked your curiosity, and how it shaped your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Could you share an example of how you've managed or grown your own savings, and what sparked your curiosity about helping others achieve financial goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Could you share an experience where managing money, even if just your own allowance, sparked your curiosity about helping others achieve financial goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever helped manage or plan for a significant financial goal, and what sparked your curiosity about guiding others' financial futures?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or planned for a financial goal, and what sparked your curiosity about helping others achieve theirs?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a friend's first investment; what excites you about helping others grow their wealth, and how would you approach this responsibility?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a client's lifelong savings; what excites you about helping others achieve their financial goals and securing their future?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever helped manage money or made financial decisions for yourself or others, and what sparked your curiosity about guiding people's wealth?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever helped manage money for a family event or personal goal - what did you enjoy about making those financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how it might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where managing money, even if just in a game or simulation, sparked your curiosity about helping others achieve financial goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, what aspects of helping others achieve long-term financial security and success excite you the most?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money or planning for the future sparked your curiosity, and how you think this relates to your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever helped manage money for a family event or personal goal - what did you enjoy about making those financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their life goals through smart financial planning - what excites you about guiding others to make informed decisions with their money?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever helped someone make a smart financial decision, and what sparked your curiosity about guiding others in managing their wealth?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where managing money sparked your curiosity, and how you see this passion guiding your future career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a client's lifelong savings; what excites you about helping others achieve their financial goals and securing their future?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Could you share an experience where managing money, whether yours or someone else's, sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their life goals through smart financial planning - what excites you about guiding others to make informed decisions with their money?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a moment when you helped someone make a smart financial decision, and what sparked your enthusiasm for guiding others in managing their money?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where managing money or resources sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you envision helping others achieve their long-term financial goals, and what excites you about this responsibility?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a moment when managing money sparked your curiosity, and how it relates to your long-term career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience or a hypothetical scenario where managing money for yourself or others sparked your curiosity or concern, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Reflecting on your future, how do you see yourself helping others achieve their long-term financial goals, and what excites you about that responsibility?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their life goals through smart financial planning - what excites you about being part of that journey?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine managing a friend's inheritance; what excites you about helping others grow their wealth, and how do you see this shaping your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine advising a friend on investing their first paycheck - what aspects of this scenario excite you about guiding others' financial decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd prioritize investing a hypothetical $10,000 windfall to balance risk and growth over the next 5 years?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine inheriting a sum of money; how would you balance personal financial goals with responsible wealth management, and what would you prioritize learning to do so effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd help a friend invest their first $10,000, considering their risk tolerance and long-term goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000 windfall to balance risk and growth over the next decade?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical $10,000 investment for a family member's future education?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical $10,000 investment for a family member's future education fund?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000 inheritance to balance growth, risk, and personal financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical $10,000 investment for a friend's future education fund?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize learning about investing and risk management to secure your own financial future?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000 inheritance to balance growth, risk, and personal financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical $10,000 investment for a family member, considering their risk tolerance and goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a young investor with $10,000 to grow their wealth over the next 5 years?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize learning about investment options to help a family member achieve their long-term financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited a large sum of money but has no financial experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd help a friend invest a sudden inheritance of $10,000, considering their risk tolerance and long-term goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd manage a hypothetical $10,000 inheritance to balance growth, risk, and personal financial goals over the next 5 years?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize learning about investment options to help a family member achieve their long-term financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would help a friend, with limited financial knowledge, plan for their long-term financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize learning about investing versus saving for a big future goal, like buying a home?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd prioritize learning about investing, tax planning, and retirement strategies to achieve long-term financial goals for yourself or others?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or helped manage money, and what strategies did you use to achieve your financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage the financial goals of a hypothetical young professional versus a retiree?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd help a family member manage their sudden inheritance, balancing growth and risk, and why you'd choose those strategies?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd help a friend invest a hypothetical $10,000 gift, considering their goals and risk tolerance?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize saving, investing, and spending a hypothetical monthly allowance of $1,000 to achieve long-term financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited a large sum of money but has no financial knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize learning about investing and managing money for a hypothetical client who is your own age?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize learning about different investment options to secure your own financial future?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd help a friend plan for a big purchase, like a car, using smart financial strategies?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited a large sum of money, with no financial experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited a large sum of money but lacks financial knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize learning about different investment options to secure your own financial future?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach helping a family member manage their sudden inheritance, balancing growth with risk?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine helping someone achieve their dream retirement; what skills would you need to balance their financial goals with life's uncertainties?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage the financial goals of a young professional versus a retiree?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd help a friend invest a sudden inheritance of $10,000, considering their risk tolerance and long-term goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize learning about investment options to secure your own financial future?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you managed money, even if just your own allowance, and what strategies did you use to make it grow?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000 gift to balance risk and growth over the next 5 years?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize learning about investment options to secure your own financial future?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited a large sum of money, but has no financial planning experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited a large sum of money, but lacks financial literacy?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical $10,000 investment for a family member's future education fund?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical $10,000 investment for a family member's long-term goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage the financial goals of a young professional versus a retiree?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000 inheritance to balance risk and growth over the next decade?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd prioritize investing a hypothetical $10,000 windfall to balance growth, risk, and personal financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical $10,000 investment for a family member's long-term goal?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000 windfall to balance risk and growth over the next 5 years?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000 gift to balance risk and growth over the next 5 years?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize learning about different investment options to secure your own financial future?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd help a friend invest a sudden inheritance of $10,000, considering their risk tolerance and long-term goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000 gift to balance growth, risk, and personal financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would advise a friend who just inherited a large sum of money with no financial experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000 inheritance to balance growth, risk, and personal financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited a sum of money, considering their future goals and risk tolerance?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage the financial goals of a young professional versus a retiree?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone make a smart financial decision, and what did you learn from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical $10,000 inheritance to balance growth, risk, and personal financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would advise a friend who just received a large inheritance, considering their goals and risk tolerance?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend on allocating their first paycheck towards savings, spending, and giving back effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited a large sum of money, ensuring it grows sustainably over time?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize learning about different investment options to secure your own financial future?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would help a family member invest a sudden inheritance to balance growth and security?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical monthly budget of $5,000 for a young professional, balancing savings, investments, and lifestyle expenses?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited a large sum of money, balancing their financial goals and risk tolerance?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd help a friend invest a hypothetical $10,000, considering their risk tolerance and long-term goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000 inheritance to balance growth, risk, and personal financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would advise a friend who just inherited a sum of money, but lacks financial knowledge, to manage it wisely?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000 windfall to balance risk, growth, and personal financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd prioritize learning about investment options to secure your own financial future?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine advising a friend on investing their first $10,000; what key factors would you consider to balance risk and growth for their long-term goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd help a friend invest their first $1,000, considering their risk tolerance and long-term goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine advising a friend on investing their first salary; what key financial concepts would you prioritize explaining to them and why?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd prioritize investing a hypothetical $10,000 inheritance to balance risk and growth over the next decade?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine you've just inherited a sum of money; how would you balance personal financial goals with responsible wealth management to ensure long-term growth?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would advise a friend who just received a large inheritance, considering both financial goals and personal values?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited a sum of money, considering their goals and risk tolerance?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would advise a friend who just inherited a significant sum of money, but lacks financial literacy?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine advising a friend with $10,000 to invest for the next 5 years; how would you approach this to balance risk and return?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical $10,000 investment for a family member's long-term goal?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited $10,000, considering their long-term goals and risk tolerance?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would advise a friend who just inherited a sum of money, ensuring it grows sustainably over time?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited a sum of money, but lacks financial literacy?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize saving, investing, and spending a hypothetical monthly allowance to achieve long-term financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd prioritize investing a hypothetical $10,000 inheritance to balance growth, risk, and personal financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited a large sum of money but lacks financial knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd prioritize saving, investing, and spending a hypothetical monthly allowance of $1,000 to achieve both short-term goals and long-term financial stability?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine advising a client with a sudden inheritance; how would you balance their desire for luxury spending with long-term financial security?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and allocate a hypothetical $10,000 inheritance to meet both short-term goals and long-term wealth growth?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Imagine advising a friend on investing $10,000 for the first time - what key financial concepts would you prioritize explaining to them and why?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical $10,000 investment for a family member, balancing risk and growth?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd prioritize investing a hypothetical $10,000 inheritance to balance risk and growth over the next decade?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical $10,000 inheritance to achieve long-term financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a friend who just inherited a large sum of money, but lacks financial knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical $10,000 inheritance to balance growth, risk, and personal financial goals?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would advise a friend who just inherited a large sum of money, with no financial planning experience?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize investing a hypothetical $10,000 to balance risk and growth for a long-term goal, like your own future?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you would prioritize and manage a hypothetical $10,000 investment for a family member's future education fund?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you walk me through how you'd advise a hypothetical first-time investor with $10,000 to grow their wealth over five years?",
    "criterion": "Skills"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on money matters, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or advised on a budget, investment, or financial goal, even in a personal or hypothetical?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped manage or grow someone's resources, and what did you learn from it about balancing risk and return?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or advised on a budget, investment, or financial goal for yourself or others that sparked your interest in guiding wealth decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped manage or grow resources, and how did that impact your understanding of long-term financial planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or helped manage money for yourself or others, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or advised on how to grow a sum of money, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on financial decisions, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped manage or grow a resource, and how did that impact your understanding of long-term planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you helped manage or organize something valuable, and how did that experience shape your interest in advising others on financial decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or helped someone manage money, and what did you learn from it about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or helped others manage money, and what did you learn from it about balancing risk and return?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or helped others manage money, and what did you learn from it about financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or advised on a budget, investment, or financial goal for yourself or others - what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or advised on a budget, investment, or financial goal for yourself or others that sparked your interest in guiding wealth decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped manage or grow someone's resources, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or advised on a budget, investment, or financial goal for yourself or others that sparked your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or advised on how to grow a sum of money, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, saved, or grew funds, and what did you learn from it about achieving long-term financial goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a personal 'fund' (e.g., savings, investment, or even a school project budget)?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you helped manage or advise on financial decisions, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you managed or observed others handling personal finances, investments, or budgets that sparked your interest in guiding others' wealth decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a sum of money, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone make a smart financial decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or advised on how to grow a sum of money, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped manage or grow someone's resources, and how did that impact your interest in advising others on financial decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you helped others manage resources or make informed decisions, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you managed or advised on allocating resources, like budgeting for a school event or helping family with financial decisions, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a sum of money, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a personal budget, investment, or resource, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone make a smart financial decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped others make informed decisions about money, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or helped others manage resources, and what skills did you develop through this process?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped manage or allocate resources, and how did that impact your understanding of financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, saved, or grew a sum of money, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you managed or advised on allocating resources, like planning a budget or strategizing investments, that could relate to helping others achieve financial goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped others make informed decisions, and how did that impact your interest in guiding people's financial futures?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on financial decisions, and how did that impact your understanding of personal or family finances?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a personal 'fund' (e.g., savings, investments, or even a school project budget) and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on money matters, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you managed or observed others handling money, and how did those experiences shape your interest in helping others achieve financial goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on the use of resources, and how did that impact your understanding of long-term planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped others make informed decisions with money, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or advised on how to grow a sum of money, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or advised on a financial decision, such as budgeting or investing, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed, saved, or grew funds, and how did this impact your understanding of personal or family finances?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone make a smart financial decision, and how did that shape your interest in guiding others' wealth?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or advised on how to grow a sum of money, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on money matters, and how did it spark your interest in guiding others' financial futures?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on financial decisions, and what skills did you develop through that process?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you managed or tracked finances for yourself, a family member, or a project? How did this experience shape your understanding of wealth growth?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone make a smart financial decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a personal 'fund' (e.g., savings, investment, or even a school project budget)?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on money matters, and what did you learn from navigating its risks or rewards?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped others make informed decisions with money, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or advised on how to grow a sum of money, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on money matters, and what did you learn from that situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on the use of money, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a personal 'fund' (e.g., savings, investments, or even a school project budget)?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you managed or advised on any personal, family, or mock investments that helped shape your understanding of wealth growth strategies?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped manage or grow someone's resources, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a resource, like time, money, or a project, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped manage or grow resources, and how did that impact your understanding of long-term financial planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on financial decisions, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you helped others make informed decisions about money, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped manage or grow a resource, and how did that impact your understanding of long-term planning?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you managed or advised on money matters for others, such as family or friends, and what did you learn from those experiences?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you helped manage or grew a sum of money, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you managed or advised on money matters for yourself or others, and what did you learn from those experiences?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you managed or tracked finances for a personal project, family event, or investment, and what insights did you gain from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped others make informed decisions with their resources, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on financial decisions, and what skills did you develop through that process?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped others manage resources, like planning an event budget or advising a friend on saving money?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or advised on money matters, and how did that experience shape your approach to financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you helped someone make a smart financial decision, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped others make informed decisions about money, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or advised on how to grow a sum of money, such as savings or investments, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you helped someone make a smart financial decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a personal 'fund' (e.g., savings, investment, or even a school project budget)?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on money matters, and how did it spark your interest in guiding others' financial decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you helped manage or allocate resources, and what did you learn from that experience about balancing risk and return?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a personal budget, savings, or investment, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or grew a personal resource, like time or money, and what strategies did you use?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a financial decision, and what did you learn from the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you describe a time when you managed or advised on the use of money, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you ever managed or advised on money matters for yourself or others - what did you learn from these experiences?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Can you share an experience where you managed or advised on a budget, investment, or financial goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Finance (Wealth Management)",
    "school": "SMU",
    "question": "Have you managed or advised on budgeting, investing, or financial planning for yourself or others that sparked your interest in this field?",
    "criterion": "Experiences"
  }
]