[
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your favorite historical figure or event, how do you think studying the past could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think understanding historical events shapes our decisions today?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of a historical event or figure that sparked your curiosity, and how exploring its?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your favorite historical era or figure, how do you think studying the past can shape your perspective on contemporary issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your past experiences, how have historical stories or events influenced your perspective on current global issues, sparking your curiosity to explore the past further?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of a historical event or figure that sparked your curiosity, and how exploring its?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your studies or personal life where understanding the past helped you better navigate a present-day challenge or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your past experiences, how do you think exploring the complexities of the past could enrich your understanding of current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when learning about the past sparked your curiosity, and how do you think exploring historical events shapes our understanding of current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your past experiences, how do you think exploring the past can help you better understand contemporary global issues or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your favorite historical era or event, how do you think understanding the past could influence your future decisions or perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past has influenced your perspective on current events or shaped your personal values?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think understanding the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your past experiences, how have historical events or cultural heritage influenced your perspectives, and what drives your curiosity to explore the past further?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your past experiences, how do you think studying the past can shape your perspective on current global issues or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored a historical event or culture that sparked your curiosity, and how do you think understanding the past could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on life?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your life where understanding the past helped you make sense of a current event or issue?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your own life where understanding the past helped you better navigate a present challenge or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past has influenced your views on current global issues or your own identity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored a historical event or figure that sparked your curiosity, and how do you think studying the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your past where exploring the past helped you better understand a present-day issue or decision you faced?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, whether through a book, film, or personal story, has influenced your perspective on current events?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think studying the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of a historical event or figure that fascinates you, and how exploring its past might shape your future perspectives or decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you understand a present-day issue, and how did that spark your curiosity about its stories?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your favorite historical figure or event, how do you think studying the past could enrich your understanding of current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your studies or personal life where understanding the past helped you better navigate a present-day challenge or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of a historical event or figure that fascinates you and explain how exploring its?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a story from the past, and how do you think exploring such narratives could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your favorite historical figure or event, how do you think studying the past could shape your perspective on current global challenges?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think understanding historical events shapes your perspective on current issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your past where exploring the past helped you better understand a current issue or your own identity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your own life where understanding the past helped you make sense of a current issue or challenge?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your past where exploring the past helped you better understand a present-day issue or decision you faced?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a historical story or event - how do you think exploring the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think understanding history could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your favorite historical era or event, how do you think exploring the past can shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see understanding historical contexts shaping your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring historical events can shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share a historical event or figure that sparked your curiosity, and how exploring its complexities might shape your perspective or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your past where exploring the past helped you better understand a current issue or your own identity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past sparked your curiosity, and how do you think understanding history could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how understanding past events has influenced your perspective on current global issues or your own life decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think understanding historical events could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored the past to understand current events, and how might this curiosity shape your future pursuits or personal worldview?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see understanding historical events shaping your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see historical insights shaping your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored a historical event or figure that sparked your curiosity, and how do you think studying the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think understanding history could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored historical events or cultures outside of schoolwork, and how do you think understanding the past could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see historical insights shaping your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see understanding historical contexts shaping your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a historical story or event? What sparked your curiosity, and how do you think exploring the past could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your own life where understanding the past helped you navigate a present-day challenge or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a historical story or event, and how do you think exploring the past could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a story from the past, and how do you think exploring these narratives could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored how understanding past events can shape your perspective on current global issues, and how might this influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a historical story or event, and how do you think exploring the past could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think understanding history could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your past experiences, what aspects of exploring the past or cultural heritage spark your curiosity and might influence your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or your own identity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand the present, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of a historical event or figure that fascinates you, and how exploring its past might shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a story from the past, and how do you think exploring historical events could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think understanding the past could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your own life where understanding the past helped you navigate a present challenge, and why did that resonate with you?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring historical events could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand the present, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a historical story or event? What sparked your curiosity, and how do you think exploring the past could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a historical story or event, and how do you think exploring the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your favorite historical era or figure, how do you think studying the past could shape your perspective or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you understand a present-day issue, and how might such insights continue to shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your favorite historical figure or event, how do you think studying the past could shape your perspective on contemporary issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, through stories or events, has influenced your perspective on current global issues or your own life?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of a historical event or figure that sparked your curiosity, and how exploring its?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your past where exploring the past helped you better understand a present-day issue or challenge?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past sparked your curiosity, and how do you think understanding historical events shapes our decisions today?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever found yourself lost in a historical narrative, and how do you think exploring the past could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your own experiences, how do you think studying the past can shape your perspective on current global issues or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored the past to understand present-day issues, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past has influenced your views on current events or shaped your personal values?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored the past to better understand current events or societal issues, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored a historical event or figure that sparked your curiosity, and how do you think studying the past could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your own experiences where understanding the past helped you navigate a present-day challenge or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your favorite historical era or event, how do you see studying the past shaping your perspective on contemporary issues or future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your favorite historical figure or event, how do you see exploring the past shaping your perspective on contemporary global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your own life where understanding the past helped you navigate a present challenge, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your own life where understanding the past helped you navigate a present challenge, and how did that shape your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or decision you faced?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think understanding the past could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see this passion influencing your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your own life where understanding the past helped you navigate a present-day challenge or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your favorite historical era or figure, how do you think studying the past can shape your perspective on contemporary global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think understanding the past could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Reflecting on your favorite historical figure or event, how do you think studying the past can shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever encountered a historical event or figure that sparked your curiosity, and how do you think exploring the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think understanding historical events shapes our decisions today?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of a historical event or figure that sparks your curiosity, and how exploring its past might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event or decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or issue?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or societal issue, and how did that impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you better understand a current event or decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how analyzing past events has helped you understand current societal issues or inform your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you walk me through how you would critically analyze a historical event from multiple perspectives, and why you think this skill matters in today's world?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event or personal decision?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or social issue?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how analyzing past events has helped you better understand a current issue or decision you've faced?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or issue in your life or community?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current event, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge or decision?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you understand a present-day issue or influenced your perspective on current events?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a time when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue or challenge you're passionate about?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "How do you think analyzing past events can help you better understand and address current global challenges in your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or social issue, and how did that insight impact you?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "How do you think studying the past helps you better understand current global challenges, and can you share an example from your own experiences?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or social issue?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event or issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you walk me through a time when analyzing the past helped you better understand a present-day issue or decision you faced?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event or decision in your life?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you walk me through a time when analyzing past events helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or social issue?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you walk me through a time when you had to critically analyze a past event to understand its impact on current societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how analyzing past events has helped you understand current social or political issues?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you walk me through a time when analyzing the past helped you understand a current issue or decision you faced?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example from your studies or personal life where analyzing past events helped you better understand current societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you make sense of a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current event or issue better, and how did that insight impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how analyzing past events has influenced your understanding of current societal issues?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that insight shape your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how analyzing past events has helped you better understand a current issue or challenge you're passionate about?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a present-day issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a time when understanding the past helped you better navigate a present-day challenge, and how did that insight shape your actions?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how analyzing past events has helped you understand current societal issues or inform your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you walk me through how analyzing past events has helped you understand current societal issues or informed your decisions in personal projects?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how analyzing past events has helped you better understand a current issue or decision in your own life?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how analyzing past events has helped you understand current societal issues or inform your decision-making in everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you walk me through a time when analyzing the past helped you understand a current issue or decision you faced?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event or personal challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "How do you think analyzing past events helps you better understand current global issues or inform your future decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or family story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored historical events or cultural heritage that sparked your curiosity, and how do you think these experiences might shape your future perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, through a book, project, or visit, has influenced your perspective on current events or your own life?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored or analyzed the past in a way that shaped your understanding of current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, through a project or personal interest, has influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, whether through a project or personal curiosity, has influenced your understanding of current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, such as through a book, film, or family story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, through a book, film, or personal story, has influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, whether through a project or personal curiosity, has influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you understand a present-day issue or shaped your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a contemporary challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand current events or your own cultural identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored historical events or cultural heritage through personal projects, travels, or family stories that sparked your curiosity about the past?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, through a book, film, or personal story, has influenced your understanding of current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, whether through a project or personal curiosity, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand current events or shape your perspective on a contemporary issue?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you understand a current issue or shaped your perspective on a personal or societal level?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of a historical event or figure that sparked your curiosity, and how exploring it impacted your perspective on current issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal curiosity, influenced your perspective on current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand a current issue or decision?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, whether through a book, visit, or story, sparked your curiosity about how it shapes our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored a historical event or cultural tradition that challenged your assumptions, and how did that shape your curiosity about the past?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, through a project or personal interest, has influenced your understanding of current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or family story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored a historical event or figure that sparked your curiosity, and how did it influence your perspective on current global issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal curiosity, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or aspect of your identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on life?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, such as through a book, film, or family story, sparked your curiosity or influenced your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your understanding of current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored historical events or cultural heritage that sparked your curiosity, and how did these experiences shape your perspectives or interests?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, whether through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored historical events or cultural heritage that sparked your curiosity, and how do you think understanding the past could shape your future perspectives?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, through a book, project, or visit, has influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, such as through a book, film, or family story, sparked your curiosity or influenced your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, through a book, film, or personal story, influenced your perspective on current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored a historical event or figure outside of school curriculum that sparked your curiosity, and how did it shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, whether through a project or personal curiosity, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, through a book, film, or personal story, has influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, through a book, film, or personal story, has influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue or shaped your perspective on life?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or influenced your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand a present-day issue or decision?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you understand a present-day issue or decision, and how did that shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of a past project or personal interest where you analyzed the past to inform your understanding of current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a contemporary challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, whether through a project or personal curiosity, influenced your understanding of current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or decision you faced?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, through a book, project, or personal experience, has influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or family story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or family story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue or your own identity better?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Have you ever explored historical events or cultural heritage that sparked your curiosity, and how did that experience shape your understanding of the world?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your understanding of current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you share an example of how exploring the past, through a book, film, or personal story, has influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NUS",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  }
]