[
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how understanding past events has influenced your perspective on current issues, and why this connection excites you?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand the present or shape your perspective on future challenges?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a historical story or event - how do you think exploring the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think understanding historical events might shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how understanding past events has influenced your perspective on current global issues or your own life decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see historical insights shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a story from the past, and how do you think exploring historical events could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that sparked your curiosity, and how exploring its?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a historical event or figure that sparked your curiosity, and how exploring such topics might shape your future perspectives or career?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past has influenced your perspective on current events or your own life decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past sparked your curiosity, and how do you think understanding history could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see this passion influencing your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your life where exploring the past helped you better understand a current event or personal decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think understanding historical events could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a present-day issue, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when learning about the past sparked your curiosity, and how do you think exploring history will shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that sparked your curiosity, and how exploring its?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your own life where exploring the past helped you better understand a current issue or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring these narratives could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored the past to understand current global issues, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored how past events shape current societal norms, and how might this understanding influence your future perspectives or career choices?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or event, how do you think studying the past could shape your perspective on contemporary global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through stories or events, has influenced your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that fascinates you, and how exploring its past might shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that sparked your curiosity, and how exploring its story has influenced your goals?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or event, how do you think exploring the past can shape your perspective on contemporary issues or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your own life where understanding the past helped you navigate a present-day challenge or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or decision you were facing?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think understanding historical events shapes your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past has influenced your understanding of current events or your personal values?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think understanding the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical figure or event, how do you think exploring the past can shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event or figure that sparked your curiosity, and how do you think understanding the past could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event or figure that sparked your curiosity, and how do you see such explorations shaping your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or your own identity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think exploring the complexities of the past can shape your perspective on contemporary global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your studies or personal life where understanding the past helped you better navigate a present-day challenge or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored how past events shape our present, and how might understanding these connections influence your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or event, how do you think exploring the past can shape your perspective on current global issues or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a historical story or event - how do you think exploring the past could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think understanding historical events shapes our decisions today?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think understanding the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past sparked your curiosity, and how do you think understanding historical events can shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or event, how do you see its lessons shaping your perspective on current global issues or your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical figure or event, how do you think studying the past could shape your perspective or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or event, how do you think studying the past could shape your perspective on contemporary global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think studying the past can help you navigate and shape your future decisions and perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a story from the past, and if so, what sparked your curiosity to learn more about it?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event or figure that sparked your curiosity, and how did it influence your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a present-day issue, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see this passion shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past sparked your curiosity, and how do you see such exploration shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think exploring the complexities of the past can shape your perspective on contemporary global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring these narratives could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event or figure that sparked your curiosity, and how do you think studying the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your past where exploring the past helped you better understand a present-day issue or decision you faced?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical figure or era, how do you think studying the past could influence your perspective on modern global challenges?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a story from the past, and if so, how do you think exploring historical events could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that fascinates you, and how exploring its story might shape your perspective or future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that sparks your curiosity, and how exploring its?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a historical story or event - what sparked your curiosity, and how do you think exploring the past could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your past experiences, can you describe a moment when understanding the past helped you better navigate a present challenge or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored the past to better understand current global issues, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think studying the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how understanding the past has influenced your perspective on current events or personal decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a present-day issue or shaped your perspective on the world?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think studying history could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that sparked your curiosity, and how exploring its?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past has influenced your perspective on current events or your own life decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a historical story or event - what sparked your curiosity, and how do you see the past shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or decision you were facing?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or event, how do you think understanding the past could shape your perspective on current global issues or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that sparks your curiosity, and how exploring its significance might shape your perspective or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your own life where understanding the past helped you navigate a challenge or influenced your perspective on current events?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event that sparked your curiosity - how do you think studying the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a historical narrative, and if so, what sparked your curiosity about the past and its impact on our present?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think understanding historical events could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your past where exploring the past helped you better understand a current issue or decision you faced?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think understanding the past could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your past where exploring the past helped you better understand a current issue or challenge?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how did understanding its?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your past experiences, what aspects of exploring the past fascinate you the most, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how learning about past events has influenced your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past has influenced your perspective on current events or your own life decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your own life where understanding the past helped you better navigate a present-day challenge or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think understanding the past could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical figure or event, how do you think studying the past can shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and if so, how do you think exploring these narratives could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think understanding historical events shapes our perspectives today?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think studying the past can help shape your future goals or perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring historical events could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past sparked your curiosity, and how do you think understanding historical events shapes our decisions today?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how understanding past events has influenced your perspective on current global issues, and why this intrigues you?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or figure, how do you think understanding the past could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a historical narrative and wondered how understanding the past could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a story from the past, and if so, how do you think exploring historical narratives could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a historical story or event - how do you think exploring the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or social issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand current societal issues or inform your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your studies or personal experiences where analyzing the past helped you better understand a current issue or decision?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you better understand a current issue or challenge you're passionate about?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge or decision, and how did that insight shape your actions?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that insight shape your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current event or issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue or decision you've faced?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue or decision you faced?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue or influenced a decision you've made?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event or personal decision?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing the past helped you understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing the past helped you understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that insight shape your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or social issue?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has influenced your understanding of current societal issues or informed your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event or personal decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current event or issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or societal issue?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or social issue?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a time when analyzing the past helped you understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event or decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue or decision you faced?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or issue, and how did that insight impact you?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue or challenge you're passionate about?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that insight shape your actions?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event or decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or societal issue, and how did that impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge or decision, and what skills did you use to make that connection?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you better understand a current issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand current societal issues or inform your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you make sense of a present-day issue or decision, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge or decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present challenge, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that insight shape your actions?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you better understand a current event or issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or societal issue?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue or decision you faced?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a time when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand current social or political issues, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a present-day issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you better understand a present-day issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you better understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a time when understanding the past helped you make sense of a current event or personal decision, and how did that insight impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a time when understanding the past helped you navigate a present-day challenge, and how did that insight shape your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a time when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, whether through a project or personal curiosity, has influenced your understanding of current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or family story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand current events or your own cultural identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand present-day issues or societal challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a book, film, or personal story, has influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself absorbed in a historical event or story? How did exploring the past influence your perspective on present-day issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on life?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural heritage that sparked your curiosity, and how do you think these experiences might shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a present-day issue or shaped your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, such as through a book, film, or family story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event or figure that sparked your curiosity, and how did that experience shape your perspective on the present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a book, film, or personal story, has influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural heritage through personal projects, travel, or family stories that sparked your curiosity about the past?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an instance where exploring the past, such as through a project or personal interest, influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your understanding of current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity and influenced your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a project or personal interest, has influenced your understanding of current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a past project or activity where you had to critically analyze the past to inform a decision or perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, whether through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a book, film, or personal story, has influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a book, project, or personal curiosity, has influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your understanding of current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a past project or activity where you had to critically analyze the past to understand its impact on present-day issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a book, project, or personal experience, has influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, whether through a project or personal interest, helped you better understand a current issue or decision?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue or influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through personal projects or academics, has influenced your perspective on current global issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a project or personal interest, has influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural heritage through personal projects, travel, or family stories that sparked your curiosity about the past?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural heritage that sparked your curiosity, and how do you think understanding the past could shape your future decisions?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or your own cultural identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, whether through a project or personal interest, helped you better understand a current issue or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a book, project, or personal experience, has influenced your understanding of current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, such as through a book, film, or family story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, such as through a book or family story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on life?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a contemporary challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a book, film, or personal story, has influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an instance where exploring the past, through a book, film, or personal story, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or family story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural heritage through personal projects, travels, or family stories that sparked your curiosity about the past?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or family story, sparked your curiosity about its relevance to today's world?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or family story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or decision, and how did that shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural traditions that sparked your curiosity, and how do you think understanding the past could shape your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a societal challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a project or personal interest, has influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, whether through a project or personal curiosity, influenced your understanding of current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand a current issue or decision?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or decision you faced?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, whether through a project or personal curiosity, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an instance where exploring the past, whether through a project or personal curiosity, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a present-day issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as a historical event or cultural tradition, sparked your curiosity or influenced your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or family story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a project or personal interest, has influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or decision, shaping your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, whether through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand current events or shaped your perspective on a global issue?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue or shaped your perspective on how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored the past to better understand current events, and if so, how did that journey shape your perspective on societal changes?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural heritage that sparked your curiosity, and how did that experience shape your perspective on the present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand a current issue or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a project or personal interest, has influenced your understanding of current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored the past to better understand current events or societal issues - can you share an example?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a personal or societal level?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think studying the past could shape your perspective on current global issues or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see this fascination shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or figure, how do you think studying the past could enrich your understanding of contemporary global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an instance where exploring the past helped you understand current events or shaped your perspective on life?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring past events or cultural heritage has sparked your curiosity, and how you see this shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a story from the past and wondered how it still influences our lives today?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that fascinates you and how exploring its story might shape your perspective or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past sparked your curiosity, and how do you see this interest shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or your own identity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand current events or your own identity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think understanding historical events can shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring historical events could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a historical story or event? How do you think exploring the past could shape your perspective or future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think understanding the past could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a historical event or figure that fascinates you, and how exploring its complexities might shape your perspective or career path?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or event, how do you think studying the past could influence your future decisions or perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think studying the past can help you better understand and navigate today's global challenges?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or personal challenge, and how did that shape your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how understanding the past has influenced your perspective on current events or your own life decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or your own identity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event or figure that sparked your curiosity, and how do you think learning from the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how understanding past events has influenced your perspective on current issues or decisions you make?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that sparked your curiosity, and how exploring its?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring these narratives could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or event, how do you think studying the past could enrich your future pursuits or personal perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think studying the past can shape your perspective on current global issues or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a historical story or event, and how do you think exploring the past could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue or influenced your perspective on life?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event or culture that sparked your curiosity, and how do you think understanding the past could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring these narratives could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think studying the past can help you better understand and navigate today's world?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and if so, how do you think exploring these narratives could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a story from the past, and how do you think exploring historical narratives could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that fascinates you, and how exploring its story could shape your understanding of the world?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural heritage in your free time, and how do you think this curiosity might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think understanding history will shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how understanding the past has influenced your perspective on a current event or personal decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or decision you were facing?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring these narratives could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see understanding historical contexts shaping your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring historical events could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your own life where understanding the past helped you navigate a present challenge or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring historical events could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring historical events could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past sparked your curiosity, and how do you think understanding history shapes our decisions today?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a story from the past, and how do you think exploring historical narratives could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a historical narrative and wondered how past events continue to shape our present world?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand current events or societal issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or event, how do you think exploring the past can shape your perspective on current global issues or your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think studying the past could shape your perspective on current global issues or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a historical story or event, and how do you think exploring the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think studying the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how understanding past events has influenced your perspective on current global issues, sparking your curiosity to explore further?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think understanding the past could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or challenge?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see historical insights shaping your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring historical events could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand the present or shaped your perspective on a current issue?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your life where exploring the past helped you better understand a current issue or challenge?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you think understanding history could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue, and how might such insights shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event or culture that sparked your curiosity, and how do you think understanding the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that sparked your curiosity, and how exploring its story might shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event or culture that sparked your curiosity, and how do you think understanding the past could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an instance where exploring the past sparked your curiosity, and how do you think understanding historical contexts might shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your past experiences, how do you think studying the past could shape your perspective on current global issues or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a historical story or event - how might exploring the past continue to shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your past where exploring the past helped you better understand a present-day issue or your own identity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical era or event, how do you think exploring the past could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that sparked your curiosity, and how exploring its?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring historical events could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your own life where understanding the past helped you better navigate a present challenge or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past has influenced your views on current events or shaped your personal values?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an instance where exploring the past sparked your curiosity, and how do you think understanding historical events shapes your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring these narratives could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past sparked your curiosity, and how do you think understanding historical events shapes your perspective on current issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored the past to better understand current global issues, and how might this curiosity shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in a historical story or event - how do you think exploring the past could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event or culture that sparked your curiosity, and how did it influence your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when learning about the past sparked your curiosity, and how do you think exploring history will shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your past experiences, can you describe a moment when understanding the past helped you navigate a present challenge or decision?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event or figure that sparked your curiosity, and how did it influence your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event that sparked your curiosity, and how do you think understanding the past could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring historical events could shape your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a historical event or figure that sparked your curiosity, and how exploring it further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your past where exploring the past helped you better understand a present-day issue or decision you faced?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your own experiences, how do you think studying the past can shape your perspective on current global issues and inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when exploring the past sparked your curiosity, and how do you see historical insights shaping your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand current events or shaped your perspective on life?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical figure or event, how do you think studying the past can shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how did that shape your curiosity about historical events?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Reflecting on your favorite historical figure or era, how do you think exploring the past can shape your perspective on current global issues or inform your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your life where understanding the past helped you navigate a present challenge, and how did that shape your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored a historical event or figure that sparked your curiosity, and how did it influence your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past sparked your curiosity, and how do you see this shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share a moment when learning about the past sparked your curiosity, and how do you see exploring historical narratives shaping your future perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue, and how might such insights continue to shape your perspectives?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever found yourself lost in the stories of the past, and how do you think exploring historical events could shape your perspective on current global issues?",
    "criterion": "Interests"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a present-day issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a time when exploring the past helped you better understand a current event or issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that insight shape your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event or personal experience?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or issue, and how did that insight impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill serve you in the future?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your studies or personal life where analyzing past events helped you better understand current issues or make informed decisions?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event or decision in your life?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that insight shape your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your studies or personal experiences where analyzing the past helped you better understand a current issue or decision?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue or decision you faced?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a present-day issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example from your studies or personal experiences where analyzing the past helped you better understand a current issue or decision?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that insight shape your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a present-day issue or challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current event or issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or social issue, and how did that impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you better understand a current event or personal challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that insight impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or societal issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a time when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event or personal decision?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a time when understanding the past helped you make sense of a current event or issue?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a present-day issue or decision, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a time when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a time when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you better understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or issue, and how did that impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you better understand a current issue, and how might this skill benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you make sense of a current event or decision in your life?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a current issue, and how did that insight shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or social issue, and how did that impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or issue, and how did that insight impact you?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge or decision, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current event or issue, and how did that impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand a current issue or influenced a personal decision?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when analyzing the past helped you understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that insight impact your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a present-day issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how analyzing past events has helped you understand current issues or make informed decisions in your own life?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when understanding the past helped you navigate a present-day challenge, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where analyzing the past helped you understand a current issue, and how did that shape your perspective?",
    "criterion": "Skills"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever uncovered a family story or cultural tradition that sparked your curiosity, and how did exploring it shape your understanding of the past?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, whether through a project or personal curiosity, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural heritage that sparked your curiosity, and how did they shape your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural traditions outside of schoolwork, and how did that experience shape your perspective on the past?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural heritage that sparked your curiosity, and how did that experience shape your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural heritage that sparked your curiosity, and how did that experience shape your views or interests?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a project or personal interest, has influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a past project or activity where you had to critically analyze the past to inform your understanding of current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your understanding of current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a book, film, or personal story, has influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you better understand a current issue, and how did that shape your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, such as through a book or family story, influenced your perspective on current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an instance where exploring the past, through a book, film, or family story, sparked your curiosity or influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on life?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a project or personal interest, has influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a book, project, or personal curiosity, has influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, whether through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or influenced your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, through books, films, or conversations, sparked your curiosity about how societies evolve over time?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, such as through a book, film, or family story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your understanding of current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand present-day issues or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity or influenced your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an instance where exploring the past, whether through a project or personal curiosity, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or family story, sparked your curiosity about its impact on today's world?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, through a book, film, or conversation, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, whether through a project or personal curiosity, has influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past helped you understand a present-day issue or influenced your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of a past project or activity where you had to critically analyze the past to understand its impact on present-day issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as a historical event or cultural tradition, sparked your curiosity or influenced your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on life?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a current issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, through a book, film, or conversation, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shape your perspective on life?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an instance where exploring the past, whether through a project or personal curiosity, influenced your understanding of current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, such as through a book or family story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, whether through a project or personal interest, helped you better understand a current issue or decision?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand present-day issues or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, such as through a book or family story, sparked your curiosity or influenced your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, such as through a book or family story, influenced your perspective on current events or your own life?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a book, project, or personal curiosity, has influenced your understanding of current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through personal projects or academics, has influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your understanding of current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a project or personal interest, has influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a present-day issue or shaped your perspective on a global challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, helped you better understand current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural heritage that sparked your curiosity, and how did these experiences shape your perspective on the world?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your understanding of current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity about its impact on today's world?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, such as through a book or family story, influenced your perspective on current events or your own life?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, visit, or story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an example of how exploring the past, through a project or personal interest, has influenced your understanding of current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever uncovered a forgotten family story or explored a historical event that sparked your curiosity about how the past shapes our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity or shaped your perspective?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Have you ever explored historical events or cultural heritage that sparked your curiosity, and how did that experience shape your understanding of the world?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shaped your perspective on a personal challenge?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand a present-day issue or influenced your perspective on a current event?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you better understand a current issue or shape your perspective on life?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past helped you understand current events or shape your perspective on societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, such as through a book or family story, influenced your understanding of current events or your own identity?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, through a book, film, or family story, sparked your curiosity about how societies evolve?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, such as through a book, film, or family story, sparked your curiosity about how historical events shape our present?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you share an experience where exploring the past, such as through a project or personal interest, influenced your perspective on current events or societal issues?",
    "criterion": "Experiences"
  },
  {
    "major": "History",
    "school": "NTU",
    "question": "Can you describe a moment when exploring the past, whether through a book, film, or personal story, sparked your curiosity or changed your perspective?",
    "criterion": "Experiences"
  }
]