[
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a financial problem, and how it sparked your curiosity about emerging innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging technology and finance to solve real-world problems - what excites you about using digital solutions to shape the future of financial services?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance to solve real-world problems - what excites you about using digital solutions to transform the way people manage money?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, and what sparked your curiosity in this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an example of how technology has influenced your financial decisions, and how you see this evolving in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance - what excites you about leveraging technology to solve real-world financial challenges in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging technology and finance to innovate banking solutions - what excites you about leveraging tech to transform financial services?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an example of how technology has influenced your financial decisions or habits, and how you see this evolving in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging technology and finance to solve real-world problems - what excites you about using digital tools to shape the future of financial services?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, and how did it spark your curiosity for future exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging technology and finance - what excites you about using digital solutions to shape the future of financial services?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, and what sparked your curiosity in this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an example of how you've used technology to solve a problem, and how that experience sparked your curiosity about its role in finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where technology simplified a financial?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging technology and finance to revolutionize banking - what aspects of this fusion excite you the most about shaping future financial systems?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, and how did that spark your curiosity for future opportunities in this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where technology helped you manage or make a financial decision, and how did that spark your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance to revolutionize banking - what excites you about designing digital solutions for the financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance to revolutionize banking - what excites you about leveraging technology to solve real-world financial challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an example of how you've used technology to simplify a financial?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance to revolutionize banking - what excites you about designing digital solutions for financial challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine you're designing a digital wallet for your peers; what features would you prioritize to make financial transactions easier and more appealing to your generation?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a moment when you saw technology transform financial services, and how did that spark your curiosity about its future possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance to create innovative solutions - what aspects of this fusion excite you the most about its potential impact on your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine a future where technology transforms banking - what excites you about leveraging tech to innovate financial services and solve real-world problems?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine a future where finance and technology converge - what aspects of this intersection excite you the most about shaping your career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine you're designing a digital payment system for a new generation of users - what excites you about blending finance and technology in innovative ways?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine you're designing a digital payment app; what features would you prioritize to make financial services more accessible, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem, and how did it spark your curiosity about its potential in finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an example of how you've used technology to solve a problem or improve a process, and how it sparked your curiosity about its potential in finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, and how did that spark your curiosity for future opportunities?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance to revolutionize banking - what excites you about designing digital solutions for tomorrow's financial challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine a future where finance and technology seamlessly merge - how do you see yourself contributing to or benefiting from this integration in your career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging technology and finance to solve real-world problems - what excites you about using tech to drive financial innovations in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem with money, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital platform that simplifies financial services - what aspects of this project excite you the most about pursuing a career at the intersection of technology and finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine a future where finance and technology merge - what excites you about leveraging tech to solve real-world financial challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance to revolutionize banking - what excites you about designing digital solutions for the financial world?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you saw technology solve a real-life financial problem, and how did that moment spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine a future where finance and technology merge - what aspects of this intersection excite you the most about shaping your career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an example of how you've used technology to manage or optimize financial tasks, and how that experience sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging technology with finance - what excites you about creating innovative digital solutions to simplify financial services for everyday people?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine a future where finance and technology merge - what excites you about solving real-world financial problems with innovative tech solutions?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, or imagine a scenario where you'd like to, and explain what excites you about it?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where technology helped you manage money or make financial decisions, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology with financial concepts, and how did that spark your curiosity for future opportunities?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine a career where technology meets finance - what excites you about leveraging digital solutions to shape the future of financial services?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, and how did it spark your curiosity for future opportunities?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital platform that simplifies financial transactions; what excites you about designing tech solutions to real-world financial challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a moment when you realized the impact of technology on financial services, sparking your curiosity to explore this intersection further?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a moment when technology simplified a financial?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital payment system for a new online marketplace - what aspects of this project excite you the most about pursuing a career in tech-driven finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance to revolutionize banking - what aspects of this fusion excite you the most about shaping future financial services?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging technology and finance to create innovative solutions - what excites you most about shaping the future of digital financial services?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, and how did that spark your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging technology and finance - what excites you about leveraging digital solutions to shape the future of financial services?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a moment when technology simplified a financial?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a moment when you realized how technology could transform financial services, and how that sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where technology helped you manage money or make a financial decision, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance to revolutionize banking - what excites you about using technology to solve real-world financial problems?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-life problem, and how did it spark your curiosity about its potential in finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine creating a digital payment system for a new startup - what excites you about designing tech solutions that impact financial services?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or make a process more efficient, and how did that experience spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Could you share an example of how you've used technology to manage or grow a personal project or investment, and what sparked your curiosity in that process?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, and how did that spark your curiosity for future exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where technology helped you manage money or make a financial decision, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine you're designing a digital payment system for a new eco-friendly marketplace - what features would you prioritize to drive both financial inclusion and sustainability?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging technology and finance to revolutionize banking - what excites you about leveraging digital solutions to shape the future of financial services?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance to create innovative solutions - what excites you most about shaping the future of financial services?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, or imagine how you might do so in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem with money, and how did that spark your curiosity about its potential?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Could you share an experience where you combined technology and finance to solve a problem, and how did that spark your curiosity for future opportunities?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem related to money or finance, and what excited you about that experience?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem or achieve a goal?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging technology and finance to revolutionize banking - what excites you about designing digital solutions for financial services, and why?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a moment when you saw technology solve a real-world financial problem, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you saw technology solve a real-life financial problem, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging technology and finance to revolutionize how people manage money - what excites you about being at the forefront of such innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine a future where finance and technology converge; what excites you about being at the forefront of this intersection in your career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, or imagine how you'd leverage tech to solve a financial challenge?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance to revolutionize banking - what excites you most about shaping the future of financial services through innovative technology?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an example of how you've used technology to solve a real-life problem, and how that experience sparked your curiosity in its potential to transform financial services?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, and how did that spark your curiosity for future innovations in these fields?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where technology helped you manage money, and how that sparked your curiosity about its potential in finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an example of how technology has influenced your financial decisions, and how you see this intersection evolving in your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-life problem, and how did that spark your curiosity about its potential in finance?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine designing a digital payment system for a new sustainable marketplace - what aspects of this project excite you the most about pursuing a tech-driven finance career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine a future where finance and technology converge - what excites you about leveraging tech to solve real-world financial challenges in your career?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem or achieve a goal?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine you're designing a digital wallet for your community - what features would you prioritize to make financial transactions easier and why?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Could you share an experience where you combined technology and finance, and how did that spark your curiosity for future opportunities in this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, and how did it spark your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, and how did that spark your curiosity for future innovations?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance to revolutionize banking - what aspects of this fusion excite you about shaping future financial services?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Imagine merging tech and finance to revolutionize banking - what excites you about creating digital solutions for financial challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or manage money, and how did that experience spark your curiosity about its potential?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Could you share an experience where you combined technology and finance, and how did that spark your curiosity for future opportunities in this intersection?",
    "criterion": "Interests"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience shape your interest in its potential for financial innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience shape your interest in its potential to transform financial services?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital payment system for a school fair, highlighting your problem-solving and tech skills?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience shape your interest in its potential for financial innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a problem with money or finance, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a real-life problem, and how did you adapt when faced with unexpected challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in finance or business?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in finance?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach learning a new digital tool to manage personal finances, and why this skill excites you for future opportunities?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a real-life problem, and how did that experience spark your interest in innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a problem, and how did that experience shape your interest in its financial applications?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a problem, and how did that experience shape your interest in its potential for financial innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to simplify a complex financial process, like budgeting or investing, for someone with little financial knowledge?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to simplify a financial?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience shape your interest in merging tech with finance?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a real-life problem, and how did that experience shape your interest in its potential to transform financial services?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd use technology to simplify a complex financial?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience spark your interest in its potential applications?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to simplify a financial?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a real-life problem, and how did that experience shape your interest in innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach creating a simple digital solution to help a friend manage their personal finances more efficiently?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem, and how did that impact your understanding of its potential in finance?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in innovating financial services?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to simplify a complex financial process you've encountered, and what skills do you think are essential for this?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience shape your interest in its potential for financial innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a problem, and how did that experience shape your interest in its potential to transform financial services?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to simplify a complex financial?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to simplify a financial?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a real-life problem, and how did that experience shape your interest in tech-driven solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you would design a simple digital solution to help a friend manage their daily expenses, and what skills do you think you'd need to learn to make it secure?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you would approach creating a simple digital tool to help a friend manage their personal finances effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in innovating for the financial sector?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach learning a new digital tool to manage personal finances, and how you see this skill evolving in your future career?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience shape your interest in its potential for financial innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to create a simple solution for a common financial problem you've personally encountered?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience shape your interest in its potential for financial innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in innovative financial solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to solve a real-life financial problem, like managing expenses for a student-run event?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to simplify a financial?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did this experience shape your interest in innovative financial solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience shape your interest in merging tech with finance?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach learning a new digital tool to manage personal finances, and what excites you about its potential?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to solve a real-life financial problem you've encountered, and what skills do you think you'd need to develop?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to solve a real-life financial problem you've encountered, and what skills do you think are essential for this?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and problem-solving to achieve a personal goal or help others, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to simplify a complex financial process you've encountered, like managing school fees or budgeting for a club event?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and finance in a creative way, and how did you stay updated with the rapidly changing fintech landscape?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a problem with money, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to simplify a complex financial process, like managing daily expenses, in your own life?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience shape your interest in its potential for financial innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and finance in a creative way, and how did that experience shape your interest in innovative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and finance to solve a problem or improve a process, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience shape your interest in its potential for financial innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a situation where you used technology to solve a real-life problem, and how did that experience shape your interest in tech-driven solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience spark your interest in finance or innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience spark your interest in innovating financial processes?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience spark your interest in finance or business?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a problem, and how did that experience shape your interest in its potential applications?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in its potential applications?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a real-world problem, and how did that experience shape your interest in finance?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and finance in a creative way, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in its potential for financial innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem related to money or finance, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a real-life problem, and how did that experience spark your interest in finance?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to simplify a financial?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to simplify a complex financial process you've encountered, and what skills do you think you'd need to develop?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a problem, and how did that experience shape your interest in its financial applications?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to simplify a complex financial process you've encountered, and what skills do you think are essential for this?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you combined technology and finance to solve a problem or achieve a goal?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you combined technology and finance to solve a problem or achieve a goal?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a real-life problem, and how did that experience shape your interest in its potential for financial innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to simplify a financial?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to solve a real-life financial problem you've encountered, and what skills do you think you'd need to develop?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a problem or improve a process - what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to solve a real-life financial problem, like managing daily expenses for a small business?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to solve a real-world financial problem, like helping small businesses manage cash flow?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience shape your interest in its potential for financial innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience spark your interest in finance or business?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you identified a problem and thought of a tech-based solution, even if you didn't have all the skills to implement it yet?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach learning a new tech tool to optimize a friend's small business finances, even with no prior experience?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience shape your interest in its potential for financial innovation?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem, and how did that experience shape your interest in its potential to transform financial services?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-world problem, and how did that experience shape your interest in tech-driven solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach learning a new tech tool to optimize a friend's small business, and what skills do you think you'd need to succeed?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a real-life problem, and how did that experience shape your interest in its potential applications?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach learning a new digital tool to manage personal finances, and what skills do you think are essential for this?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-life problem, and how did this impact your interest in finance or business?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a problem, and how did that experience shape your interest in its financial applications?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to solve a real-life financial problem you've personally encountered, and what skills do you think are essential for this?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach learning a new digital tool to manage personal finances, and what skills do you think are essential for this?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem with money management, and what did you learn from the experience?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process - how did you approach it?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to simplify a financial?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in tech-driven solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through a time when you used technology to solve a problem, and how did that experience shape your interest in its financial applications?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a real-life problem, and how did that experience shape your interest in innovative solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd leverage technology to solve a real-life financial problem you've encountered, and what skills do you think you'd need to develop?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interest in tech-driven solutions?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you walk me through how you'd approach designing a simple digital payment system for a school event, highlighting your problem-solving and tech skills?",
    "criterion": "Skills"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a financial problem or managed money digitally, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a financial problem or manage money, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, and how did it shape your interest in pursuing a career at their intersection?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem related to money management or financial decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, such as managing a budget with apps or exploring cryptocurrency, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage or analyze personal finances, and how did that experience spark your interest in its potential?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem or achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage money or solve a financial problem, and how did that experience spark your interest in learning more?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or manage information, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-world problem, and how did this impact your interest in finance or business?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, such as managing a budget online or using apps to track expenses?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, and how did that shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, such as managing budgets with apps or exploring crypto, and what sparked your interest in this fusion?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage finances or solve a real-life problem, and how did that experience shape your interest in innovative financial solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage money or make financial decisions, and how did that experience spark your interest in innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or manage information, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, such as managing budgets for a school project, that sparked your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-world problem, and how did that impact your interest in finance or business?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you explored or created any innovative solutions that combine technology and finance, such as a personal budgeting app or investing game?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology and finance, such as managing a budget with an app, to achieve a personal or team goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage finances, such as budgeting apps or cryptocurrency, and how did that experience spark your interest in its potential?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-life problem or manage information, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, such as managing a budget for a school project, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem related to money or finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem related to money management, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage finances or solve a money-related problem, and how did that experience spark your interest in learning more?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem related to money or finance, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you explored or created any innovative solutions where technology intersects with finance, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, and how did it spark your interest in shaping future financial solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage or track personal finances, and how did that experience spark your interest in innovating financial systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-world problem, and how did that impact your interest in finance or business?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem related to finance or money management, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem related to money management or finance, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process that involved managing or analyzing financial data?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-world problem, and how it sparked your interest in finance or business?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, such as managing budgets online or using apps for financial planning, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-life problem, and how did that impact your interest in finance or business?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to solve a financial problem, and how did that experience shape your interest in innovative financial solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process that involved managing money or resources?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you explored or created any projects where technology intersects with finance, and how did that spark your interest in this fusion?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, and how did that spark your interest in pursuing a related field?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem, and how it sparked your interest in its potential for financial innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you explored how technology intersects with finance in your projects or activities, and how do you see this shaping your future career?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and how it sparked your interest in finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage money or simulate financial decisions, and how did that experience spark your interest in its potential?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem related to money management, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or manage information, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem, and how did that impact your interest in tech-driven solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage or analyze money, such as budgeting apps or investment simulators, and what did you learn from the experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or manage information, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a financial problem, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interest in finance or business?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, such as managing a budget online or using an app to track savings?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interest in innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you explored or been involved in projects that combine technology with financial concepts, and how did these experiences shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you explored or been intrigued by how technology, like apps or digital platforms, can solve real-life financial problems or improve money management?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you combined technology with problem-solving, and how did that experience shape your interest in its potential applications?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you explored or created any projects that combine technology and finance, and how did that spark your interest in this intersection?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem or achieve a goal, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you explored how technology can solve real-world financial problems, and if so, what sparked your interest in this intersection of finance and tech?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and how it sparked your interest in finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, such as managing a budget online or exploring digital payment systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem or achieve a goal?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a financial problem, and how did that impact your interest in tech-driven solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, and how did it shape your interest in pursuing a career at their intersection?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem related to money or finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage or track finances, and how did that experience spark your interest in its potential?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, such as managing a budget with an app, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or improve a process, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage or track personal finances, and if so, how did that experience spark your interest in its potential?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-life problem, and how it sparked your interest in its potential for financial innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, and how did it shape your interest in pursuing a career at their intersection?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a real-world problem, and how it sparked your interest in finance or business?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem or improve a process, and how it sparked your interest in finance or business?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage or analyze personal finances, and how did that experience spark your interest in innovating financial solutions?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, such as managing a budget online or using an app to track investments?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage money or solve a financial problem, and how did that experience spark your interest in learning more?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem related to money management or finance?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage or analyze personal finances, and how did that experience spark your interest in innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage or analyze personal finances, and how did that experience spark your curiosity about its potential in the financial sector?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem, and how it sparked your interest in its potential for financial innovation?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, such as managing a budget app or analyzing financial data, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you used technology to solve a problem, and how did that impact your interest in finance or business?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Have you ever used technology to manage money or solve a financial problem, and how did that experience spark your interest in learning more?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance, such as managing a budget online or using an app to track expenses?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you describe a time when you used technology to solve a problem or manage information, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Information Systems (Financial Technology)",
    "school": "SMU",
    "question": "Can you share an experience where you combined technology and finance to solve a problem or achieve a goal?",
    "criterion": "Experiences"
  }
]