[
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share a moment when solving a complex puzzle or brain teaser excited you, and how do you see such problem-solving skills shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how do you see such analytical thinking shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or pattern fascinated you, and how did that experience shape your curiosity about pursuing related studies?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how did that spark your curiosity to explore deeper mathematical or computational concepts?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you found a creative connection between logical reasoning and problem-solving, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser excited you, and how did that experience shape your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or creating something with technology sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math or coding helped you solve a real-life problem, and how did that spark your curiosity for further exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser excited you, and how did that feeling influence your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or working with data sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem sparked your curiosity, and how did that experience influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem sparked your curiosity, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you found a creative connection between logic and technology, and how it sparked your curiosity about future possibilities?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or pattern sparked your curiosity, and how you see such challenges shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser sparked your curiosity, and how does that relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how do you see such analytical thinking shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or working with logical patterns truly excited you, and why did it spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math or coding helped you solve a problem, and how did that spark your curiosity for further exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or understanding a mathematical concept sparked your curiosity, and how did that experience influence your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or creating something with logic sparked your curiosity, and how might that relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem felt rewarding to you, and how does that relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or pattern sparked your curiosity, and how it relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or pattern sparked your curiosity, and how you'd like to explore such challenges in the future?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or problem sparked your curiosity, and how do you see such challenges shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or working with logical patterns sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or working with logical patterns sparked your curiosity, and how it relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem sparked your curiosity, and how did that experience influence your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or working with logical patterns sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser sparked your curiosity, and how did that experience influence your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or problem sparked joy, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem sparked your curiosity, and how did that experience shape your academic pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser excited you, and how did that feeling influence your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how do you see such analytical challenges shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or logical challenge sparked your curiosity, and how might such moments shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem, and how do you think such skills might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or understanding an abstract concept sparked your curiosity, and how did that moment influence your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math or computing helped you solve a problem, and how did that spark your curiosity for further exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math or computing sparked your curiosity, and how do you see this passion driving your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving, and how did that spark your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or puzzle sparked your curiosity, and how did that experience influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser excited you, and how did that experience shape your curiosity for problem-solving?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you found a creative solution to a complex problem, and how did that spark your curiosity in analytical thinking?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you found a creative solution to a complex problem, and how did that spark your curiosity in analytical fields?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math or computing sparked your curiosity, and how do you see this passion evolving in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or brain teaser sparked joy, and how might such problem-solving shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or understanding an abstract concept truly excited you, and how did that feeling influence your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or logical challenge excited you, and how do you see such skills shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser excited you, and how did that feeling influence your academic pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how did that make you curious about pursuing a field that combines logic and technology?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or pattern fascinated you, and how you think this curiosity might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem, and how did that experience shape your curiosity for analytical or computational thinking?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math or computing helped you solve a problem, and how did that spark your curiosity for more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how you think this relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or creating something with technology sparked your curiosity, and how did that make you feel?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math or computing helped you solve a problem, and how did that spark your curiosity for further exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser truly excited you, and how did that feeling influence your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or creating something with technology sparked your curiosity, and how did that moment shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser sparked your curiosity, and how did that experience influence your academic pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math or computing helped you solve a problem, and how did that spark your curiosity for further exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or creating something with technology sparked your curiosity, and how did that moment shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how do you think studying math and computing could help you tackle even bigger challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or creating something with logical steps sparked your curiosity, and why it resonated with you?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser excited you, and how did that feeling influence your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or creating something with technology sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you combined logical thinking with creativity to solve a problem, and how did that spark your curiosity for more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how do you think such skills could benefit your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem, and how did that experience shape your curiosity in pursuing analytical fields?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser sparked your curiosity, and how did that experience influence your academic pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math or computing helped you solve a problem, and how did that spark your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when you found a creative solution to a complex problem, and how did that experience shape your curiosity for analytical thinking?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or creating something logical sparked your curiosity, and how did that moment influence your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math helped you solve a complex problem, and how did that shape your curiosity about its applications in technology?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math or computing helped you solve a problem, and how did that moment shape your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser excited you, and how did that feeling influence your academic pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser excited you, and how did that experience shape your curiosity for problem-solving?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math or computing surprised you with its real-world impact, sparking your curiosity to explore more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share a moment when solving a complex problem or discovering a mathematical concept sparked your curiosity, and how do you see this passion evolving in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or problem sparked your curiosity, and how did that experience shape your interests?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you found a creative solution to a complex problem, and how did that spark your curiosity in analytical or computational thinking?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser excited you, and how did that experience shape your curiosity about problem-solving?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser excited you, and how did that feeling influence your career aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser excited you, and how do you think such problem-solving skills could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or finding a creative solution sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or problem sparked your curiosity, and how did that moment influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how did that spark your curiosity to explore more mathematical or computational concepts?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or brain teaser sparked your curiosity, and how might such challenges shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or creating something with technology excited you, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how do you see such analytical skills shaping your future?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you found a mathematical concept or a computational problem intriguing, and how exploring it impacted your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or puzzle sparked your curiosity, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math or computing surprised you with its real-world impact, and how did that shape your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser excited you, and how did that experience shape your curiosity for problem-solving?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you found a creative connection between logical reasoning and problem-solving, and how did that inspire your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how did that moment influence your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or understanding an abstract concept sparked your curiosity, and how did that moment influence your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or working with logical patterns sparked your curiosity, and how you applied creative thinking?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser sparked your curiosity, and how did that experience shape your aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where math or computing helped you solve a problem, and how did that spark your curiosity for further exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem sparked your curiosity, and how do you see such challenges shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex puzzle or problem sparked your curiosity, and how you think such challenges could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you solved a complex puzzle or brain teaser, and how did breaking it down help you find a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning to solve a complex problem, and how did it impact your decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you solved a complex problem using both logical reasoning and technical skills, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex problem that combines logical reasoning with analytical thinking, and why this process excites you?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you solved a complex problem using logical reasoning, and how did it impact your approach to challenges since then?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex problem that combines logical reasoning with computational thinking, like optimizing a daily routine?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex puzzle or brain teaser that requires both logical reasoning and creative problem-solving skills?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you solved a complex problem using logical reasoning, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning or problem-solving skills to overcome a challenge, and how did you apply mathematical or computational thinking?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex problem that combines logical reasoning with analytical thinking, and why this process excites you?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you solved a complex problem using both logical reasoning and creativity, and how did that process engage you?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or problem-solving skills to overcome a challenge, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did it impact your approach to challenges since then?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or problem-solving skills to overcome a challenge, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logic or patterns to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex puzzle or brain teaser, and what skills do you think are essential for breaking it down?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex problem that combines logical reasoning with analytical thinking, and why this process excites you?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex puzzle or problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or brain teaser excited you, and how did you apply logical reasoning to overcome challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did it impact your approach to challenges since then?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex puzzle or brain teaser, and what skills do you think that process helps you develop?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex puzzle or brain teaser, highlighting any mathematical or computational strategies you might use?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex puzzle or brain teaser that combines logic, patterns, and computational thinking?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex puzzle or brain teaser that requires both logical reasoning and creative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did it impact your decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex puzzle or brain teaser, and how you think that process relates to your future goals?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex puzzle or brain teaser that combines logical reasoning with creative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem made you feel accomplished, and how did you apply logical reasoning or creativity in the process?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or brain teaser taught you a valuable lesson about systematic thinking or problem-solving strategies?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex puzzle or problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex puzzle or brain teaser, and how did that experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex puzzle or brain teaser that requires both logical reasoning and creative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or problem sparked your curiosity, and how did you systematically approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning, and how did it spark your interest in pursuing analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex puzzle or brain teaser that requires both logical reasoning and creative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning to solve a complex problem, and how did it impact your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you solved a complex problem using logical reasoning, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex puzzle or brain teaser that requires both logical reasoning and creative problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning to solve a complex problem, and how did it impact your approach to challenges since?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you solved a complex problem using both logical reasoning and creative thinking, and how did that process engage you?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did it impact your approach to challenges since then?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning or pattern recognition to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you solved a complex problem using logical reasoning, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or puzzle sparked your curiosity, and how did you systematically approach finding a solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you solved a complex problem using logical reasoning, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex problem that requires both logical reasoning and creativity, like optimizing a daily routine?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or brain teaser sparked your curiosity, and how did you systematically approach the solution?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem, like a puzzle or brain teaser, excited you, and how you approached it?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when you used logical reasoning or problem-solving skills to overcome a challenge, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning or analytical skills, and how did that impact your decision to pursue further studies in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when you used logic or problem-solving to overcome a challenge, and how did it spark your curiosity in analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning or analytical skills, and how did that impact your decision to pursue a field that combines mathematics and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills, and how did it spark your curiosity in pursuing further studies in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning, and how did that impact your interest in analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills to overcome a challenge, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning, and how did it spark your curiosity in pursuing analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning or mathematical thinking, and how did it impact your approach to challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or problem-solving skills to overcome a challenge, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills to overcome a challenge, and how did it impact your decision to pursue a field that combines mathematics and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or problem sparked your curiosity, and how did you approach finding a creative solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning or analytical skills, and how did it impact your decision to pursue a field that integrates math and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning or analytical skills, and how did it impact your learning journey?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills to overcome a challenge, and how did that impact your interest in pursuing analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills to overcome a challenge, and how did it impact your interest in analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you solved a complex problem using logical reasoning or mathematical concepts, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills to overcome a challenge, and how did it impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or working with data sparked your curiosity, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills, and how did it spark your curiosity in analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did that shape your interest in pursuing a tech-driven field?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or optimize a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your interest in pursuing a field that combines mathematics and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning, and how did that process inspire your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or problem-solving skills to overcome a challenge, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or working on a project sparked your curiosity in both logical reasoning and computational thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your interest in pursuing a field that combines mathematics and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it impact your understanding of complex systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills, and how did it spark your curiosity for analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning, and how did it spark your curiosity in analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or problem sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex puzzle or brain teaser sparked your curiosity, and how did you approach finding a solution?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or problem-solving skills to overcome a challenge, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it impact your outcome or decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or problem-solving skills to overcome a challenge, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it impact your understanding of complex systems?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem, either mathematical or computational, felt rewarding to you, and why?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem, either mathematical or computational, sparked your curiosity and drove you to explore further?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills to overcome a challenge, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or problem-solving skills to overcome a challenge, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning, and how did that shape your interest in analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning or analytical skills, and how did it impact your decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills to overcome a challenge, and how did that impact your learning journey?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did it impact your interest in tech?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning or analytical skills, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills to overcome a challenge, and how did it spark your curiosity?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem, and how did it spark your interest in further exploration?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your curiosity for analytical subjects?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning or analytical skills, and how did it impact your learning journey?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or working on a project sparked your curiosity in mathematical or computational concepts?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or optimize a process, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning or analytical skills, and how did it impact your learning journey?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills to overcome a challenge, and how did it spark your interest in pursuing a field that combines mathematics and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem, either mathematical or computational, felt rewarding to you, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills to overcome a challenge, and how did it impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical thinking or problem-solving skills to overcome a challenge, and how did that impact your interest in pursuing analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it impact your decision-making or outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills to overcome a challenge, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or problem-solving skills to overcome a challenge, and how did it impact your decision to pursue a field that combines mathematics and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment where you used logical reasoning or problem-solving skills to overcome a challenge, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using mathematical or computational thinking, and how did it impact your decision to pursue this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills, and how did it spark your curiosity in pursuing analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning, and how did it spark your interest in pursuing analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your curiosity in pursuing further studies in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your interest in pursuing a field that combines mathematics and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your curiosity for analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when you used logical reasoning or problem-solving skills to overcome a challenge, and how did it impact your decision to pursue a field that combines mathematics and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills to overcome a challenge, and how did it spark your interest in pursuing a field that combines mathematics and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem creatively, and how did that shape your approach to analytical challenges?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem, either mathematical or computational, felt rewarding to you, and why?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem creatively, and how did it spark your curiosity in logical reasoning or analytical thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your curiosity for future studies?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or problem-solving skills to tackle a challenging puzzle or project?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your curiosity about pursuing a field that combines mathematics and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to solve a real-world problem or created something innovative using technology?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your curiosity in pursuing a field that combines mathematics and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or working on a project made you realize the power of combining logical reasoning with computational thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your interest in pursuing a field that combines mathematics and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your curiosity in pursuing a field that combines mathematics and computing?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or working with data sparked your curiosity, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning, and how did it spark your curiosity for analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem creatively, and how did this process influence your interest in pursuing analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or working on a project made you realize the power of combining mathematical reasoning with computational thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning, and how did it spark your interest in pursuing analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills to overcome a challenge, and how did it spark your curiosity in analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or problem-solving skills to overcome a challenge, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning, and how did that shape your interest in analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills to overcome a challenge, and how did it impact your interest in analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or working with logical systems sparked your curiosity, and how did you approach it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your curiosity in exploring mathematical or computational concepts further?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you solved a complex problem using logical reasoning or analytical skills, and how did that shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem, either in math or coding, felt rewarding to you, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex puzzle or brain teaser sparked your curiosity, and how did that experience influence your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills to overcome a challenge, and how did that impact your goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning or problem-solving skills, and how it sparked your curiosity for future studies or career?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your curiosity for analytical fields?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or working with data sparked your curiosity, and how did that experience shape your interests?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it impact your decision-making or outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning or problem-solving skills, and how did it spark your curiosity for future studies or career paths?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical and Computer Sciences",
    "school": "NTU",
    "question": "Can you describe a time when you solved a complex problem using mathematical reasoning or computational thinking, and how did that experience shape your interests?",
    "criterion": "Experiences"
  }
]