[
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a mathematical puzzle or understanding an economic concept sparked your curiosity, and how it relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or understanding economic trends sparked your curiosity, and how you see this passion evolving in your future?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you found a mathematical concept beautiful or an economic principle intriguing, and how it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem or analyzing data, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a mathematical puzzle or understanding an economic concept sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns in everyday life, and how exploring these patterns sparked your curiosity in understanding human decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how do you think mathematical thinking will shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns in everyday life or made strategic decisions, and how did that spark your curiosity in analytical thinking?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how did that experience shape your curiosity in analytical or quantitative fields?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a mathematical puzzle or understanding economic trends sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem, and how do you think this skill might benefit your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem or found a creative way to apply mathematical concepts to everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share a moment when solving a complex math problem or understanding an economic concept sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem or analyzing data, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem or analyzing data, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found a pattern or solved a problem using math, and how did that spark your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where analyzing numbers or patterns helped you make a better decision, and how did that feel?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem, and how do you think mathematical insights could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how do you think mathematical insights can shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you saw math in everyday life, and how did that spark your curiosity about its broader applications?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you saw math in everyday life, and how understanding its principles might influence your future decisions or career?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem, and how did that experience shape your curiosity about numbers or economic systems?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how did that relate to understanding human decision-making or behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've used logical reasoning or problem-solving in a non-academic?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns or made predictions, and how did that spark your curiosity in understanding the world through numbers?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem or analyzing data, and how it might relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem or analyzing data, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed a pattern or trend, and how understanding its mathematical structure could have informed a better decision?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you found a mathematical concept or economic principle particularly fascinating, and how it sparked your curiosity for further exploration?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you saw math or economics at play in real life, sparking your curiosity to explore these fields further?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or understanding economic trends sparked your curiosity, and how you see this driving your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you found a mathematical concept fascinating and how it might relate to understanding real-world economic issues?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a mathematical puzzle or understanding economic trends sparked your curiosity, and how do you see this fascination shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you found patterns or logic in everyday life intriguing, and how exploring these might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where analyzing numbers or understanding economic principles sparked your curiosity, and how might this relate to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where solving a complex problem or understanding economic trends sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem, and how do you think this skill might benefit your future career?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem or analyzing data, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem or analyzing data, and how it relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where analyzing numbers or economic trends sparked your curiosity, and how do you see this shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem or analyzing data, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share a moment when you saw math shaping real-world decisions, and how did that spark your curiosity about its role in everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you found patterns in data or everyday life intriguing, and how exploring them might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share a moment when you enjoyed solving a complex problem or analyzing data, and how it relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you found patterns or trends intriguing, and how exploring them might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns in everyday life, and how did that spark your curiosity about the world's underlying structures?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found a pattern or solved a problem that sparked your curiosity in both logical reasoning and real-world decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem or analyzing data, and how did that moment spark your curiosity about the world's patterns and economic systems?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how do you think mathematical insights could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem, and how do you think this skill might benefit your future studies or career?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you saw math or economics shaping real-life decisions, and how did that spark your curiosity about their interconnectedness?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem or analyzing data, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share a moment when you saw math or economics in everyday life, and how did that spark your curiosity about their interconnected role in decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've used mathematical concepts to make sense of everyday economic decisions or global issues?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where analyzing numbers or patterns sparked your curiosity, and how do you see this skill shaping your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you saw math shaping real-world decisions, and how that sparked your curiosity about its role in everyday life?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you found a mathematical concept fascinating and how it relates to understanding real-world economic issues?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share a moment when you found patterns in everyday life intriguing, and how exploring their underlying math might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a mathematical puzzle or analyzing everyday economic decisions sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex math problem or analyzing everyday economic decisions sparked your curiosity, and how that relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you noticed a pattern or structure in everyday life, and how understanding it deeper might impact your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how do you see analytical skills shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex math problem or understanding an economic concept sparked your curiosity, and how did that experience shape your goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns or made predictions in everyday life, and how did that spark your curiosity in understanding numbers or human decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a mathematical puzzle or understanding an economic concept sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a mathematical puzzle or analyzing everyday economic decisions sparked your curiosity, and how did that make you feel?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns in everyday life, and how did that spark your curiosity in understanding the world through numbers and human decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how do you think mathematical insights could shape your future decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen mathematics shape real-world decisions, and how that inspires your curiosity about its role in economic systems?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where analyzing numbers or economic trends sparked your curiosity, and how you see this shaping your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share a moment when you saw math in everyday life and how it sparked your curiosity about its broader economic implications?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found a pattern or solved a problem using math, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've seen math shape your understanding of everyday decisions or global issues, and why does this connection intrigue you?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've used mathematical thinking to solve a real-life problem, and how economics influences your daily decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how do you think studying math and economics could help you tackle real-world challenges?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you saw math in everyday life or current events, and how it sparked your curiosity about its broader applications?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you enjoyed solving a complex problem or analyzing data, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem or analyzing data, and how it sparked your curiosity about its real-world applications?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've used mathematical reasoning to understand a real-world problem or everyday situation?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a mathematical puzzle or understanding an economic concept sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns in everyday life or solved a problem using logical reasoning, and how did that excite you about learning more?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how did that relate to your curiosity about patterns in everyday life or global issues?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns or made predictions in everyday life, and how did that spark your curiosity in analytical fields?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you saw math in everyday life, and how it sparked your curiosity about its role in shaping economic decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a mathematical puzzle or understanding economic trends sparked your curiosity, and how that relates to your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns or made predictions in everyday life, and how did that spark your curiosity in analytical thinking?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've used logical reasoning or problem-solving in a creative way that excites you for future studies?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you found patterns or logic in everyday life intriguing, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem, and how do you think mathematical insights can shape our understanding of everyday economic decisions?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you enjoyed solving a complex problem or made a strategic decision, and how did that moment spark your curiosity in analytical fields?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an example from your studies or personal experiences where you enjoyed applying mathematical concepts to understand real-world economic issues?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share a moment when solving a mathematical puzzle or analyzing everyday economic decisions sparked your curiosity, and how might this relate to your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns or solved puzzles, and how does that relate to your curiosity about problem-solving in the real world?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns or made predictions, and how did that spark your curiosity about the world's underlying structures?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns in everyday life, and how exploring these patterns sparked your curiosity in understanding the world's complexities?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you found patterns in everyday life fascinating, and how exploring them might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found a pattern or solved a problem that sparked your curiosity in both logical reasoning and real-world decision-making?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns or solved a problem using logical reasoning, and how did that spark your curiosity in understanding complex systems?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you found patterns in everyday life or made strategic decisions, and how did that spark your curiosity in analytical thinking?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've used logical reasoning or problem-solving in a non-academic?",
    "criterion": "Interests"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied logical reasoning to solve a complex problem, and how did it impact your decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did that experience shape your approach to understanding real-world issues?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've used logical reasoning or problem-solving skills to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your analytical approach?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to understanding real-world issues?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to understanding real-world issues?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to understanding real-world issues?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach analyzing the economic impact of a new public transport policy using mathematical models, and what insights you hope to gain?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you applied logical reasoning to make a decision, and how did the outcome influence your approach to problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd apply mathematical modeling to solve a real-world economic problem that directly impacts your community?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd apply mathematical modeling to optimize a real-life decision, like choosing a university or planning a budget?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning or analytical thinking to solve a complex problem or make a decision?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex problem that involves both logical reasoning and understanding of market behaviors?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden economic downturn on a local business using mathematical models from your studies?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to make a decision, and how did you balance analytical thinking with practical considerations?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning or analytical thinking to solve a complex problem, and how did that process impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to understanding real-world issues?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've applied logical reasoning or problem-solving skills to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning or problem-solving skills to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning or problem-solving to make a decision with uncertain outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning or problem-solving skills to make a decision with uncertain outcomes?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did the outcome impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you've applied logical reasoning to make a decision, and how did the outcome influence your approach to problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to understanding real-world issues?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach optimizing a limited budget for a school project, balancing costs and outcomes effectively?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning or problem-solving skills to make a decision, and how did you evaluate its effectiveness?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning or problem-solving skills to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've applied mathematical concepts to make a decision or understand a real-world issue, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did this experience shape your approach to understanding real-world issues?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex, real-world problem that requires both analytical math skills and economic reasoning?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach analyzing the impact of a sudden economic policy change using mathematical models?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the impact of a new tax policy on consumer behavior using mathematical modeling?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex, real-world problem that requires both analytical thinking and consideration of economic principles?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning or problem-solving skills to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning or problem-solving to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did the process impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you applied mathematical concepts to solve a real-life problem, and how did this experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your decision-making approach?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex problem that involves both logical reasoning and understanding human decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex, open-ended problem that combines logical reasoning with real-world decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd apply logical reasoning to solve a complex, real-world problem, and how the outcome might impact everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning or analytical skills to solve a complex problem or make a strategic decision?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did it impact your decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did the outcome impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did the outcome impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex, real-world problem that requires both analytical math skills and an understanding of economic principles?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used mathematical reasoning to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did the process impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to understanding real-world issues?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex, real-world problem using mathematical reasoning, and how the outcome might impact everyday life?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach balancing the use of statistical models with economic principles to inform a personal investment decision?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning or problem-solving skills to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you had to analyze complex data or patterns, and how did this experience shape your problem-solving approach?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did this experience shape your approach to understanding real-world issues?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did this experience shape your approach to understanding real-world situations?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd apply mathematical concepts to understand and predict everyday economic phenomena, like personal budgeting or market trends?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your approach to understanding real-world issues?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning or problem-solving skills to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or problem-solving to make a decision, and how did the outcome influence your approach to future challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden market shift on consumer behavior using mathematical models?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an example of how you've used logical reasoning to solve a complex problem, and how do you think this skill will benefit your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd apply logical reasoning to solve a complex, real-world problem, and what sparks your curiosity in understanding patterns or trends?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach balancing the use of statistical models with economic principles to inform a personal investment decision?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you applied mathematical concepts to understand a real-world problem or make an informed decision?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to analyze a complex problem, and how did this experience shape your approach to decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your analytical approach?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did it impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex, real-world problem that involves both logical reasoning and understanding of market behaviors?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you've used mathematical concepts to analyze a real-world problem, and how did this experience shape your interest in pursuing a field that integrates analytical and economic thinking?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd analyze the impact of a sudden economic policy change using mathematical modeling, and what insights you hope to gain?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you applied mathematical reasoning to make a more informed decision, and how did this impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning or analytical thinking to solve a complex problem or make a strategic decision?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd apply mathematical concepts to analyze and solve a real-world economic problem that interests you?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning or problem-solving skills to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or analytical skills to solve a complex problem, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd apply logical reasoning to balance personal spending with long-term savings goals in a hypothetical first job scenario?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you've used logical reasoning or analytical thinking to solve a complex problem, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd apply mathematical modeling to optimize a real-life economic dilemma, like managing a student budget?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did it impact your decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did the outcome impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did this experience shape your interest in analytical fields?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did that experience shape your approach to understanding real-world challenges?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning to solve a complex problem, and how did this experience shape your approach to understanding real-world issues?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you've applied logical reasoning to solve a complex problem, and how did it impact your decision-making process?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to analyze a complex problem, and how did the process influence your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you applied logical reasoning to make a decision, and how did this experience shape your approach to problem-solving?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex problem that combines logical reasoning with real-world data analysis?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you've used logical reasoning or problem-solving skills to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through how you'd approach solving a complex problem that involves both logical reasoning and understanding of how people make choices?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you've used logical reasoning or problem-solving skills to make a decision, and how did it impact the outcome?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you walk me through a time when you used logical reasoning to solve a complex problem, and how did that experience shape your analytical skills?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning to solve a complex problem, and how did the outcome impact your decision-making?",
    "criterion": "Skills"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when solving a complex problem or analyzing data sparked your curiosity, and how did it relate to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or made an informed decision using analytical thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used mathematical reasoning to solve a real-life problem or inform a personal decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world issue, and how did this shape your problem-solving approach?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you used logical reasoning or problem-solving skills to make a decision, and how did it impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world issue or made a data-driven decision in your daily life?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used mathematical reasoning to analyze a real-world problem or made an informed decision with limited information?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or problem-solving skills to make a decision or understand a complex situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or made an informed decision using analytical thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or make an informed decision about everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning or analytical thinking to solve a problem, and how did it impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you applied mathematical concepts to understand a real-world problem or made a decision using analytical thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you applied mathematical concepts to analyze a real-world problem or make an informed decision about everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you used logical reasoning or analytical thinking to solve a complex problem or make a strategic decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or made an informed decision using data analysis?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or problem-solving to understand a complex situation or make a decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or make a decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or make an informed decision about everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-life situation or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world issue or made an informed decision using analytical thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or make an informed decision about everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or made an informed decision using analytical thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data, and what did you learn?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world issue or made an informed decision using analytical thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used logical reasoning or analytical skills to make a decision, and how did it impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world issue, and how did it shape your perspective on decision-making?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you've applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you applied mathematical concepts to analyze a real-world problem or everyday situation, and what insights did you gain?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or made an informed decision using analytical skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or make an informed decision in your daily life?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you applied mathematical concepts to analyze a real-world problem or made an informed decision involving trade-offs?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or analytical skills to solve a complex problem or make an informed decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or make a decision that impacted you or others?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you used logical reasoning or analytical skills to make a decision, and how did it impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or made an informed decision using analytical skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you've applied mathematical concepts to understand a real-world problem or made an informed decision using analytical skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when you applied mathematical concepts to solve a real-life problem or inform a personal decision?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a moment when solving a complex problem or analyzing data sparked your curiosity, and how it relates to your future goals?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used mathematical reasoning to solve a real-world problem, and how did this experience shape your career aspirations?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or make an informed decision in your daily life?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or made an informed decision using analytical skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world issue or made an informed decision using analytical thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a situation where you used mathematical reasoning to analyze a real-world problem or made an informed decision involving trade-offs?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used logical reasoning or analytical thinking to make a decision, and how did it impact the outcome?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or everyday situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used mathematical concepts to analyze a real-world problem or everyday situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or make an informed decision about everyday life?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world issue or made a data-driven decision in a personal or team project?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to analyze a real-world problem or made an informed decision using data?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or made an informed decision using analytical thinking?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you applied mathematical concepts to analyze a real-world problem or made an informed decision using economic principles?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used mathematical concepts to analyze a real-world problem or inform a personal decision, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or make an informed decision in your daily life?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or made an informed decision using data analysis?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you share an experience where you applied mathematical concepts to understand a real-world problem or made an informed decision using analytical skills?",
    "criterion": "Experiences"
  },
  {
    "major": "Mathematical Sciences and Economics",
    "school": "NTU",
    "question": "Can you describe a time when you used mathematical reasoning to analyze a real-world problem or made an informed decision with economic implications?",
    "criterion": "Experiences"
  }
]