[
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about someone's behavior, and how understanding their motivations might impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this interest could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how might exploring this field further enrich your life or career?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Reflecting on your own experiences, can you describe a moment when understanding human behavior or motivations fascinated you and why it sparked your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever observed a situation where someone's behavior completely surprised you, and what sparked your curiosity to understand why they acted that way?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or thoughts fascinated you, and how you think studying this field could help you make a meaningful impact?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share a moment when you found human behavior intriguing, and how exploring its complexities might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding human behavior fascinated you, and how exploring this interest could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding human behavior or motivations fascinated you, and how exploring this interest could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding someone's behavior or thoughts fascinated you, and how you think studying this field could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how exploring this further could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about why someone behaved a certain way, and how you think understanding their mindset could benefit your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this field could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you tried to understand someone's behavior or motivations, and how did that spark your curiosity about the human mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever observed a behavior that puzzled you, and what motivated you to understand the underlying reasons behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share a moment when you were curious about someone's behavior or motivations, and how did that spark your desire to understand people better?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how would exploring these motivations impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how would exploring the human mind impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or motivations fascinated you, and how exploring this further could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding someone's behavior or thoughts fascinated you, and how you think studying this field could enrich your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever tried to understand someone's behavior or motivations, and if so, what sparked your curiosity about the human mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever observed human behaviors that puzzled you, and what motivates you to understand the underlying reasons behind them?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding someone's behavior or thoughts fascinated you, and how exploring this further could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this further could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how would exploring these questions help shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or thoughts fascinated you, and how you think exploring this curiosity could impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share a personal experience or observation that sparked your curiosity about human behavior, and how do you see this curiosity shaping your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how would exploring these motivations impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself curious about why people behave the way they do, and how this curiosity might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior fascinated you, and how might exploring this curiosity benefit your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging situation, and how might exploring this field further impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how you could apply that understanding to make a positive impact in the world?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you were curious about someone's behavior, and how understanding their motivations might influence your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how you think exploring this curiosity could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding someone's behavior or mindset fascinated you, and how you think studying this field could help you make a positive impact?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging social situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Reflecting on your daily interactions, what aspects of human behavior or mental processes intrigue you the most and why do you want to explore them further?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you found human behavior intriguing, and how exploring it further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about why someone behaved a certain way, and how did that spark your desire to learn more?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Reflecting on your daily interactions, what aspects of human behavior or mental processes intrigue you the most and why do you want to explore them further?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever observed a behavior that puzzled you, and what sparked your curiosity to understand the underlying motivations or influences behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how you could apply that understanding to make a positive impact in the world?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how you think exploring this field could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever observed a behavior or thought pattern that intrigued you, and how do you think studying human minds could help you understand it better?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or thoughts fascinated you, and how exploring this further could enrich your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how you could apply this understanding to make a positive impact?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Reflecting on your personal experiences, how do you think understanding human behavior could help you achieve your future goals or make a positive impact?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself curious about why people behave the way they do, and how would exploring these questions shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share a personal experience or observation that sparked your curiosity about how people think, behave, or interact, and why it fascinates you?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this further could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you were fascinated by human behavior, and how exploring this interest could shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how understanding these behaviors could impact your future interactions or career choices?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share a moment when understanding someone's behavior or thoughts fascinated you, and how you think exploring this curiosity could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever observed a behavior in someone that intrigued you, and what motivated you to understand the underlying reasons behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share a personal experience where understanding human behavior or emotions helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you were curious about why someone behaved a certain way, and how did that spark your interest in understanding human behavior?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or mental processes fascinated you, and how might exploring this further impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding someone's behavior or thoughts fascinated you, and how exploring this further might impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Reflecting on your daily interactions, what aspects of human behavior or mental processes intrigue you the most and why do you want to explore them further?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or thoughts fascinated you, and how you think exploring this curiosity could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever observed a behavior in someone that intrigued you, and what motivated you to understand the underlying reasons behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how you think exploring this curiosity could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how would exploring the human mind influence your future aspirations?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or thoughts fascinated you, and how exploring this curiosity could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever observed human behavior that fascinated or puzzled you, and what motivated you to learn more about the underlying reasons?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how understanding those reasons could help you in your future interactions or career?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how exploring this further might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging social situation, and how did that spark your curiosity about the mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, sparking your curiosity in this field?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how understanding these motivations could help you in your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding someone's behavior or motivations fascinated you, and how you think exploring this curiosity could impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how might exploring this curiosity shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how you could apply that understanding to help others or improve relationships?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself wondering why people behave in certain ways, and how that curiosity might shape your future studies or career?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Reflecting on your daily interactions, how do you think understanding human behavior could enrich your future career or personal relationships?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding someone's behavior or mindset fascinated you, and how exploring this further might shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share a moment when understanding someone's behavior or motivations fascinated you, and how exploring this curiosity might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or motivations fascinated you, and how you think exploring this field could impact your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or thoughts fascinated you, and how you think exploring this curiosity could shape your future?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or mental processes fascinated you, and how might exploring this field shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever observed a behavior that puzzled you, and what motivated you to understand the underlying reasons behind it?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how would exploring the human mind impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging situation, and how did that spark your curiosity about the mind?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share a moment when understanding someone's behavior or mindset fascinated you, and how did that spark your curiosity about human psychology?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior fascinated you, and how exploring this further could shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding human behavior or motivations fascinated you, and how exploring this further could impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you found human behavior intriguing, and how exploring its complexities might shape your future pursuits?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever observed a behavior in yourself or others that you couldn't explain, and what motivates you to understand the underlying reasons?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or emotions helped you navigate a challenging situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever tried to understand someone's behavior or motivations that seemed unusual to you, and what sparked your curiosity in those moments?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior or motivations helped you navigate a challenging social situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Have you ever found yourself curious about why people behave in certain ways, and how would exploring these motivations impact your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or thoughts fascinated you, and how exploring this curiosity might shape your future goals?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where understanding human behavior helped you navigate a challenging social situation, and how did that spark your curiosity?",
    "criterion": "Interests"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you helped someone understand their behavior, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you tried to understand someone's behavior or perspective that was very different from your own?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where observing human behavior sparked your curiosity, and how you would systematically explore the underlying reasons behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and how did that experience shape your interest in studying human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their emotions or behaviors, and how did that experience shape your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you effectively helped someone understand their behavior or emotions, and how did that experience shape your interest in this field?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you effectively supported a friend in distress, and what did you learn about human behavior from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you effectively helped someone understand their emotions or behaviors, and how did that experience shape your interest in this field?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in studying human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience spark your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience spark your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you effectively supported a friend or family member through a tough emotional situation, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you effectively supported a friend in distress, and what did you learn about human behavior from this experience?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where understanding someone's behavior or motivations helped you navigate a challenging social interaction?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you effectively helped someone understand their behavior or emotions, and how did that experience shape your interests?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you helped someone understand their feelings or behaviors, and how did that experience spark your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where observing human behavior sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you effectively supported a friend in distress, and how did this experience shape your understanding of human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience spark your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you tried to understand someone's behavior or perspective that was very different from your own?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you effectively helped someone understand their feelings or behaviors, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an example of a time when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you observed a behavior that intrigued you, and how would you go about understanding the underlying motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and how did that experience shape your interest in this field?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience spark your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their emotions or behaviors, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or emotions helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you observed an interesting human behavior and tried to understand the motivations behind it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where observing human behavior sparked your curiosity, and how do you think understanding minds could shape your future pursuits?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone overcome a challenge, and how did that shape your understanding of human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that shape your interest in human mindset?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you observed human behavior that intrigued you, and how would you go about understanding the underlying motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you effectively helped someone understand their emotions or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you effectively helped someone understand their emotions or behavior, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an example of how you've helped someone understand their behavior or emotions, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you tried to understand someone's behavior or perspective that was very different from your own?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior, and how did that impact your interest in understanding human motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and what strategies did you use in that situation?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you helped someone understand their behavior or emotions, and how did that experience spark your curiosity in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you effectively helped someone understand their feelings or behaviors, and how did that experience impact your own perspective?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in studying human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you effectively supported a friend or family member through a tough emotional period, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you effectively helped someone understand their feelings or behaviors, and what strategies did you use?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience spark your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you effectively supported a friend in distress, and what did you learn about human behavior from that experience?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you observed a change in someone's behavior and what insights you gained from it about their motivations?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where understanding human behavior helped you navigate a challenging social interaction, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior, and how did that impact your interest in understanding human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you tried to understand someone's behavior or perspective that was very different from your own?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and how did you apply that insight?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in this field?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you tried to understand someone's behavior or perspective that was very different from your own?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where understanding someone's behavior or motivations helped you navigate a challenging social interaction, and what did you learn from it?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a situation where you tried to understand someone's behavior or perspective that was very different from your own?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about human minds?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Skills"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you helped someone understand their feelings or behaviors, and how did that experience impact your curiosity about human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you observed human behavior, and how did that spark your curiosity about the mind or behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you observed human behavior that sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you observed human behavior that intrigued you, and how you think understanding it deeper could impact your future pursuits?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing human behavior, and how did that spark your curiosity about understanding people better?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when observing human behavior sparked your curiosity, and how did you explore or learn more about it afterwards?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you helped someone understand their feelings or behaviors, and how did that experience shape your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you observed human behavior, and how it sparked your curiosity about the mind or behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you observed human behavior, and how did that spark your curiosity about the mind or behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing human behavior and tried to understand the motivations behind it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing human behavior and what sparked your curiosity to understand the motivations behind it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you observed human behavior, and how it sparked your curiosity to understand the underlying motivations or emotions?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when observing human behavior sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when observing human behavior sparked your curiosity, and how did you explore or learn more about it afterwards?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you observed or experienced a change in behavior, and how did that spark your curiosity about the underlying motivations?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it about human interactions?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience spark your curiosity about human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you observed an intriguing human behavior and wondered about the underlying reasons or motivations behind it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you helped someone understand their feelings or behaviors, and what did you learn from that experience?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when you helped someone understand their behavior or emotions, and how did that experience shape your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human mindset?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you observed human behavior that sparked your curiosity, and how did you explore or learn more about it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in human behavior?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a time when understanding someone's behavior or motivations helped you navigate a challenging social situation, and what did you learn from it?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you observed human behavior, and how it sparked your curiosity to understand the underlying motivations or emotions?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you tried to understand someone's behavior or perspective that differed from yours, and how did that experience impact you?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when understanding someone's behavior or motivations helped you navigate a challenging social situation?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you helped someone understand their feelings or behaviors, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in this field?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in understanding human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying human minds?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you share an experience where you helped someone understand their behavior or emotions, and how did that impact your interest in studying the mind?",
    "criterion": "Experiences"
  },
  {
    "major": "Psychology",
    "school": "NUS",
    "question": "Can you describe a moment when you helped someone understand their behavior or emotions, and how did that experience shape your curiosity about the human mind?",
    "criterion": "Experiences"
  }
]